[{"category": [], "tech1": "", "description": ["Loud 'N Clear Personal Sound Amplifier allows you to turn up the volume on what people around you are saying, listen at the level you want without disturbing others, hear a pin drop from across the room."], "title": "Loud 'N Clear&trade; Personal Sound Amplifier", "brand": "idea village", "price": "$10.50", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Brand new and high quality<br> Enables fast volleys and ensures flight consistency<br> Good Flight and durability<br> Crafted using good-quality goose feathers with a durable foam head of this White Badminton.<br> Goose Shuttlecocks is for club match or club play<br> Package Include: 12 x Badminton Balls (in one tube)"], "brand": "GBSTORE", "price": "$12.99", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/31lQlMNtazL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31Kzq8dVXaL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31LPmXQqmOL.jpg"]},
{"category": [], "tech1": "", "description": [], "title": "FESHFEN Scrunchy Scrunchies Synthetic Hair Bun Updo Hair Pieces Ponytail Hair Extensions Wavy Curly Messy Hair Bun Extensions Donut Hair Chignons Piece Wig", "price": "$15", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61NtE9aWUIL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51epWeVdizL.jpg", "https://images-na.ssl-images-amazon.com/images/I/61PFeOUwCVL.jpg"]},
{"category": [], "tech1": "", "description": [], "title": "Wella Koleston Perfect Hair Colour 44/44 Medium Intense Red Brown 60ml", "price": "$20", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41itSWRs8VL.jpg"]},
{"category": [], "tech1": "", "description": ["Lacto Calamine Skin Balance Daily Nourishing Lotion - Oil Control (120ml) (Pack Of 2)"], "title": "Lacto Calamine Skin Balance Oil control 120 ml. (Pack of 2)",  "price": "$12.15", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51BaUppeZ6L.jpg", "https://images-na.ssl-images-amazon.com/images/I/51BaUppeZ6L.jpg"]},
{"category": [], "tech1": "", "description": ["Mary Kay Satin Hands Peach Hand Cream Travel Size Set of 6"], "title": "Mary Kay Satin Hands Hand Cream Travel MINI Size Set of 6", "price": "$30", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": [], "title": "Unique Custom Cast Iron Liner Shader Tattoo Machine E010541", "price": "$90", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["According to the legend, in 1613, two brothers of native origin and a black boy of nine or ten years old, went for salt to the Nipe Bay \"in the northeast coast of Cuba\", and they saw under the sea the image of the Virgin Caridad del Cobre. It is also said the image was taken to the town Real of Minas, very near Santiago de Cuba, where are the largest layers of copper outdoors in America."], "title": "Imagen Bendita Por Su Santidad Our Lady of Charity Caridad Del Cobre Patrona De Cuba Cachita B-36 Small - 6 Inches", "brand": "Chango", "price": "", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Novi prevod proslavljene knjige Zadruga objavljuje prvi put - sa autenticnim ilustracijama u koloru, na posebnoj hartiji, kao divot-knjigu. Velika parabola o dobroti u kosmosu, o filozofiji postojanja malog coveka u ogromnom svetu - upakovano u novi poklon-format. Knjiga koju ce pozeleti da imaju i oni koji vec poseduju vise izdanja cudesne knjige.", "", ""], "title": "Mali princ", "brand": "Srpska knjizevna zadruga", "price": "$28.99", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51VcC85I8lL.jpg"]},
{"category": [], "tech1": "", "description": ["Moleskine's Card Wallet in Payne's Grey is the ultimate accessory for holding currency, identity and various other vital cards. Coloured in two-tone with an Olive Green interior and contrast stitching. Contains 3 credit card slots, 1 external and 2 internal flat pockets. Also includes a removable card holder with net, perfect for using smart cards on the go. Measures 7 x 11 x 1cm.", "", ""], "title": "Moleskine Payne's Grey Card Wallet (Moleskine Non-Paper)", "brand": "Sunatoria", "price": "$46.90",  "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41YCKKalAeL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31YPGHwiC-L.jpg", "https://images-na.ssl-images-amazon.com/images/I/51DlDL3p7mL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41Vbu2-9G2L.jpg", "https://images-na.ssl-images-amazon.com/images/I/51gBeO0qwcL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51BuHljbwYL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41N1k3oSpwL.jpg"]},
{"category": [], "tech1": "", "description": [], "title": "L'eternauta, il romanzo", "brand": "Enter The Arena", "price": "$50.90", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41Uux54pDXL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51TOemv7KcL.jpg"]},
{"category": [], "tech1": "", "description": [], "title": "Hello Kitty LALA Lovely Kids Girls Summer Slippers Shoes Beach Pool Black US size 3","brand": "Hello Kitty", "price": "$24.99", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41Vf3mKKZBL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31pDNSufkjL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41hbUxgBk9L.jpg", "https://images-na.ssl-images-amazon.com/images/I/51XXiau9lZL.jpg"]},
{"category": [], "tech1": "", "description": [], "title": "Shiseido Aquair Shampoo/Conditioner/Spray SET - 600ml*2 + 220ml", "brand": "", "price": "$70", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41BYNfTV8zL.jpg"]},
{"category": [], "tech1": "", "description": ["If you can design one thing, you can design everything. The Italian architect and designer Lella Vignelli has turned her hand to every kind of project, from furniture, interiors, showrooms and exhibitions to product design, silverware and clothing. In the beginning of the 1960s she established the Vignelli Office of Design and Architecture in Milan together with her husband Massimo Vignelli. In the end of the decade the pair settled in New York and launched one of the worlds biggest design firms at the time, Unimark International. Lella Vignelli received AIGAs Gold Medal in 1983.\n\nHall of Femmes: Lella Vignelli includes an introductionary essay  by Martha Scotford, Professor of Graphic Design and author of Cipe Pineles: a Life of Design. It is richly illustrated, much of it never before published."], "title": "Hall of Femmes: Lella Vignelli (Hall of Femmes)", "brand": "Oyster Press", "price": "$67", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": [], "title": "Amino Genesis Cocoon Rejuvenating Body Cr&egrave;me", "brand": "Amino Genesis", "price": "$90", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["100 % Authentic Product Sanrio Hello Kitty \n    High Quality in Perfect Condition with Original Tag\n    Condition: Brand New\n    Packing: 1 pc\n    HELLO KITTY TAUPE EMBOSSED FACE WALLET EMBOSSED FAUX LEATHER WALLET WITH METAL PLAQUE DETAIL. 8\" X 4\"", "", ""], "title": "Hello Kitty Taupe Embossed Face Wallet Loungefly Sanrio", "brand": "Hello Kitty", "price": "$99", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51ONYA3egGL.jpg", "https://images-na.ssl-images-amazon.com/images/I/517L9OT7HEL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51zpH8JIKgL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51wSUeCJIcL.jpg"]},
{"category": [], "tech1": "", "description": [], "title": "Estee Lauder Resilience Lift Night Firming/sculpting Face and Neck Creme (Travel Size 0.5 Oz/15 Ml) by Chom", "price": "$110", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41LQ8mWtRgL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41OgQSoXVGL.jpg"]},
{"category": [], "tech1": "", "description": ["Finale Whitening Cream for Armpit/Inner thigh/Elbow/Knee Size: 30 grams / 1.05 oz. It helps brightening underarm, groin area. Lightens dark spot while removing dead skin cell gradually within 4 weeks. High quality natural and botanical ingredients have been carefully blended and specially formulated with skin lightening agents and multivitamin, boost skin clarity and tone, protect against oxidative damage ,moisture loss and make your skin even more smooth and supple. Can use for a long time, skin will not turn darker than before if discontinued. Safe to use for a continued period. Nanomolecules help penetrate effectively Hypoallergenic clinically tested GMP manufacturer How to use: Apply to the dry clean desired skin area 1-2 times daily. Ingredients: Tamarind extract, Emblic extract, Ipomoea extract, Aloe vera extract, AHA, Vitamin A, Vitamin C, Vitamin E, Vitamin F, Squalene, Allantoin Manufactured in Thailand"], "title": "Finale Whitening Cream 30g. Armpit/inner thigh/elbow/knee. Specially formulated from high quality natural herbal extract", "brand": "Final",  "price": "$99",  "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["This is a complete package for traditional cut throat shaving. Set comes in a bubble wrap pouch, in order to keep items safe.", "", ""], "title": "SF221-Shaving Factory Straight Razor (Black), Shaving Factory Hand Made Shaving Brush, 100...", "brand": "Shaving Factory", "price": "$21.95", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51DMw0liS%2BL.jpg"]},
{"category": [], "tech1": "", "description": ["Jenna Jameson Heartbreaker Perfume for women 3.4 oz Eau De Parfum Spray Heartbreaker is young and sexy, with an attitude! The top note, is a fresh splash of sparkling raspberry Champaign garnished with lovely rose petals. After a taste of champagne, the middle note or the heart of the fragrance, takes us into the night of blooming jasmine and magnolia owers, to keep the mood casual but seductive. The base note, surprises us with the infusion of sophisticated sandalwood and tonka bean wrapped in an intoxicating morning of amber.", "", ""], "title": "Jenna Jameson Heartbreaker Perfume for women 3.4 oz Eau De Parfum Spray", "brand": "Jenna Jameson", "price": "$13.85","imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41jNxbdArhL.jpg"]},
{"category": [], "tech1": "", "description": ["This water-resistant 6-watt electric razor has it all. It's cordless, shaves a wet or dry face while dispensing shaving lotion with the push of a button, automatically adjusts to facial contours with three individually floating, self-sharpening stainless-steel shaving heads, provides 45 hair lifters and 45 rotating blades to shave below the skin, and comes with a full-width, snap-on trimmer for mustache and sideburns. It's perfect for the traveling man because the charging stand works worldwide on 110- to 240-volt systems, the razor recharges fully in 1 hour to provide 36 minutes of shaving time, and everything fits in a soft, washable travel bag. Shaving-lotion cartridges snap in easily, and pump buttons on both sides of the head dispense the lotion. (Ten Nivea lotion cartridges are included.) The head rinses clean after use. Norelco provides a 60-day, full-refund satisfaction guarantee after 2 weeks of use and a 2-year warranty against defects.  <I>--Fred Brack</I>"], "title": "Norelco 5655X Deluxe Advantage Wet/Dry Cordless Rechargeable Men's Shaver", "brand": "", "price": "$88.88", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/419DCK5YENL.jpg"]},
{"category": [], "tech1": "", "description": ["This high-tech shaver comes with an LCD indicator that shows the number of shaving minutes remaining on your battery. The Norelco Quadra features a quick charge for a 3-minute shave, or a full charge for longer shaves. Quadra Action System adjusts the floating razor heads to hug the contours of your face. Indicator lights up when it is time to clean and razor rinses clean with tap water. Cord and cordless operation. Worldwide voltage. Includes deluxe pouch, protective razor head cap, coil cord and cleaning brush. No. 6885XL. Imported.", "This 7-watt electric razor puts three individually floating shaving heads to work clearing away stubble. The stainless-steel heads adjust automatically in multiple directions to fit facial contours, while the blades shave in two stages, with slots for long hairs and holes for short hairs. Operating either with the cord or cordless, the razor provides a pop-up trimmer for mustaches and sideburns and rinses clean after use. It's perfect for the traveling man because it works worldwide on systems from 110 to 240 volts, recharges fully in one hour for 45 minutes of shaving time or charges in six minutes for a three-minute shave, and fits into a soft, molded plastic travel case. For those on the go, this shaver can be recharged from any 12-volt car or boat battery (special adapter cable is not included). An LCD light signals when recharging and/or cleaning is needed. There's also a plastic stand to store the razor upright. Norelco provides a 60-day, full-refund satisfaction guarantee after three weeks of use and a two-year warranty against defects. <I>--Fred Brack</I>"], "title": "Norelco 6885XL Deluxe Quadra Action Cord/Cordless Rechargeable Men's Shaver", "brand": "Norelco", "price": "$68", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41QP1PWX2PL.jpg"]},
{"category": [], "tech1": "", "description": [], "title": "Norelco 4821XL Micro Action Corded/Cordless Rechargeable Men's Shaver", "brand": "Norelco", "price": "$50","imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41B61W5AG5L.jpg"]},
{"category": [], "tech1": "", "description": ["As an alternative to dull scissors wielded by an uncertain hand, this  electric beard and mustache trimmer offers numerous advantages. Foremost among  them is a band around the handle that zooms out a trimmer guard with nine  settings so that hair can be cut uniformly from lengths as short as .06 of an  inch (MTV-fashionable stubble) to as long as .72 of an inch (grad student). A  gauge displays the selected setting so it can be replicated when trim time next  arrives. Stainless-steel blades with rounded teeth ensure there'll be no painful  shocks. For defining hairlines, cutting stray hairs, and other precision work, a  fine-toothed trimmer pops up with the push of a thumb. The trimmer can be used  with its coiled power cord or be charged for cordless deployment. It carries a  two-year warranty against defects. <I>--Fred Brack</I>"], "title": "Norelco T7500 Deluxe Cord/Cordless Rechargeable Beard &amp; Moustache Trimmer", "brand": "", "price": "$40.99", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/4119VHB508L.jpg"]},
{"category": [], "tech1": "", "description": ["Model No. 5841XL. Rechargeable cord/cordless razor. LED battery charge meter. Soft grip panels. Up to 45 minutes cordless shave time. Shaving System includes: Reflex Action Shaving System automatically adjusts in multiple directions to hug the unique contours of your face. Individually floating heads align the razor sharp blades closer to your skin for exceptional closeness. Patented Lift and Cut technology with 45 lifters and 45 rotating blades shave hair below skin level. Razor automatically adjusts to hug contours of your face. Charging, Battery Full and Low indicators. 1-Hour full charge. Worldwide Voltage adjusts automatically from 100V to 240V AC/DC. 6-Minute Quick Charge for a 3 minute cordless shave. Travel/storage pouch, protective razor head cap, coil cord and cleaning brush. Contains nickel-cadmium rechargeable batteries. Must be recycled or disposed of properly. Features: LED Battery Charge Meter displays charge level in batteries, and blinks when razor needs recharging. LED Battery Full Indicator will light up green when razor has been fully charged. Full Width Pop-Up Trimmer is perfect for grooming sideburns and moustache.", "This compact, cordless electric razor automatically adjusts to facial contours with three individually floating stainless-steel shaving heads, provides 45 hair lifters and 45 rotating blades to shave below the skin, and comes with a full-width, pop-up trimmer for mustache and sideburns. It's perfect for the traveling man, because it works worldwide on 110- to 240-volt systems, can be used with or without the coiled cord, recharges fully in 1 hour to provide 45 minutes of shaving time, provides a 6-minute quick charge for a 3-minute shave, and comes with a cleaning brush in a 6-1/2-inch-long travel bag. An LED meter on the razor displays the charge level and blinks when charging is needed. Norelco provides a 60-day, full-refund satisfaction guarantee after 2 weeks of use and a 2-year warranty against defects. <i>--Fred Brack</i>", "", ""], "title": "Norelco 5841XL Deluxe Reflex Action Cord/Cordless Rechargeable Men's Shaver", "brand": "Norelco", "price": "$99", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/31K40PHEHCL.jpg"]},
{"category": [], "tech1": "", "description": ["Replacement razor heads for Reflex Action razor models only. (Does not fit Reflex Plus.)", "These three stainless-steel heads fit Norelco Reflex Action razors only. Installing them is simple, and the package provides illustrated instructions. Combined, the three heads provide 45 hair lifters and 45 rotating blades to shave below the skin. They adjust to individual facial contours for a smooth, effortless shave. <I>--Fred Brack</I>"], "title": "Philips Norelco HQ5 Shaving Heads", "brand": "Philips Norelco", "price": "$64.50", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["This 7-watt electric razor puts three individually floating shaving heads to work clearing away stubble. The stainless-steel heads adjust automatically in multiple directions to fit facial contours, while the blades shave in two stages, with slots for long hairs and holes for short hairs. Operating either with the cord or cordless, the razor provides a full-width pop-up trimmer for mustaches and sideburns and rinses clean after use. It's perfect for the traveling man because it works worldwide on systems from 110 to 240 volts, recharges fully in one hour for 45 minutes of shaving time or charges in six minutes for a three-minute shave, and fits into a nylon travel pouch. For those on the go, this shaver can be recharged from any 12-volt car or boat battery (special adapter cable is not included). Norelco provides a 60-day, full-refund satisfaction guarantee after three weeks of use and a two-year warranty against defects. <i>--Fred Brack</i>", "", ""], "title": "Norelco 6826XL Quadra Action Cord/Cordless Rechargeable Men's Shaver", "brand": "Norelco","price": "$140", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/3169ASENKAL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41X49EW50HL.jpg"]},
{"category": [], "tech1": "", "description": ["HQ167. Replaces HQ156. Advantage and Cool Skin 5000/6000 Series. Fits Advantage and Cool Skin 5000/6000 Series razor models only 6756X, 6737X, 6735X, 6717X, 6711X, 6709X, 6706X, 6705X, 6710X, 5655X, 5616X, 5615X, 561X. Not all Advantage and Cool Skin model numbers may be listed. Does not fit any other Norelco models.", "These three stainless-steel heads fit into Norelco's Wet/Dry Advantage razors only. Installing them is simple, and the package provides illustrated instructions. Combined, the three heads provide 45 hair lifters and 45 rotating blades to shave below the skin, whether it's wet or dry. They adjust to an individual's facial contours for a smooth, effortless shave. <I>--Fred Brack</I>"], "title": "Philips Norelco HQ167 Cool Skin Replacement Heads for 6700 Series", "brand": "Philips Norelco", "price": "$20","imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Quadra Action Shaving System - Razor headsfeature a two-stage cutting system: slots to shave longer hairs and holes to shave short stubble for a closer Norelco shave Automatically adjusts in multiple directions to hug the unique contours of your face Individually Floating Heads align the Razor Sharp Blades closer to your skin Patented Lift and Cut Technology with 27 Lifters and 27 Rotating Blades Stainless Steel Self Sharpening Blades extend the life of the razor heads and allow for rinsing under tap water. Full-Width Pop-Out Trimmer defines beard moustache and sideburns.", "This 7-watt electric razor puts three individually floating shaving heads to work clearing away stubble. The stainless-steel heads adjust automatically in multiple directions to fit the face while the blades shave in two stages: with slots for long hairs and with holes for short hairs. Operating either with a cord or cordless, the razor provides a pop-up trimmer for mustaches and sideburns and rinses clean after use. It's perfect for the traveling man because it works worldwide on 110- to 240-volt systems, recharges fully in one hour or charges in six minutes for a three-minute shave, and comes with a soft, molded plastic travel case. For those on the go, this shaver can be recharged from any 12-volt car or boat battery (special adapter cable is not included). Norelco provides a 60-day, full-refund satisfaction guarantee after three weeks of use and a two-year warranty against defects. <I>--Fred Brack</I>"], "title": "Norelco 6865XL Quadra Action Cord/Cordless Rechargeable Men's Shaver", "brand": "Norelco", "price": "$99.99", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/31FT67RX5ZL.jpg"]},
{"category": [], "tech1": "", "description": ["This electric razor has a head that oscillates from side to side at high speed and pivots to adjust to the face's contours. In addition, the razor offers a three-stage cutting system and delivers a smooth shave either with or without a cord. The razor has a pop-up trimmer for mustache and sideburns and works worldwide on 110- to 240-volt systems. It recharges fully in one hour for 60 minutes of shaving time or charges in three minutes for a quick shave. The three-stage cutting system consists of a cutting block between two foils, with each unit performing individually as the razor runs across the face. For difficult shaving areas, such as under the nose, the pivoting head locks into position. The shaver carries a 30-day, full-refund guarantee and a two-year warranty against defects (foil and cutter block excluded). <I>--Fred Brack</I>"], "title": "Braun 6520 Flex Integral Ultra Speed Rechargeable Shaver", "brand": "", "price": "$101", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41Y1EMW5YKL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41ND75C8W1L.jpg"]},
{"category": [], "tech1": "", "description": ["With a pivoting head that oscillates from side to side and large foil holes to capture more hairs, this shaver delivers a smooth shave. When you're done, the shaver stores in a stand that cleans, lubricates, and charges it. The stand has an interactive LCD panel to provide data on charge status and maintenance needs. Operating with or without a cord, the razor has a pop-up trimmer and works worldwide on 110- to 240-volt systems. It recharges in one hour for 50 minutes of shaving time or charges in three minutes for a quick shave. Razor, cord, and cleaning brush fit into a leather traveling case. The Clean & Charge stand offers three options: clean, charge, or both. Cleaning fluid is drawn from a cartridge (included, along with one refill) that lasts for about 30 cleaning cycles and inserts easily into the stand. The shaver carries a two-year warranty against defects (foil and cutter block excluded)", "With a pivoting head that oscillates from side to side and large foil holes to capture more hairs, this shaver delivers a smooth shave. When you're done, the shaver stores in a stand that cleans, lubricates, and charges it. The stand has an interactive LCD panel to provide data on charge status and maintenance needs. Operating with or without a cord, the razor has a pop-up trimmer and works worldwide on 110- to 240-volt systems. It recharges in one hour for 50 minutes of shaving time or charges in three minutes for a quick shave. Razor, cord, and cleaning brush fit into a leather traveling case. The Clean & Charge stand offers three options: clean, charge, or both. Cleaning fluid is drawn from a cartridge (included, along with one refill) that lasts for about 30 cleaning cycles and inserts easily into the stand. The shaver carries a two-year warranty against defects (foil and cutter block excluded). <I>--Fred Brack</I>"], "title": "Braun 7570 Syncro Shaver System with Clean &amp; Charge Storage Stand and LCD Panel", "brand": "Braun", "price": "$103"},
{"category": [], "tech1": "", "description": ["This convenient hair removal system offers the permanence of salon electrolysis treatment without the redness and irritation that can follow. Clinically proven to be as effective as electrolysis, the system uses radio frequency to deaden hair at the root. Because hair grows in an 8-to-13-week cycle, you shouldn't see any regrowth for several weeks. And any regrowth should be finer than the original hair--not the dark stubble that follows shaving. It may take a few treatments to permanently remove hair, but eventually the roots will be destroyed and hair shouldn't reappear at all. For even smoother skin all over, you can adjust your treatment according to the body part being treated. For pesky individual hairs such as eyebrows, there's a tweezer; larger areas such as legs are best treated with the enclosed hair removal patch. Be sure to read the directions to avoid any potential skin irritation. <I>--Laura Cuthbert</I>"], "title": "Finally Free F-140 Ultra-Permanent Hair Removal System", "brand": "Finally free", "price": "$107", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41MMW8YVDRL.jpg"]},
{"category": [], "tech1": "", "description": ["The Braun 3600FC Interface series screen foil and cutter blade fits Braun Interface models 3105, 3610, 3612, 3615, 5447, 5629.", "Braun recommends that the heads on its InterFace electric razors (model numbers in the 3615, 3612, and 3610 series) be replaced every 18 months. This pack consists of the foil and cutterblock for those InterFace razors. The foil is thin platinum and the cutterblock is stainless steel. The foil is spring-mounted for a close, comfortable shave. Installation is easy, and diagrams on the package show how to do it. <I>--Fred Brack</I>"], "title": "Braun 3000 Series InterFace/Interface Excel Replacement Pack", "brand": "Braun", "price": "$27.19", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["This Braun shaver is German engineering at its best. Each shaving element is independently spring-mounted for responsiveness within a pivoting head that can be locked to reach difficult-to-shave areas. The pop-out trimmer grooms sideburns, mustache and beard. A single button removes foil for easy cleaning and replacement. Other features include a 3-stage shaving system, charge indicator, rechargeable cord and high-comfort switch. No. 5414. Imported.", "With a pivoting head that adjusts to the face's contours and a three-stage cutting system, this inexpensive electric razor delivers a smooth shave either with or without a cord. The razor has a pop-up trimmer for mustache and sideburns and works worldwide on 110- to 240-volt systems. It recharges fully in one hour for 35 minutes of shaving time or charges in five minutes for a quick shave. The three-stage cutting system consists of a cutting block between two foils, with each unit performing individually as the razor runs across the face. For shaving difficult areas, such as under the nose, the pivoting head locks into position. The razor, cord, and cleaning brush fit into a leather traveling case. The shaver carries a 30-day, full-refund guarantee and a two-year warranty against defects (foil and cutter block excluded). <I>--Fred Brack</I>"], "title": "Braun 5414 Flex Integral Rechargeable Shaver", "brand": "Braun", "price": "$304", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/418PS1FT4PL.jpg"]},
{"category": [], "tech1": "", "description": ["With Braun Clean & Renew refills, you can keep your shaver in like-new condition every day. Offered in multiple pack sizes, the Clean & Renew refills are used in Brauns patented Clean & Renew system base for when you are looking to clean, charge and lubricate your Braun shaver."], "title": "Braun Clean &amp; Renew Refill Cartridges CCR - 2 Count (Packaging May Vary)", "brand": "Braun", "price": "$11.94", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51Zaqu072XL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41iqbKtXmzL.jpg", "https://images-na.ssl-images-amazon.com/images/I/416VuHZNBCL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41ZIGmp9JaL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51SlGrqF5lL.jpg"]},
{"category": [], "tech1": "", "description": ["<P><STRONG>Helps Reduce Appearance Of Hair Growth.</STRONG></P> <P>Nair&reg; Lotion with Aloe &amp; Lanolin leaves legs totally touchable!</P> <UL> <LI> <DIV>4 Minute Lotion.</DIV></LI> <LI> <DIV>Dermatologist and Salon tested.</DIV></LI></UL></P>"], "title": "Nair Hair Remover 4 Minute Lotion with Aloe &amp; Lanolin", "brand": "nair", "price": "$601", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Extra wide cleaning surface. ADA Accepted - American Dental Association. The floss dentists use most. Dentotape ribbon floss gives you extra cleaning surface for effective plaque removal. Flossing has been clinically proven to clean away the plaque from between teeth that brushing and rinsing can't remove. Made in USA."], "title": "Reach Dentotape Waxed Dental Floss with Extra Wide Cleaning Surface for Large Spaces between Teeth, Unflavored, 100 Yards", "brand": "Reach", "price": "$5.17", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41EXSAekYdL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31W%2ByvNqqEL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41lSv8Hs6aL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41CEqMk8%2BEL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41FMSXjSglL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31UWbJbnZCL.jpg"]},
{"category": [], "tech1": "", "description": ["Scope Original Mint Rinse kills bad breath germs while leaving your breath feeling minty fresh.", "<div class=\"aplus\"> <div class='leftImage' style='width: 350px;'> <a href='https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B000052YD7_scope_201305211_4627_lg.jpg'> <img src='https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B000052YD7_scope_201305211_4627.jpg' alt='Classic Fresh Courage' width='285' height='221'/> </a> <div class='imageCaption'> <a href='https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B000052YD7_scope_201305211_4627_lg.jpg' target=''>view larger</a> </div> </div>", "Nothing hurts your confidence like bad breath. Luckily, <strong>Scope Mouthwash</strong> kills bad breath germs so youll never miss a moment of action. Scope is designed to get at the source of bad breath, not just cover it up. Now you can throw caution to the wind, hit the dance floor early and often, break the ice and then some. Scope Classic gives you the confidence to put yourself out there like you never thought you could.", "You are a classic extrovert. Ready to dance with the bride, belt out a few notes completely off-key and ask the most embarrassing question of your brothers date. All you need is the fresh breath Scope Classic provides and you are ready to go. Never let bad breath get in the way of making a good impression. Scope Classic is a tingly, refreshing fear-destroyer that freshens your breath and gives you the courage to get out there.", "You have your own unique personality, your way of doing things. Scope knows that and wants you to discover our mouthwash lineup below, so you can decide how to show your courage. Also look at our complete line of Scope products that freshen your breath and give you the confidence to get close.", "<b>Scope DualBlast Mouthwash</b>", "Scope DualBlast gives you the confidence to enjoy your favorite foods, even that triple onion cheesesteak, without the worry. Its unique technology blasts away up to 98% of bad breath germs<sup>*</sup> and strong food odors.<sup>**</sup>", "<small>* In lab tests.<br>** Clinical studies on garlic & onion at 30 minutes.</small>", "<b>Scope Outlast Mouthwash</b>", "Wondering why everybody isnt ready to go to the after, after, after party? Scope Outlast is perfect for you. Its exclusive technology keeps your breath feeling fresh up to five times longer<sup>*</sup> and helps you be more courageous.", "<small>* Versus brushing alone. </small>", "<b>What gives Scope Classic its bad breath killing power?</b><br>Scopes powerful mouthwash ingredients kill millions of bad breath germs and raise your confidence on contact. When you use Scope Classic, youll get more than fresh breath: Youll get a fresh chance at fearlessness.", "<b>What causes bad breath?</b><br>Short answer: Bad breath is caused by millions of odor-producing germs that gather in your mouth. The usual suspects that cause bad breath include dry mouth, morning breath, and strong food odors like onions and garlic. Scope mouthwashes keep your confidence high and bad breath at bay.", "<b>Why Scope Classic?</b><br>Only you know if you are ready to unleash your most confident self. With Scope Classic on your side, you can encourage that inner voice that says Why Not? to an extra bit of fun.", "Whether youre at home or on the go, you can treat your mouth to the complete line of Scope products. Try pairing up Scope Classic Mouthwash, Crest Complete Multi-Benefit Whitening + Scope Toothpaste, Oral-B Complete Scope Scented Toothbrush and Oral-B Glide Pro-Health plus Scope Outlast Flavor Floss Picks to get at the source of bad breath. Discover a lasting confidence that encourages courage whenever the moment strikes.", "Also try Scope Outlast Breath Mist and the convenient Scope Outlast Mini-Brush for a fresher feeling on the go."], "title": "Scope Original Mint Mouthwash 50.7 Fl Oz", "also_buy": ["B009LNU6ME", "B00L1I1VYY", "B00J5K0QEQ", "B0035U184O", "B00BSW7WD2", "B01DMJJIG2", "B072J8GTJ2", "B01EKJ941C", "B019DM86LA", "B019FGCOW6", "B01D1JM1F8", "B019FGCP2A", "B01H7DFM32", "B007CRIFSS", "B074KHNR82", "B01DD9UQJO"], "brand": "Unknown", "rank": [], "also_view": ["B009LNU6ME", "B007CRIFSS", "B074KHNR82", "B01FVAYP86", "B019IB6OD8", "B019FGCP2A", "B019FGCOW6", "B01DD9UQJO", "B06ZZCZS7C", "B019FGCP5C", "B015NA79GO"], "details": {"\n    Product Dimensions: \n    ": "5.1 x 3.7 x 10.2 inches ; 3.5 pounds", "Shipping Weight:": "3.5 pounds", "ASIN: ": "B000052YD8", "UPC:": "037000316176", "Item model number:": "31617"}, "main_cat": "All Beauty", "price": "", "asin": "B000052YD8", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Maximum-strength formula"], "title": "Dentemp Dental Cement Size Ea Dentemp Maximum Strength Dental Cement", "brand": "Dentemp", "price": "$5.79", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["<P><B>CARMOL 20:<BR></B><UL><LI>20% Carbamide Cream.</LI><LI>Enhanced Moisturizer For Rough Dry Skin.</LI><LI>Nonlipid vanishing cream for rough, dry skin, especially on hands, elbows, and heels.</LI><LI>Hypoallergenic, nonocclusive.</LI><LI>Contains no parabens, lanolin or mineral oil.</LI></UL></P>"], "title": "Carmol Enhanced Moisturizing Cream 3 oz (85 g)", "brand": "Carmol", "price": "$709",  "imageURLHighRes": []},
{"category": [], "tech1": "", "description": [], "title": "Oxy Balance Daily Cleansing Pads, Normal Skin - 55 ea", "brand": "", "price": "$690", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["<P>Noxzema Sensitive ... For a soothing Noxzema clean, Dermatologist tested and hypoallergenic. Noxzema Sensitive gives you a soothing Noxzema clean. Its fragrance-free, non-irritating formula gently cleanses away dirt, oil and make-up without overdrying. For sensitive skin that's healthy -- clean and soft.</P>"], "title": "Noxzema Cleansing Cream, Sensitive - 10.75 oz", "brand": "", "price": "$91.90", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Using this is like chumming the air for pretty ladies who are doctors that supermodel in their spare time. They wont be able to see the source of the square-jawed quarterbackliness hanging in the air until they start biting on you. And by then, its way too late for them.", "", ""], "title": "Old Spice High Endurance Anti-Perspirant &amp; Deodorant, Original 3 oz", "brand": "Old Spice", "price": "$5.21", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41soP1p6XKL.jpg", "https://images-na.ssl-images-amazon.com/images/I/413XegkuWGL.jpg", "https://images-na.ssl-images-amazon.com/images/I/315pEPXO8kL.jpg"]},
{"category": [], "tech1": "", "description": ["<P>Cool, Crisp and Clean.<BR>The unmistakably masculine scent of Old Spice.</P>"], "title": "Old Spice Splash on Cologne, Classic, 6.37 Fluid Ounce", "brand": "Old Spice", "price": "$83.99",  "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Aluminum Zirconium Trichlorohydrex GLY. Invisible sheer dry strength."], "title": "Secret Sheer Dry Solid Antiperspirant &amp; Deodorant, Spring Breeze - 2.6 oz", "brand": "Secret",  "price": "$5.40",  "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["Naturally comfort your skin with this St. Ives Soothing Aloe Chamomile Lotion. The combination of calming aloe and chamomile provides extra relief in a formula proven to help soothe dry skin. Apply daily to achieve the soft, smooth and healthy look and feel that your skin deserves."], "title": "St. Ives Advanced Therapy Lotion for Extra Dry Skin, Aloe Vera, 18 Ounces", "brand": "St. Ives", "price": "", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["FREE U.S. STANDARD S+H FOR ALL ADDITIONAL PURCHASES REGARDLESS OF SIZE, WEIGHT, OR QUANTITY.", "", ""], "title": "L'Oreal Studio Line Lasting Curls, Curl Enhancing , 6 oz (170 g)", "brand": "L'Oreal Paris", "price": "", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/2132PEBYA8L.jpg"]},
{"category": [], "tech1": "", "description": ["Gillettes strong, sustained growth in blades and razors reflects the market performance of its superior products. Introduced in 1993, the Sensor Excel twin blade cartridge incorporated a revolutionary skin guard composed of five soft, flexible microfins that delivered unprecedented shaving closeness and comfort. The self-adjusting blades conform to every curve on an individuals face and safely respond to every detail of ones skin.", "Gillette's SensorExcel Cartridges are long lasting and feature independent spring-mounted twin blades. These blades offer the closest, most comfortable twin blade shave. The Sensor Excel blades are also self-adjusting, which means they automatically adjust to every curve of your face, resulting in less skin irritation. And replacing cartridges is quick, easy, and safe.", "", ""], "title": "Gillette SensorExcel Cartridges (Pack of 15)", "brand": "Gillette",  "price": "$30.80", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/21BWV4GDKAL.jpg"]},
{"category": [], "tech1": "", "description": ["Intense Colour; Water-resistant; Smudgeproof. Tapered natural brush for precise lining. Ophthalmologist tested. L'Oreal redefines eyes with Lineur Intense Defining Liquid Liner; This innovative liquid system provides maximum definition and intense coloration that lasts all day long; Naturally tapered brush applicator allows precise lining as bold or as sleek as you choose; Water-resistant and smudgeproof. Ophthalmologist and allergy tested; Suitable for sensitive eyes and contact lens wearers; Fragrance free."], "title": "Lor Lnr Brsh Tip Blk Size .24z", "brand": "L'Oreal Paris", "price": "$11.56", "imageURLHighRes": []},
{"category": [], "tech1": "", "description": ["INDICATIONS: Aqua Velva Cooling After Shave Experience the cool, fresh feeling of Ice Blue, the classic American fragrance. INGREDIENTS: SD Alcohol 40, Water, Glycerin, Fragrance, Menthol, Benzophenone-1, FD&C Blue 1, Ext D&C Violet 2."], "title": "Aqua Velva After Shave, Classic Ice Blue, 7 Ounce", "brand": "Aqua Velva", "price": "$102", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51pwS4smf%2BL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51vUfJf4m%2BL.jpg"]}
