[{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian"], "description": [], "title": "Songs for the Shepherd", "brand": "Keith Green", "price": "80", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Pop & Contemporary"], "description": [], "title": "Lift Him Up With Ron Kenoly VHS", "brand": "", "price": "100", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Children's"], "description": [], "title": "I Love You", "brand": "Integrity Music", "price": "150", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Children's"], "description": ["1) To God Be The Glory2) This Is My Fathers Word3) O Worship The King4) Doxology5) For The Beauty Of The Earth6) Standing On The Promises7) Joyful Joyful We Adore Thee8) Bringing In The Sheaves9) Christ The Lord Is Risen Today10) Stand Up Stand Up For Jesus11) Amazing Grace12) Redeemed13) Praise Him Praise Him14) Tell Me The Story Of Jesus15) What A Friend We Have In Jesus16) He Keeps Me Singing17) To God Be The Glory Split Track18) This Is My Fathers Word Split Track19) O Worship The King Split Track20) Doxology Split Track21) For The Beauty Of The Earth Split Track22) Standing On The Promises Split Track23) Joyful Joyful We Adore Thee Split Track24) Bringing In The Sheaves Split Track25) Christ The Lord Is Risen Today Split Track26) Stand Up Stand Up For Jesus Split Traack27) Amazing Grace Split Track28) Redeemed Split Track29) Praise Him Praise Him Split Track30) Tell Me The Story Of Jesus Split Track31) What A Friend We Have In Jesus Split Track"], "title": "Hymns: 16 Classic Hymns for Children", "brand": "Sue Gay", "price": "90",  "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Children's"], "description": ["Joy To The World 2 The First Noel 3 Hark! The Herald Angels Sing 4 Silent Night, Holy Night 5 We Three Kings 6 Angels We Have Heard On High 7 O Little Town Of Bethlehem 8 I Heard The Bells On Christmas Day 9 O Come, All Ye Faithful 10 Good Christian Men, Rejoice 11 How Great Our Joy! 12 God Rest Ye Merry, Gentlemen 13 Away In A Manger 14 It Came Upon The Midnight Clear 15 O Come, Little Children"], "title": "Christmas Carols", "brand": "Cedarmont Kids", "price": "35", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Holiday & Wedding"], "description": ["This is a concept album all the way, with tales of Christmas kindness intertwined with masterful musicianship as they play traditionals plus their own An Angel Came Down; First Snow; Ornament; Old City Bar , and more!", "Is the Trans-Siberian Orchestra's Christmas Eve and Other Stories a holiday rock opera? Or perhaps just a holiday prog-rock disc? Or maybe it's New Age? Whatever the case may be, this isn't your typical Christmas album. Filled with electric guitar solos, plenty of synthesized keyboards, a children's choir, and lively drumming, Christmas Eve can only be compared to one other record, the Trans-Siberian Orchestra's other holiday disc,The Christmas Attic. On this CD, angelic vocal solos (on numbers such as \"The Prince of Peace\") are interspersed with driving instrumentals. Sentimental, occasionally bombastic, but as high-concept as holiday albums can be. --Jason Verlinde"], "title": "Christmas Eve and Other Stories", "brand": "Trans-Siberian Orchestra", "price": "5.98", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Pop & Contemporary"], "description": ["1. Jesus Lord Of The Way I Feel, 2. Jehoshaphat, 3. Step Across The Line, 4. I Could Never Promise You, 5. He's Alive, 6. Don't Want To Be Late, 7. Lullabye, 8. Adam, Where Are You?, 9. If You're Thirsty, 10. Whenever You're Speakin' To Me, 11. The Duke and the Duchess, 12. Steeple Song, 13. Got To Tell Somebody, 14. Who Do You Think You're Foolin?, 15. I'll Never Let Go Of Your Hand, 16. Balaam, 17. He Still Loves You, 18.Too Small A Price"], "title": "Forgiven", "brand": "Don Francisco", "price": "90", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Children's"], "description": [], "title": "Bless My Little Boy","brand": "Various",  "price": "15", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Children's"], "description": ["Book by"], "title": "Bless My Little Girl","brand": "Integrity Music", "price": "18", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Pop & Contemporary"], "description": ["Book by"], "title": "Acapella Hymns", "brand": "Glad", "price": "80", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Children's"], "description": ["1. I Am A C-H-R-I-S-T-I-A-N 2. Standin' In The Need Of Prayer3. He's Got The Whole World 4. Alive Alive5. Jesus Loves The Little... 6. Whisper A Prayer 7. Jacob's Ladder 8. Old Time Religion 9. Go Tell It On The Mountain 10. I've Got Peace Like A River 11. Michael Row The Boat Ashore 12. Oh How I Love Jesus 13. Down In My Heart 14. Twelve Disciples15. Do Lord"], "title": "Sunday School Songs", "brand": "Cedarmont Kids", "price": "40", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Special Interest"], "description": ["Joe Hill, ''the best horror writer of our generation'' (Michael Koryta) returns with a brand new short story performed by actor Nate Corddry, to be initially released as an exquisitely packaged vinyl recording. Featuring a version of The Rolling Stone s Wild Horses recorded by Matthew Ryan. A balmy summer night in 1994. Four teenagers out for an evening of fun on the boardwalk take a ride on the ''Wild Wheel'' (an antique carousel with a shadowy past) and learn too late that decisions made in an instant can have deadly consequences. What begins as a night of innocent end-of-summer revelry, young love, and (a few too many) beers among friends soon descends into chaos, as the ancient carousel's parade of beasts comes chillingly to life to deliver the ultimate judgment for their misdeeds. Featuring an original cover of The Rolling Stones' ''Wild Horses'' by Matthew Ryan. A ''vinyl first'' publication, ''Dark Carousel'' will be available exclusively on vinyl prior to any other format. Beautifully packaged with original artwork, the vinyl also includes a full-length digital download of the ''Dark Carousel'' audiobook."], "title": "Dark Carousel Edition", "brand": "Joe Hill (Author)", "price": "33", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Jazz"], "description": [], "title": "Unreleased Art: Volume 9", "brand": "Art Pepper", "price": "28", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Comedy & Spoken Word", "Spoken Word"], "description": ["The Complete BBC-4 Radio Series of Both \"Hitchhiker's Guide to the Galaxy\" and \"Douglas Adams's Guide to the Hitchhiker's Guide to the Galaxy\" on One Double CD Set. These Discs Are Recorded with Mp3 Files (Not Regular Audio Discs) So that the Extensive Running Time Can Fit. The Audio also Includes a Previously Unbroadcast Interview with Author Douglas Adams. Also Included is Douglas Adams' \"Guide to the Galaxy\", a Behind the Scenes Look. These Discs Will Play Only on Equipment Capable of Reading Mp3 Files."], "title": "The Complete Hitchhiker's Guide to the Galaxy: Radio Show","brand": "Complete Hitchhiker's Guide to the Galaxy", "price": "23", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["World Music", "Europe", "British Isles", "Britain"], "description": ["Crime sleuth Hercule Poirot returns in a thrilling BBC Radio 4 dramatization. Amy Leatheran has never felt the lure of the mysterious East, but when she travels to an ancient site deep in the Iraqi desert to nurse the wife of a celebrated archaeologist, events prove stranger than she could ever have imagined. Her patients bizarre visions and nervous terror seem unfounded, but as the oppressive tension in the air thickens, events come to a terrible climaxin murder"], "title": "Murder in Mesopotamia A BBC Radio 4 Full-Cast Dramatisation", "brand": "Agatha Christie", "price": "234", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Comedy & Spoken Word", "Spoken Word"], "description": ["Holmes Unravels a Tangled Web which Stretches Over 15 Years and Two Continents."], "title": "The Valley Of Fear","brand": "Arthur Conan Doyle",  "price": "178", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Soundtracks"], "description": ["CDBOX Limited Collectors Edition"], "title": "Little Britain: On Radio (Little Britain)","brand": "Little Britain", "price": "16",  "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["World Music", "Europe", "British Isles", "Britain"], "description": ["Hercule Poirot is a guest at a weekend house party, given at the Cornish cliff top home of the celebrated actor Sir Charles Cartwright. The other visitors include keen amateur detective Mr. Satterthwaite and distinguished Harley Street nerve specialist Sir Bartholomew Strange. Death visits the house soon after Poirot&#39;s arrival, the victim an elderly clergyman who&#39;s only had a sip of dry martini. What else was in the glass? Are natural causes to blame. . . or murder? In Monte Carlo a short time later, Poirot and his acquaintances hear of another, similar death. Is this a mere coincidence&mdash;and can Poirot resist further investigation? Everyone concerned will be much relieved if he does. Meanwhile, a third tragedy is waiting in the wings. . . George Cole, Michael Cochrane, and Clive Merrison are amongst the cast in this adaptation of Agatha Christie&#39;s intriguing mystery.", "2 CDs. 2 hrs 15 mins."], "title": "Three Act Tragedy", "brand": "Agatha Christie: Three Act Tragedy", "price": "59", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Comedy & Spoken Word", "Spoken Word"], "description": ["In the autumn of 1988, Michael Palin set out from the Reform Club with an ambitious plan: to circumnavigate the world, following the route taken by Jules Verne's fictional hero Phileas Fogg 115 years earlier. This fascinating and humorous account tells the story of his travels: from Venice on the back of a rubbish barge to the Pyramids on a camel. Read by the author. Now with added music."], "title": "Around the World in 80 Days","brand": "Michael Palin", "price": "44", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["World Music", "Europe", "British Isles", "Britain"], "description": ["The elegant, intelligent amateur sleuth Lord Peter Wimsey is one of detective literature&rsquo;s most popular creations. Ian Carmichael is the personification of Dorothy L. Sayers&rsquo; charming investigator in this BBC Radio 4 full-cast dramatisation. When Sandy Campbell&#39;s body is found at the foot of a cliff near the small town of Kircdubright, the local constabulary are convinced that the argumentative painter is the victim of a tragic accident. But when Lord Peter Wimsey turns up, the hunt begins for an ingenious killer. Faced with six men, all of whom have a motive for murder, the aristocratic amateur sleuth must deduce which are the five red herrings and which has blood on his hands. 3 CDs, _ minutes"], "title": "Radio Show", "brand": "Dorothy L. Sayers", "price": "73", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["World Music", "Europe", "British Isles", "Britain"], "description": ["An exclusive hotel on a tiny picturesque island seems to be the ideal retreat for Hercule Poirot from the stresses of criminal detection. But with the appearance of the beautiful Arlena Stuart, the quiet and peaceful atmosphere becomes charged with an indefinable erotic tension. And when she is found viciously strangled in a secluded cove, there are few, especially among the women, who seem to feel either surprise or regret.As Poirot follows a twisting path of bizarre and bewildering clues, his only certainties are that the solution lies within Arlena herself, and that there is evil under the sun.John Moffat is Hercule Poirot in this BBC Radio 4 full-cast dramatization with an all-star cast which includes Iain Glen, Fiona Fullerton, Robin Ellis, Wendy Craig, George Baker, and Joan Littlewood.", "\"Expert production by director Enyd Williams\" * Daily Mail *"], "title": "Evil Under the Sun BBC Radio Collection", "brand": "Agatha Christie:", "price": "25", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Comedy & Spoken Word", "Spoken Word"], "description": ["Three 30' Agatha Christie short story full-cast dramatisations: The Hound of Death/Witness for the Prosecution/The Gate of Baghdad. Agatha Christie is the acknowledged 'Queen of Detective Fiction'. Nearly all of her Hercule Poirot and all of her Miss Marple novels have been adapted for BBC Radio and released by the Radio Collection. These releases are the first non-Marple/Poirot novels to be adapted for radio, cassette and CD release."], "title": "Radio Show","brand": "Agatha Christie", "price": "15", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Comedy & Spoken Word", "Spoken Word"], "description": ["Three of Agatha Christie&#39;s most enjoyable stories, revamped for radio. In &quot;Philomel Cottage,&quot; everything looks rosy when Alex and Terry set up their own e-commerce company in Philomel Cottage, until money goes missing from Alex&#39;s account. Soon she is questioning her partner&mdash;and, indeed, the cottage itself. In &quot;Swan Song,&quot; Polina Nazarova is a soprano whose past is dangerously entangled with the present. Given the opportunity to sing her Tosca opposite the arrogant and cruel Andre Breon, it seems that her desire for revenge may prove irresistible. &quot;Magnolia Blossom&quot; sees Theo determined to seek happiness with her husband&#39;s business rival, Vincent. Having fled London for Paris, however, she soon learns of Richard&#39;s financial collapse&mdash;and discovers that rather more than just his job is at stake. Without the help of Poirot or Marple, the protagonists must be the masters of their own fate in these suspenseful mysteries with a twist in the tale.", "2 CDs. 1 hr 30 mins."], "title": "Radio Show", "brand": "Agatha Christie", "price": "26", "asin": "0563530685", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age", "Meditation"], "description": ["Meditation for Success by Michael Midkiff enables beginners to quickly reap benefits of meditation; such as body & mind rejuvenation, deep relaxation, better sleep & mental focus, mind programming, enhanced relationships and increased success in career, business & sports. \n\nThe goal is to get EVERYONE to meditate at least 10 minutes a day!\n\nThis CD has a 9 minute intro w/meditation instructions & three guided OM meditations w/engaging sound effects to relax you quickly & deeply while synchronizing your breathing. The OM sound in the mediations mimics long Tibetan horns that produce a deep and rich reverberation, captivating the listener.\n\nThe 1st OM meditation is 10 minutes w/spoken suggestions to relax & and charge you with positive energy. The 2nd is 10 minutes w/o spoken suggestions; the 3rd is 20 minutes w/o voice suggestions. With no spoken transition between tracks, they can link together into a longer meditation, if you choose. There are subtle fade-in/out cues when one meditation track ends and the other begin.\n\nMeditation is simple and doesnt require mysterious Eastern spiritual beliefs or secrets; or sitting in uncomfortable positions. Regular meditation can increase your spiritual awareness if you desire.\n\nMichael Midkiff learned meditation in 1969 as young student in India. Over the years he studied meditation and developed a simple and accessible technique for everyone.\n\nUse this CD in your private space, while riding the subway, waiting in a public area...wherever. Make yourself comfortable and chant aloud or silently feeling the vibration of OM.\n\nDo a 10 meditation before taking a test, giving a presentation, boarding an airplane, when seeking the solution to a problem, during a work break; or even before a round of golf or basketball.\n \nIf youre looking for a fun gift to improve a loved ones life, this is an excellent pick for about the price of a couple gallons of gasoline.\n\nGive yourself permission to RELAX and to SUCCEED!"], "title": "","brand": "Michael Midkiff", "price": "34", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51mkHVid-xL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51PeUBsVsYL.jpg"]},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age", "Meditation"], "description": [], "title": "Healing: A Vibrational Exchange","brand": "Wah!", "price": "28", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Children's"], "description": ["No artists specified on back inlay. Songs are God is greater, Let Everything that has breath, Let everything that has breath (short version), He knows my name, Give thanks to God, May the name of God be praised, Above all, No one like You, Our God is extreme, 'Tis so sweet to trust in Jesus, Let's celebrate, Come and see the manger, Magi saw the shining star"], "title": "Music Makers 1.1","brand": "Children's Music Series", "price": "37", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/513qqeT%2B9jL.jpg"]},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Special Interest", "Instructional"], "description": ["Simon Phillips has recorded and performed with an incredible array of bands and artists. A partial list includes The Who, Mick Jagger, Tears for Fears, Toto, Roxy Music, Jeff Beck, Pete Townsend, Robert Palmer, and Stanley Clarke. He has a dazzling command of the drumset and has certainly established himself as one of the leading drummers in modern music. For the first time on DVD, and remixed (by Simon himself!) in Dolby 5.1 surround, Simon Phillips: Complete includes Simon s groundbreaking videos Simon Phillips and Simon Phillips Returns on one disc. This DVD combines brilliant trio performances with concise and informative instructional segments. Simon demonstrates the drum patterns played in each song, first slowly and then up to speed, and covers topics such as double bass drums, bass and snare drum tuning, hand/foot independence exercises, practice techniques, timekeeping, odd-meters, and playing with a click. In addition, he performs two incredible free form drum solos which incorporate the fiery technique and ambidexterity that he has become known for. Also included is brand new footage of Simon in the studio, explaining the concepts behind 5.1 surround and his own mixing process."], "title": "Simon Phillips Complete", "brand": "Simon Phillips", "price": "23", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Children's Music", "Lullabies"], "description": ["12 Greatest Hits created for little ears, to soothe, calm and pacify, but very much with you in mind! Songs include: 1. Don't Worry Be Happy - Bobby McFerrin 2. Every Breath You Take - Sting 3. Sailing - Geppert C.R. Geppert 4. What A Wonderful World - Robert Thiele 5. Time In A Bottle - Jim Croce 6. Have I Told You Lately - Van Morrison 7. New York State of Mind - Billy Joel 8. Your Song - Elton John 9. Imagine - John Lennon 10. My Girl - William Robinson Jr. 11. Rhythm of My Heart - Rod Stewart 12. Scarborough Fair - Arthur Garfunkel, Paul Simon"], "title": "Rock'in Lullabies","brand": "Baby Basics", "price": "38", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51Zi1%2B1xToL.jpg"]},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Holiday & Wedding", "Christmas"], "description": ["The incomparable Judy Collins performs seasonal favorites, such as \"Let it Snow,\" \"White Christmas,\" \"Amazing Grace,\" and many more in this sensational concert filmed live at the magnificent Biltmore Mansion. Music, approx. 100 mins."], "title": "Christmas at the Biltmore VHS","brand": "Judy Collins", "price": "58", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Pop & Contemporary"], "description": ["Katie Souzas The Healing School was ranked a #1 seller on the Sid Roth Show. This seven  CD series is full of cutting edge, fresh revelations!\n\n DISC ONE - Katie teaches you about demonic kings that cause physical diseases, mental disorders and financial lack. Jesus said, no one can enter a strong mans house and carry off his possessions unless he first ties up the strong man. Then he can rob his house. Katie will show you the right order in which to fight the demonic kingdom. \n\n DISC TWO - You will learn how to become a carrier of the presence of the King of kings - Jesus Christ!  When you carry more of Him then every demonic king must bow the knee to King Jesus in you! \n\n DISC THREE - You will learn how the condition of your soul affects every part of your life including your health and finances. Katie will show you how demonic kings are attached to wounds in your soul and how the Glory Light of Jesus is a supernatural tool that can heal your soul in an accelerated manner. \n\n DISC FOUR- You will learn about Agag, the demonic king over witchcraft. This king can cause mental disorders such as bipolar disease. In this session, Katie proves biblically that Agag is attached to wounds in your soul formed by the sin of rebellion. You will also learn how the Glory Light of Jesus can heal mental and physical disorders! \n\n DISC FIVE - You will get a revelation about Balak, the demonic king over curses. In Numbers 22-24, King Balak attempted to curse Israel. This same demonic king is cursing Gods people today. Katie will show you how this king operates and how to remove him from every part of your life including your family, ministry, health, and even your finances!\n\n DISC SIX - You will learn about three demonic kings who cause financial ruin. In this session, \nKatie will release the king-killer-anointing against these tyrants then help you usher in supernatural increase into your home."], "title": "Healing School", "brand": "Katie Souza", "price": "38.58", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Special Interest", "Instructional"], "description": ["Nightclub dancing incorporates two very different styles. The first is fast, freestyle dancing that is done to rock or disco. At clubs, dances, and parties people move to the pulsing beat for hours. It's a great release and very good exercise. The other nightclub style is slow dancing. You move around the dance floor turning and swaying in each other's arms.Vicki Regan teaches dancing the way she learned, step by step, one move at a time. Everything is carefully explained and demonstrated for both men and women. You'll start with the basics, then work your way up to combinations and moves that are easy to learn, but are very impressive on the dance floor. You'll learn in your own home, at your own convenience, and at your own pace. If you didn't learn a step perfectly the first time simply rewind the tape. You can practice alone, with a partner, or invite a group of friends. It's good exercise and great fun. If you're a beginner, ten minutes into this tape you'll be saying, \"I can dance!\" Vicki Regan has danced on Broadway and in the movies, and was National and North American Ballroom and Latin Dance Champion. She has taught many people including other dance teachers and ballroom competitors. Ron De Vito, Vicki's teaching partner, is also an acclaimed Broadway dancer and a former National Ballroom Champion."], "title": "You Can Dance Nightclub - Rock/Disco &amp; Slow Dancing VHS","brand": "", "price": "54", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["World Music"], "description": ["This recording combines more than eight tracks with harmonies and drum \"fills\" to create the full sound of a traditional fife and drum corps and contains the whole book of 78 tunes which range from easy to challenging. Professionally recorded, balanced and mixed."], "title": "Mel Bay Complete Music for the Fife and Drum","brand": "Walter D. Sweet","price": "58", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Rock", "Rock Guitarists"], "description": ["In this class guitar method, traditional fundamentals of playing guitar are presented using an innovative approach. Students are shown chords and accompaniment techniques as well as how to read music and play solo guitar. The carefully graded repertoire in this book is stylistically diverse and includes music from many cultures. A section is devoted to teaching students how to improvise over blues chord progressions and write original blues lyrics. A special feature of this class method is the inclusion of music written for guitar ensemble (2-5 guitars). Musical examples are provided with blend of standard notation and tab. Musical examples do not employ standard notation and tab at the same time. An accompanying Teachers' Supplement is available. 2 CDs included."], "title": "Mastering the Guitar Class Method 9th Grade and Higher","brand": "William Bay", "price": "17", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Classic Rock", "British Invasion"], "description": ["\"Hullabaloo\" featured the most popular rock 'n' roll artists, the stars of Hollywood, Broadway, and television, and the famed \"Hullabaloo\" dancers. This DVD contains more than four hours of vintage performances--seven television episodes along with 18 bonus selections, including segments hosted by Beatles manager Brian Epstein from London. Full-length hit performances by The Animals, Sammy Davis Jr., Chuck Berry, The Byrds, The Four Seasons, Martha and the Vandellas, Marvin Gaye, Lesley Gore, Herman's Hermits, The Mamas and the Papas, Sonny and Cher, The Moody Blues, Paul Revere and the Raiders, Dusty Springfield, The Supremes, Dionne Warwick, The Yardbirds, and many more!", "The short-lived (1965-66) Shindig! knockoff Hullabaloo epitomizes the often-faltering steps U.S. network television made to keep up with the explosion of rock & roll culture in the wake of Beatle mania. Sometimes inspired, sometimes silly (definitely the latter with hosts and guests like Jerry Lewis, Michael Landon, Freddie and the Dreamers, and Vikki Carr), seven episodes plus bonus performances fill this DVD compilation of previous VHS releases. Over its four and a half hours, in black-and-white and color, true rockers ranging from Chuck Berry, the Lovin' Spoonful, Martha and the Vandellas, and the Animals slam into the slightly clueless (Chad & Jill) and the utterly hopeless (Joanie Sommers, Frankie Avalon, the aforementioned Freddie). Moments of irrepressible pop genius (Marvin Gaye's \"Ain't That Peculiar\") and sheer drama (Dionne Warwick's \"Message to Michael\") make this a must, though. Throw in a bit of apparent collusion between an NBC director and Byrd Roger McGuinn as he aims the \"Your sons and daughters are beyond your command\" verse of \"The Times They Are A-Changin'\" in extreme close-up to millions of American parents, and Hullabaloo's ultimate success is demonstrated. --Rickey Wright"], "title": "Hullabaloo, Vols. 1-4", "brand": "Patrick Adiarte", "price": "68", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["World Music", "Europe", "British Isles", "Ireland"], "description": [], "title": "Irish Traditional Sean-Nos Songs","brand": "Celia Ni Fhlatharta", "price": "19", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian", "Pop & Contemporary"], "description": ["Tracks: 1. Jesus y El Leproso 2. Jesus De Nazareth 3. Nadie Me Ama Como Tu 4. La Paz De Dios 5. Anoche Llegaste Tarde 6. Mi Roca y Mi Castillo 7. Soldado de Guerra 8. Hay Que Seguir Caminando"], "title": "Entre Mar y Cordillera (Spanish Edition)","brand": "Sr. Roberto Orellana", "price": "16", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Christian"], "description": [], "title": "Singing at the Fire: Voices of the Anabaptists Martyrs With 16-Page Booklet of Hymn Textsand Background Notes","brand": "Eastern Mennonite University Chamber Sin", "price": "92", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Broadway & Vocalists", "Musicals"], "description": ["The SUZUKI METHOD of Talent Education is based on Dr. Shinichi Suzuki's view that every child is born with ability, and that man is the son of his environment. According to Dr. Suzuki, a world-renowned violinist and teacher, the greatest joy an adult can know comes from developing a child's potential so he/she can express all that is harmonious and best in human behavior. Students are taught using the \"\"mother-tongue\"\" approach. This CD contains the repertoire from Suzuki Piano School Volumeumes 1 & 2. Because much of the Suzuki approach is based on listening and ear training, the recording is an essential component for the student's success. Recording artist William Aide, Professor Emeritus, Rupert E. Edwards Chair in Piano Performance at the University of Toronto, received his musical degrees from the University of Toronto and the Juilliard School of Music. He also holds a diploma and licentiate from the Royal Conservatory of Music, Toronto. (ARCT, LRCT) Professor Aide has recorded the twenty-four Chopin tudes, the Brahms cello sonatas with Ofra Harnoy, and the complete Suzuki piano method repertoire. He has concertized throughout Canada, the United States and the former Soviet Union."], "title": "Suzuki Piano School, Volume 1 &amp; Volume 2, Performed by William Aide","brand": "William Aide", "price": "6.20", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Broadway & Vocalists", "Musicals"], "description": ["From private collection, looks just like new, has a sticker on the front of case from previous owner (Lighter fluid should remove this easily)"], "title": "A Musical Blend of Voice and Instrument","brand": "JUBAL-ATION", "price": "39", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age"], "description": ["Your chakras, or spiritual centers, are your body's contacts with the Life Force. The suggestions in this presleep audio will help to keep them balanced with suggestions and visualizations. Enliven your life, health, and intuition with well-balanced chakras!"], "title": "Tuning Your Chakras", "brand": "A.R.E. Press", "price": "46", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age"], "description": ["Learn that you and your body are partners and that by honoring this connection you can move through your illness to a new and renewed self. This presleep program will help you heal, nurture and love your life in ways you never thought possible. If you or a friend faces cancer, this tape will help harness the power of visualization to emerge new, whole, and healed. CD Format According to Edgar Cayce and modern psychology, your subconscious mind is extraordinarily creative and will follow the directions you give it. With the A.R.E. Presleep Tape Series, your conscious mind will work in harmony with your subconscious. There are no hidden subliminal messages in these tapes, only a safe and effective method of working with the power of suggestion."], "title": "Overcoming Breast Cancer","brand": "A.R.E. Press", "price": "56", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age", "Meditation"], "description": ["There are many styles and methods of chanting. Each person should find the sound and technique that best awakens and uplifts his or her heart and mind-this CD can help. The chanting method used in this recording is inner sounding rather than outer singing. It is intended to create a higher state of consciousness and vibrations in the body and mind, freeing the spirit and soul. This CD focuses primarily on those chants given by Edgar Cayce during his attunement to what he called the Universal Consciousness, the mind of God. Cayce was one of America s great mystics and was often asked about meditation and chanting as tools to enlightenment and health. Several of the chants are performed using first a Western intonation, then an Eastern one, offering the listener the opportunity to experience both approaches to chanting. Includes a 15-minute introduction on chanting concepts and techniques."], "title": "Chants and Chanting","brand": "John Van Auken", "price": "17", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age"], "description": ["According to Edgar Cayce, a pioneer in exploring the powers of the mind, your subconscious mind is a creative resource that does what it is told to do. It is most open to instruction during &#34;presleep&#34; - that 20-minute time period just prior to sleeping. You can actually help yourself reach full potential by harnessing the power of the subconscious to achieve goals and develop positive feelings of self-worth. This CD can be played as you fall asleep. The images and suggestions will relax you, as well as enhance your development. You can use this CD to unlock your psychic awareness and develop your psychic sensitivity, contact the guide within, receive guidance through dreams and awaken your past-life impressions."], "title": "Realizing your Psychic Potential","brand": "A.R.E. Press", "price": "325", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age", "Meditation"], "description": ["Psychic medium, author, and speaker Robert Brown offers meditations for life; in this compilation of four guided meditations. Each session is designed to address a specific area. As Robert says, in these days of stress and imbalance, we owe it to ourselves to set aside even just ten minutes a day for meditation-to reflect on why we are experiencing what we are, and to see how we can have the lives we want and the health we deserve. You can choose a guided track based on what you'd like to focus on or listen to them all."], "title": "Meditations for Life:","brand": "Robert Brown", "price": "111", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age", "Meditation"], "description": ["Devotional chants from Cosmic Chants by Paramahansa Yogananda, author of the spiritual classic, Autobiography of a Yogi, sung by nuns of Self-Realization Fellowship."], "title": "I Will Be Thine Always: Devotional Chants from Paramahansa Yogananda's Cosmic Chants", "brand": "Nuns of the Self-Realization Order", "price": "146", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51pJCsDqZnL.jpg"]},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Comedy & Spoken Word", "Spoken Word"], "description": ["This engaging and profound talk by an acknowledged authority on yoga meditation offers insights into the deeper, universal purpose of marriage according to the principals taught by Paramahansa Yogananda. Topics include: How to develop greater understanding, affection, and love Understanding the psychological and physiological differences between men and women * The importance of intuition and communication * Four divine qualities that lead to a successful marriage Brother Andamoy is a direct disciple of Paramahansa Yogananda, (author of Autobiography of a Yogi), and is a monk of the Self-Realization order. For over sixty years his direct, profound, and often humorous lectures, have been received with praise from all corners of the world."], "title": "Spiritual Marriage", "brand": "Brother Anandamoy", "price": "15.26", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age"], "description": ["Book by Yogananda, Paramahansa"], "title": "The Divine Gypsy", "brand": "SRF Musicians", "price": "14.00", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age", "Meditation"], "description": ["One of a series of informal talks on the teachings of Paramahansa Yogananda, author of Autobiography of a Yogi, by Sri Daya Mata, president and spiritual head of Self-Realization Fellowship/Yogada Satsanga Society of India. Sri Daya Mata discusses the universal message of love and truth exemplified by the life of Christ. Topics include: * The inner purpose of Christmas * Parallels in the lives and teachings of Christ and Krishna * Bringing Christ into your life through meditation * Overcoming obstacles to communion with God * How to eliminate the causes of suffering * Spiritualizing family relationships * Living the spirit of Christmas in daily life."], "title": "Let Every Day Be Christmas: An Informal Talk by Sri Daya Mata", "brand": "Sri Daya Mata", "price": "46",  "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["New Age", "Meditation"], "description": ["Twelve of Paramahansa Yogananda's Cosmic Chants arranged and performed by a Self-Realization Fellowship nun. These uplifting instrumental arrangements are designed to help the listener enter an interiorized and devotional state of mind, and to relax and renew the body, mind, and spirit. Performed on Roland synthesizer with instrumentation including strings, flute, piano, harp, oboe, and bells, these beautiful renditions transport one s consciousness from the restlessness of daily life to a place of peace and well being. Playing Time: 58 Minutes"], "title": "Thou Art My Life", "brand": "Thou Art My Life", "price": "14.12", "imageURLHighRes": []},
{"occasion": [""], "category": ["CDs & Vinyl Records"], "sub_category": ["Pop", "Vocal Pop"], "description": ["Joined by several thousand voices in an outpouring of devotion, the Self-Realization Fellowship nuns kirtan group generates an atmosphere charged with the joy of Gods presence on these live recordings from the annual SRF Convocation. Several bhajans (devotional songs) from India are included, as well as many favorite selections from Paramahansa Yoganandas Cosmic Chants. The nuns play traditional Indian instrumentsharmonium, tablas, cymbals, khartal, tambura, bells, and surmandalon this 2-CD best of collection of devotional chanting."], "title": "Light the Lamp of Thy Love: Devotional Chanting Led by Nuns of Self-Realization Fellowship", "brand": "Nuns of Self-Realization Fellowship", "price": "19", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51CpHPu9mAL.jpg"]}]
