[
{
    "category": [
      "Electronics",
      "Camera &amp; Photo",
      "Video Surveillance",
      "Surveillance Systems",
      "Surveillance DVR Kits"
    ],
    "description": [
      "The following camera brands and models have been tested for compatibility with GV-Software.\nGeoVision \tACTi \tArecont Vision \tAXIS \tBosch \tCanon\nCNB \tD-Link \tEtroVision \tHikVision \tHUNT \tIQEye\nJVC \tLG \tMOBOTIX \tPanasonic \tPelco \tSamsung\nSanyo \tSony \tUDP \tVerint \tVIVOTEK \t \n \nCompatible Standard and Protocol\nGV-System also allows for integration with all other IP video devices compatible with ONVIF(V2.0), PSIA (V1.1) standards, or RTSP protocol.\nONVIF \tPSIA \tRTSP \t  \t  \t \nNote: Specifications are subject to change without notice. Every effort has been made to ensure that the information on this Web site is accurate. No liability is assumed for incidental or consequential damages arising from the use of the information or products contained herein."
    ],
    "title": "Genuine Geovision 1 Channel 3rd Party NVR IP Software with USB Dongle Onvif PSIA",
    "brand": "GeoVision",
    "price": 65,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/411uoWa89KL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "Camera &amp; Photo"
    ],
    "description": [
      "This second edition of the Handbook of Astronomical Image Processing (HAIP) and its integral AIP for Windows 2.0 image processing software (AIP4Win2.0) addresses many important changes that have taken place in astronomical imaging since the publication of the first edition.  Today's affordable astro-imaging capable digital single-lens-reflex cameras (DSLRs), the growing power of personal computers, and the proliferation of telescopes and imaging accessories has brought imaging capabilities within the reach of practically every amateur astronomer - and this second edition of the Handbook plus AIP4Win 2.0 is ready, willing, and able to assist every observer in making great astronomical images.  In the Handbook, we amplified the original chapters on astronomical equipment and imaging techniques, revised our discussions of astrometry and photometry to reflect the steady growth in these scientific fields, and expanded tutorials in the back of the book to help you get up to speed quickly.  On the accompanying CDROM (found on the inside back cover) you will find hundreds of megabytes of sample images you can use to learn techniques such as image registration and stacking that guarantee good results even from those living with suburban and urban skies.  Also new are comprehensive chapters on color imaging with astronomical CCD cameras and processing color images from digital cameras, and photon-counting fundamentals every serious astro-imager needs to"
    ],
    "title": "Handbook of Astronomical Image Processing with CD ROM, 2nd Edition, Hardcover Book by Berry &amp; Burnell",
    "brand": "33 Books Co.",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51BjDGZhNvL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "A zesty tale. (Publishers Weekly) Garcia Aguilera creates human characters we can empathize with. (Fort Lauderdale Sun-Sentinel) Tropical politics, culture and identity...are at the center of One Hot Summer. (Fort Lauderdale Sun-Sentinel)"
    ],
    "title": "One Hot Summer",
    "brand": "Visit Amazon's Carolina Garcia Aguilera Page",
    "price": 12,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers & Accessories",
      "eBook Readers"
    ],
    "description": [],
    "title": "Hurray for Hattie Rabbit: Story and pictures (An Early I can read book)",
    "brand": "Visit Amazon's Dick Gackenbach Page",
    "price": 10,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers & Accessories",
      "eBook Readers"
    ],
    "description": [
      "Lolita Files is the author of the bestselling Child of God. which has been optioned as a feature film by Kanye West. Files has a degree in broadcast journalism and lives outside of Los Angeles, where she is currently developing projects for television and film."
    ],
    "title": "sex.lies.murder.fame.: A Novel",
    "brand": "Visit Amazon's Lolita Files Page",
    "price": 14,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
    ],
    "fit": "",
    "title": "College Physics",
    "brand": "Visit Amazon's Alan Giambattista Page",
    "price": 10,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers & Accessories",
      "eBook Readers"
    ],
    "description": [
      "GIRL WITH A ONE-TRACK MIND: CONFESSIONS OF THE SEDUCTRESS NEXT DOOR"
    ],
    "title": "Girl with a One-track Mind: Confessions of the Seductress Next Door",
    "brand": "ABBY LEE",
    "price": 5,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "Portable Audio & Video",
      "MP3 & MP4 Players"
    ],
    "description": [
      "Support system: Windows XP/Vsita/7 * SNR: 85dB * Power Supply: 1 x AAA battery(not included) * Dimensions: (9.5 x 2.8 x 1.5) cm/ (3.74 x 1.10 x 0.59) inch (L x W x H) * Color: Red * Package includes: - 1 x 4GB MP3 Player With FM Function Red - 1 x Earphone"
    ],
    "title": "abcGoodefg&reg; 4GB USB 2.0 Mp3 Music Player with Fm Radio Function Voice",
    "brand": "Crazy Cart",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51QnwhmC19L.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "Headphones",
      "Earbud Headphones"
    ],
    "description": [
      "True High Definition Sound: With CVC 6.0 noise cancellation technology, Safari bluetooth headphone intelligently filters out background noise for sound transmission in busy and noisy environments. The latest Bluetooth 4.1 technology features faster & stable signal, clearer sound quality and lower power consumption.<br><br><b>Sweat Proof Protection:</b><br>IPX7 water resistant material prevents headphone damage when you are getting drenched in sweat after a grueling workout.<br><br><b>Long Battery Life:</b><br>Up to 6 hours of continuous music/talk time and up to 100 hours of standby with a single charge so you can spend more time listening to music and less time charging.<br><br><b>Stylish and Ergonomic Design:</b><br>With a choice between small, medium or large size ear tips, you are bound to have a secure fit that stays in place whether you are running or working out. Universally Compatible: Works with all bluetooth enabled devices."
    ],
    "title": "Wireless Bluetooth Headphones Earbuds with Microphone in Ear Headphones Noise Cancelling Earbuds with Mic Sweatproof Bluetooth Earphones Stereo Headset for Running Workout Gym Sports Secure Fit Case",
    "brand": "Enter The Arena",
    "price": 8,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/410sQ%2BqT9uL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "Computers &amp; Accessories",
      "Computer Accessories &amp; Peripherals"
    ],
    "description": [],
    "title": "Kelby Training DVD: Mastering Blend Modes in Adobe Photoshop CS5 By Corey Barker",
    "brand": "Kelby Training",
    "price": 15,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31JIPhp%2BGIL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "eBook Readers & Accessories",
      "eBook Readers"
    ],
    "description": [
      "Claire Messud's piercing second novel asks questions most are too fearful to face. Moving between the South of France, the East Coast of the U.S., and Algeria, <i>The Last Life</i> explores the weight of isolation and exile in one French family. Of course, the adjective <i>French</i> is already inadequate, as at least some of the LaBasses still long for the paradise lost of Algeria. And Alex LaBasse's wife, Carol, try as she might with her Continental impersonations, will always be an American sporting a metaphorical twin set. The narrator, Sagesse, too, soon finds herself equally stranded. Only her autocratic grandfather, Jacques, is ostensibly comfortable with the identity he has wrought: successful owner of the Bellevue Hotel and head of his dynasty. It is thanks to this man that 14-year-old Sagesse comes to crave invisibility. Having lost of all of her friends, she sees herself as \"a member of the Witness Protection Program, surrounded by an odd human assortment chosen only for the efficiency of disguise; but somehow, nevertheless, inescapable.\"",
      "The cause of this loss? Jacques, fed up with Sagesse and her pals' late-night noise at the hotel pool--or perhaps with their failure to take him seriously--shoots at one girl. This incident ruptures life for each LaBasse, the Bellevue no longer \"their bulwark against absurdity.\" Looking back on the crucial two years following the patriarch's \"target practice,\" Sagesse possesses both a teenager's slant self-interest and an older, acute eye for the mechanisms of shame. <i>The Last Life</i> is that rare thing, a fast-moving philosophical novel masquerading as a bildungsroman. In her efforts at identity and affection, its heroine is increasingly alive to the subterfuges of narrative, forcing herself to sort through versions of reality. Her grandmother, for instance, relates one myth about her husband, only to have Carol undercut it entirely. And Sagesse herself can't figure out whether Jacques is \"sentimental or heartless.\" What if both, she realizes, are possible?",
      "As Messud's narrator navigates her way through the past--and the Algerian sections are among the book's most extraordinary--there is everything to savor in her wavelike sentences, many of which possess a dangerously witty undertow. And the scenes of familial tedium are the opposite of tedious. The dialogue snaps with subverted emotion, anxiety, and irony. At one of the LaBasses' bleaker fests, much is made of the <i>mouna</i>, a special (if dry) Algerian cake. Nonetheless, the grandmother does her best to fob it off at evening's end. \"I've never cared for it myself, although it's a lovely memory.\" Retrospect, as Sagesse realizes, is \"a light in which we may not see more clearly, but at least have the illusion of doing so.\"",
      "E.M. Forster called another Mediterranean novel, <a href=\"/exec/obidos/search-handle-url?index=books&field-keywords=Lampedusa%20and%20Leopard\"><i>The Leopard</i></a>, \"one of the great lonely books,\" and it is into this category that <i>The Last Life</i> instantly falls. <i>--Kerry Fried</i>",
      "Loss of innocenceAfor a young girl, her family and her nationAis the theme of Messud's resonant second novel. Plangent with the memories of a pivotal two-year period in the life of teenage narrator Sagesse LaBasse, the novel flashes back to three generations of the LaBasse family, pieds noirs who fled Algeria during the 1960s. Domineering patriarch Jacques, Sagesse's grandfather, establishes the Hotel Bellevue on France's Mediterranean coast and proclaims the family myth of invincibility. But the LaBasses suffer from the same vain and empty valuesAoverweening pride and social snobberyAthat led to the French debacle in Algeria. To Sagesse's piously Catholic parents, Alex and Carol, their severely handicapped son, Etienne, is the embodiment of the doctrine of Original Sin, and Carol cares for him at home because LaBasse women must sacrifice themselves for the good of the family. Etienne is also a blow to his parents' marriage, already foundering because of Alex's womanizing and their different cultural backgrounds: Carol is American, and has never been accepted by her stern in-laws. After intolerant, irascible grandp?re shoots at rowdy teenagers on the hotel property, he is sentenced to prison, the LaBasses become social outcasts and Sagesse's friends abandon her. Alex briefly comes into his own and runs the hotel, but Jacques's release accelerates Alex's and the family's destruction. Messud (When the World Was Steady) sustains an elegiac tone in describing a seemingly ordered world that in reality is precarious; the LaBasses erect futile defenses against tragedies they are unable to prevent. In striking scenes, Messud recreates the last days of French rule in Algeria and the anomie of the ex-colonials, exiles from the land they love and strangers in their mother country. Sometimes these frequent flashbacks are awkward and not well integrated into the narrative. Yet some scenesASagesse acting out her adolescent insecurity during a summer with her relatives in New England, for exampleAare small gems. Questions of morality and mortality, of choice or fate or historical destiny, permeate the chronicle, adding coherence to a moving and insightful story. Agent, Georges Borchardt. Author tour. (Sept.) <BR>Copyright 1999 Reed Business Information, Inc."
    ],
    "title": "The Last Life: A Novel",
    "brand": "Visit Amazon's Claire Messud Page",
    "price": 14,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers & Accessories",
      "eBook Readers"
    ],
    "description": [
      "In this gleeful, difficult debut, Altschul lays into an easy target&mdash;cynical celebrity culture&mdash;and meticulously crafts an over-the-top pop mirror world for his young heroine. Leaning heavily on the star mythology of Kurt Cobain, Courtney Love and their daughter, Frances Bean, Altschul introduces Calliope Bird Morath, the most famous poet in America, beloved to deconstructionists and culture theorists and fifteen-year-old girls alike. Calliope's childhood, revealed in retrospect, is haunted by a public fascination with her parents, mercurial rock 'n' roll heroes Brandt Morath and Penny Power, a fascination continuing long after Brandt's suicide when Calliope is a small child. Pushed by the demanding Penny to claim her father's destiny, Calliope skips college to attend a prestigious M.F.A. program, and soon publishes a collection of poems that centers on Brandt's death and sounds a lot like bad Sylvia Plath. The media swarms, and Calliope scandalizes&mdash;and perhaps really does find a path back to her father after all. Over the course of nearly 600 pages, Altschul registers some razor-sharp cultural observations and executes some thrilling high dives (the character named Andrew Altschul's sessions with a Lacanian analyst in particular). But the book's tricky PoMo narrative is bloated with gee-whiz grad-schoolisms, and storytelling takes a backseat to indulgence throughout. <I>(Apr.)</I> <BR>Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved."
    ],
    "title": "Lady Lazarus",
    "brand": "Visit Amazon's Andrew Foster Altschul Page",
    "price": 6,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "Accessories &amp; Supplies"
    ],
    "description": [
      "This book is a must-have for every coach and player!"
    ],
    "title": "Practical Modern Basketball (3rd Edition)",
    "brand": "John R. Wooden",
    "price": 20,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "Computers &amp; Accessories",
      "Computer Accessories &amp; Peripherals",
      "Memory Cards",
      "Micro SD Cards"
    ],
    "description": [
      "Brand SAMSUNG Speed 80 MB/s Read Speed, 20 Write Speed Card Class Class 10 Memory Card Type MicroSDXC Card Type MicroSDHC Model ID MB-MC64DA/IN Memory size 64 GB POWER &amp; OPERATING REQUIREMENTS Power Requirement 2.7 - 3.6 V Storage Humidity 93 % Operating Temperature -25  C - 85  C"
    ],
    "title": "SAMSUNG Evo Plus 64 GB MicroSDXC Class 10 80 MB/s Memory Card",
    "brand": "Samsung",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/412YwzO-5CL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [],
    "title": "BOOX Max Carta Ereader,13.3\" Flexible Screen 16 GB with Built-in Wi-Fi,Bluetooth",
    "brand": "BOOX",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/5127U2fTMDL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "Camera &amp; Photo",
      "Accessories",
      "Blank Video Media",
      "Hi-8"
    ],
    "description": [
      "TDK Hi8 MP120 Premium Performance Camcorder Videotapes (6-pack)."
    ],
    "title": "TDK Hi8 MP120 Premium Performance Camcorder Videotape (6-pack)",
    "brand": "TDK Electronics Corp",
    "price": 50,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41n5rOI-c4L.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "Accessories &amp; Supplies"
    ],
    "description": [
      "While Frodo &amp; Sam continue to approach Mount Doom to destroy the One Ring, unaware of the path Gollum is leading them, the former Fellowship aid Rohan &amp; Gondor in a great battle in the Pelennor Fields, Minas Tirith and the Black Gates as Sauron wages his last war against Middle-Earth."
    ],
    "title": "The Lord of the Rings: Return of the King - Extended Edition",
    "brand": "WB",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/311uH05B1iL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories"
    ],
    "description": [
      "Featuring a linen-look fabric construction, exterior pockets with decorative zipper pulls, this classic book and Bible cover will fit the Zondervan NIV Study Bible, Aspire: the Study Bible for Women of Color, the Women of Faith Study Bible as well as many other books and Bible up to 6 5/8\" x 9 1/2\" (241mm x 168mm)."
    ],
    "title": "Linen-Look Pattern Black LG",
    "brand": "Visit Amazon's Zondervan Page",
    "price": 10,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "YA?Life in Thomasville, NC, in the 1950s is not easy for 10-year-old Whitey Black. He is new to town, with no father, a perpetually weary mother, and a four-year-old sister, Sandy, who has polio. Sandy's greatest pleasure is for Whitey to read to her The Littlest Angel and, more than anything else, she wants an \"Angel\" doll for Christmas, just like the one in the story. Whitey, his hard-won friend (the narrator of the story), and other members of the small community work together to give the child her wish. It is the story of their efforts and the results that are the basis of this Christmas tale. Told matter-of-factly, the story is evocative of a time and a place, and has great appeal to readers of all ages.?Pamela B. Rearden, Centreville Regional Library, Fairfax County, VA<br />Copyright 1998 Reed Business Information, Inc."
    ],
    "title": "The Angel Doll: A Christmas Story",
    "brand": "Visit Amazon's Jerry Bledsoe Page",
    "price": 4,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers & Accessories",
      "eBook Readers"
    ],
    "description": [
      "Edgar-finalist Hime's overly complicated sequel to his well-received <I>The Night of the Dance</I> (2003) pits ex-Texas Ranger Jeremiah Spur and black Deputy Sheriff Clyde Thomas against competing drug cartels in racially charged Brenham, Tex. In separate plots that fill more than 70 mini-chapters, Thomas investigates a drug-related double murder while Spur searches for Edwin \"Dusty\" Nelson, an accountant who may have absconded with $10 million from Benjamin Farkas, a Hungarian refugee and local real estate tycoon haunted by flashbacks of the Soviet invasion of his homeland nearly 50 years earlier. Vengeance, greed and fear drive characters through myriad scene changes from rural Texas to Mexico City to Vienna, and \"scared money\" becomes a metaphor for those on the lam, pursued for the wealth that cocaine and heroin peddling can bring in the dreary ethnic neighborhoods of the Southwest. After numerous police meetings, the pieces finally begin to fit together as Spur and Thomas join forces to work on what prove to be overlapping cases. This searing tale ends on a hopeful note, but not before lots of blood has been spilled on two continents. <BR>Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.",
      "Former Texas Ranger and current CIA operative Jeremiah Spur thought he was going to a high-school football game. Instead, he returns home with an assignment he doesn't want but can't refuse. His job is to track an embezzler. The victimized firm is a Texas high-rise developer owned by a former CIA assassin. Spur smells a large rat. In a parallel investigation, Spur's buddy, deputy sheriff Clyde Thomas, is up to his eyeballs in a drug war in his little burg. The cases eventually intersect through an improbable series of events. Toss in Thomas' disintegrating romance and Spur's encounter with the father he thought long dead, and one has a very dense novel--a little too dense. The plethora of plotlines generates too many characters and too many coincidences. That said, this is still an enjoyable crime novel. Spur and Thomas are memorable characters, the dialogue is believable, and Hime has a penchant for laugh-out-loud humor. This series will be welcomed back, but next time let's hope Hime's plotting is more focused. <i>Wes Lukowsky</i><br><i>Copyright &#169; American Library Association. All rights reserved</i>"
    ],
    "title": "Scared Money",
    "brand": "James Hime",
    "price": 13,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "In Santogrossi's engrossing, dark debut (winner of the St. Martin's Press/Malice Domestic contest for Best First Traditional Mystery Novel), the curiously endearing protagonist, Tim Ryder, wakes up one morning to find a dead body on his Palm Springs, Calif., lawn. Ryder, a carpenter, wonders if the murder is connected to testimony he gave against a co-conspirator in a criminal case 30 years earlier, when he did time for a bungled robbery, a misguided attempt to raise money for antiVietnam War protests. With the next current-day casualty, the matter becomes more urgent, and even more personal, and Tim is determined to find the killer. On occasion, Santogrossi veers off into preachy description, breaking the cardinal show-don't-tell rule, but his well-drawn characters, unexpected resolution and sharp casual insights make for an energizing read. <i>(May)</i> <br />Copyright  Reed Business Information, a division of Reed Elsevier Inc. All rights reserved."
    ],
    "title": "A Stranger Lies There",
    "brand": "Visit Amazon's Stephen Santogrossi Page",
    "price": 4,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
    ],
    "title": "Never Tell",
    "brand": "Visit Amazon's Selena Montgomery Page",
    "price": 10,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Contains sections on Civil Procedure, Constitutional Law, Contracts, Criminal Law, Personal Property, Real Property, Torts, Chart Supplement, Review Questions and Answers. Several hundred pages numbered by section."
    ],
    "title": "BARBRI First Year Review 2008 Edition (F 08 S 09)",
    "brand": "BAR/BRI",
    "price": 3,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "Computers &amp; Accessories",
      "Computer Accessories &amp; Peripherals"
    ],
    "description": [
      "DVD"
    ],
    "title": "Kelby Training DVD: Adobe Photoshop CS5 Crash Course By Matt Kloskowski",
    "brand": "Kelby Training",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31uogm6YcrL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "Camera &amp; Photo",
      "Video Surveillance",
      "Surveillance Cameras",
      "Dome Cameras"
    ],
    "description": [
      "The following camera brands and models have been tested for compatibility with GV-Software.\nGeoVision \tACTi \tArecont Vision \tAXIS \tBosch \tCanon\nCNB \tD-Link \tEtroVision \tHikVision \tHUNT \tIQEye\nJVC \tLG \tMOBOTIX \tPanasonic \tPelco \tSamsung\nSanyo \tSony \tUDP \tVerint \tVIVOTEK \t \n \nCompatible Standard and Protocol\nGV-System also allows for integration with all other IP video devices compatible with ONVIF(V2.0), PSIA (V1.1) standards, or RTSP protocol.\nONVIF \tPSIA \tRTSP \t  \t  \t \nNote: Specifications are subject to change without notice. Every effort has been made to ensure that the information on this Web site is accurate. No liability is assumed for incidental or consequential damages arising from the use of the information or products contained herein."
    ],
    "title": "Genuine Geovision 32 Channel 3rd Party NVR IP Software USB Dongle Onvif PSIA",
    "brand": "GeoVision",
    "price": "$2,080.00",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/411uoWa89KL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Disguised as yet another chick-lit novel about disastrous dating, this book moves beyond genre constraints to offer a provocative and intelligent look at the ways that people search for a meaningful life. Cleverly titled chapters such as \"Weight Listed\" and \"A Clue in Time Saves Nine\" describe actress Karrie Kline's dating adventures, but there's a continuity in her narration that makes this novel more than the sum of its parts. Several themes recur throughout, including Karrie's admiration for her mother and stepfather's marriage and her relationship to Judaism, and though romance may come hard to Karrie, her love for New York City is constant, even when she briefly expatriates to Los Angeles. While Karrie's dates are truly hilarious-like the man who wears the same outfit every day, and the man who barks like a dog to show affection-there's also a sense of poignancy as Kerrie truly attempts to give each man his due. Her dates wind through the decades, tracing history as they do, and what's left when the laughter dies down is a normal woman looking for a normal type of happiness, but one who passes by her lucky break like a ship in the night. Those expecting a light and fluffy confection will likely be pleasantly surprised by this more substantive fare. <br />Copyright  Reed Business Information, a division of Reed Elsevier Inc. All rights reserved."
    ],
    "title": "You Have to Kiss a Lot of Frogs",
    "brand": "Visit Amazon's Laurie Graff Page",
    "price": 9,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Sometimes in a moment of limbo or confusion, it's advisable to make a list. An inventory of accomplishments, a chart of pros and cons. Lucinda Rosenfeld's first novel takes as its form a list of past boyfriends. Each section finishes the sentence begun in its title, <i>What She Saw...</i> in \"Roger Mancuso, or 'The Stink Bomb King of Fifth Grade.'\" Later, in college, it's \"Humphrey Fung, or 'The Anarchist Feminist.'\" The book's shape and humor come from the gathering logic of this catalog, how our heroine is repeatedly fooled by the illusions of lust, always looking for something new, someone who can eclipse the failed romances of the past."
    ],
    "title": "What She Saw...: A Novel",
    "brand": "Visit Amazon's Lucinda Rosenfeld Page",
    "price": 9,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Set in San Francisco in the 1980s, <i>A Collection of Beauties at the Height of Their Popularity</i> is a novel of late youth--the final indulgences and excesses of a group of friends before paths are chosen, before character is set. Whitney Otto (<i><a href=\"/exec/obidos/ASIN/0345370805/${0}\">How to Make an American Quilt</a></i>) takes as her inspiration the floating world depicted in Japanese prints of the Edo period. Her characters, most of them denizens of the Youki Singe Tea Room in North Beach, live in the moment. They are unambitious, minimally employed, well-educated, and self-indulgent. Dreamers of various kinds, the women (who have artful names like Jelly, Coco, Gracie, and Theo) are passionate about their friendships, their parties, and their appearance. The narrative is as fluid as the characters, sometimes delivering a perfectly formed short story about a minor figure, and other times tracing back to explain a pivotal high school incident. Readers who give themselves over to this flowing story line, and to the shifting array of characters, will find this a rewarding and oddly moving novel. <i>A Collection of Beauties</i> perfectly evokes a particular mood of watchfulness, as its characters wait for their world to form around them. <i>--Regina Marler</i>",
      "The bestselling author of How to Make an American Quilt experiments again with a patchwork narrative, building an elaborate, piquant story of the loves and lives of a group of young 1980s San Franciscans around a series of 18th-century woodblock prints that depict the women of Edo, Japan. Each of the 12 chapters begins with the reproduction and explication of a print; all the prints date from a long period of peace in Japan, stretching roughly from 1615 to 1868. Out of this peace came a flowering of the arts of pleasure, and it is the pursuit of pleasure that Otto documents in 20th-century San Francisco as well. Against the backdrop of a North Beach fringe bar, the Youki Singe Tea Room, dozens of Otto's expertly tailored characters drink, adjust and readjust their senses of loneliness, acceptance and desire in a series of short vignettes. Among them are Roy, \"a purveyor of `artificial paradises,' who is neither sinister nor extraordinary in any way\"; Jelly, who travels with a coterie of beautiful women and adoring men; Pirouz, Iranian born and raised in France, who falls in love with San Francisco and marries Jelly to secure a green card; and Raphaella, singer with a golden voice, who usurps Pirouz's attentions. Many more characters come and go in Otto's merry-go-round of parties, connections, break-ups, art and glittering San Francisco skyscapes. Stylish almost to a fault, the novel makes a fetish of beauty and unusual art objects, but it is the intricate web of human connections that gives it deeper appeal. 10-city author tour. (Mar. 12) Forecast: The eclectic format of Otto's latest will be familiar to fans of How to Make an American Quilt, though the young, hip, multicultural protagonists will appeal more to those who enjoyed The Passion Dream Book, her most recent novel.",
      "Copyright 2001 Cahners Business Information, Inc."
    ],
    "title": "A Collection of Beauties at the Height of Their Popularity: A Novel",
    "brand": "Visit Amazon's Whitney Otto Page",
    "price": 7,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Yet another complex whodunit starring Donald Lamb, the pint-sized detective with the big brain and his outsized, money-loving business partner Bertha Cool. Beginning with an innocuous inquiry into a hocked pendent, the pace picks up fairly fast with an unexpected murder, the mysterious appearance of dazzling precious gems, and of all the unusual characters, a pet crow with a penchant for glittering objects. In almost Bond style, the scene shifts to Colombia with its twisting mountain roads, steamy jungles, gold and gem mines, and an inscrutable and menacing police chief. Unraveling tortuous plots is Donalds specialty, and this one is no different. An exciting read, and for those used to Earle Stanley Gardeners Perry Mason with his perspicacity and trained legal mind, Gardner in his A.A. Fair avatar, sketches his protagonist Donald Lamb very differently. Also trained as a lawyer and no less sharp-witted than Mason, yet a total contrast."
    ],
    "title": "Crows Can't Count",
    "brand": "Erle Stanley Gardner",
    "price": 15,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "This pop romp through the Tokyo of martial arts, yakuza and legendary geishas has more sly smarts than a Hong Kong gangster shoot-'em-up. First-time novelist Adamson hooks the reader with fast action, clever dialogue and all-over atmosphere, while complicating the plot mightily and implausibly. Billy Chaka is a popular columnist for the Cleveland mag Youth in Asia. He's come to Tokyo to cover the 19 and Under Handicapped International Martial Arts Championship. While Chaka is waiting in a bar for the arrival of his old friend filmmaker Sato Migusho, an apparently drunken woman enters and rushes for the ladies' room. Immediately recognizing her as a geisha in disguise, on the lam from disgruntled clients, ChakaDwho has a weakness for geishasDhelps her escape and handles the tough guys with some dandy kickboxing moves. After Chaka learns that Sato has died in a seemingly accidental fire at his secret luxury hideout, the Garden of Earthly Delights, he ducks his reporterly duties and sets out to find the geisha. While on this quest, underwritten by a yakuza leader named Kwaidan and an unnamed religious cult, Chaka keeps stumbling over imponderables in the Sato case, including the news that Sato was about to film an unauthorized version of Chaka's own life, entitled Tokyo Suckerpunch. Copyright 2000 Reed Business Information, Inc."
    ],
    "title": "Tokyo Suckerpunch : A Billy Chaka Adventure",
    "brand": "Visit Amazon's Isaac Adamson Page",
    "price": 9,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "1979 Doubleday and Co. Volume 1. The Collected Fiction of Isaac Asimov. Hardcover with dust jacket. Book Club Edition."
    ],
    "title": "The Far Ends of Time and Earth (The Collected Fiction of Isaac Asimov ; V. 1)",
    "brand": "Visit Amazon's Isaac Asimov Page",
    "price": 20,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Good, sharp, vivid writing.... When he hits the emotional high notes, Francis never wavers. In fact, if you value your dignity, I implore you not to read the final sixty pages in a public place: You will cry, hard, probably more than once."
    ],
    "title": "Natural Order",
    "brand": "Brian Francis",
    "price": 33,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "LONGLISTED - 2013 International IMPAC Dublin Literary Award Incidents in the Life of Markus Paul"
    ],
    "title": "Incidents in the Life of Markus Paul",
    "brand": "Visit Amazon's David Adams Richards Page",
    "price": 5,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers & Accessories",
      "eBook Readers"
    ],
    "description": [],
    "title": "Viriconium nights",
    "brand": "Visit Amazon's M. John Harrison Page",
    "price": 15,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "The protagonist of this debut novel is Tamara Britton, a reserved, devoted child welfare worker. The 30-something's quiet, tidy life is turned upside-down when her boss asks her to temporarily take in a foul-mouthed teen runaway named Sienna. During this stint as a foster mom, Tamara has to supervise homework, discuss teenage sexuality and wade into the murky world of pop culture. She is also motivated to put together some of the pieces of her own interrupted childhood and travels to prisons and hospitals in search of birth parents she never knew. Edwards richly develops the novel's characters, especially those who play supporting parts. Tamara's outrageous friend and colleague, Lynette, is a hoot, and Lynette and Tamara's sharply dressed but racist boss is well drawn. Still, the novel is far from perfect. The two plotsTamara and Sienna's relationship, and Tamara's own childhoodtie together at the end, but the connections require coincidences that strain credulity. The stock features of CBA fiction are all predictably there: Tamara, who has never dated, is suddenly wooed by two fine men. And she not only finds love but also her faithat a church altar call. This contribution to the flourishing field of African-American Christian fiction is promising, though it also suffers from first-timer flaws. <i>(Apr. 20)</i> <br />Copyright  Reed Business Information, a division of Reed Elsevier Inc. All rights reserved."
    ],
    "title": "Plenty Good Room",
    "brand": "Visit Amazon's Cheri Paris Edwards Page",
    "price": 20,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Dean delivers another pop artifact in her latest riff on the <i>Gossip Girl</i> generation, this time dressing up the goings-on with a very <i>Devil Wears Prada</i> vibe. Landing a job as second assistant to Iris Whitaker, a Metronome Studios hotshot, sounds like a dream come true for Ohio native Taylor Henning, who naturally wants to make it big in Hollywood. But this fish out of water needs to learn quickly how to swim with the sharks, as Iris's first assistant, Kylie Arthur, would prefer she drowns. Thankfully, a fairy godmother appears in the fierce form of Quinn, Iris's 16-year-old daughter, who suggests Taylor follow her surefire high school rules: fake it till you make it; speak up in class; make one cool friend; and realize lunch is a battleground. But there are unforeseen consequences for Taylor, who remembers some age-old advice just in time. It's a slick little novel: catty, glitzy and just mean enough. <i>(July)</i> <br />Copyright  Reed Business Information, a division of Reed Elsevier Inc. All rights reserved."
    ],
    "title": "Hollywood Is like High School with Money",
    "brand": "Visit Amazon's Zoey Dean Page",
    "price": 18,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
    ],
    "title": "In the Blood (The Darkwing Chronicles, Book 4)",
    "brand": "Visit Amazon's Savannah Russe Page",
    "price": "$0.96",
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "Accessories &amp; Supplies",
      "Audio &amp; Video Accessories",
      "Remote Controls &amp; Accessories",
      "Remote Controls"
    ],
    "description": [
      "The CLIKR-5 UR5U-8780L remote control is designed to operate the CISCO/SA, Pioneer, Pace Micro, Samsung and Motorola digital set tops.  Plus the majority of TV, VCR, DVD and AUX equipment on the market as follows: Cable Set-top Boxes, VCRs and TV/VCRs, Televisions, DVD Players, Audio Equipment, Media PC, etc.\n\n\nContact Information\nfor MSO's\nLet's discuss your needs in detail.\n \nTime Warner Cable CLIKR-5 \n\nInteractive Tutorial - English and Spanish \n\nProgramming Instructions and Codes - English \n\nThe Time Warner Cable CLIKR-5 is designed to offer complete control for all digital, HD and DVR set-top boxes. The UR5U-8780L is factory programmed to operate Scientific Atlanta/Cisco and Samsung set-top boxes while the UR5U-8790L is factory programmed for Motorola set-top boxes. In addition to the set-top box the CLIKR-5 can also control TV's, VCR's, DVD players and Auxiliary equipment such as audio receivers and home theater systems. The Time Warner Cable CLIKR-5 features a fully backlit keypad and upgradeability. \n\nFeatures and Benefits: \n\n\t-Tru2way / OCAP compliant\n\t-Control up to 5 devices\n\t-64-K chip pre-loaded with the  largest code library in the industry\n\tThree factory-programmed macro keys (Dedicated ON DEMAND button, M1, M2)\n\tCustomizable System Power button\n\tIlluminated mode buttons\n\tFull keypad backlighting featuring exclusive 'night vision' red illumination\n\t'Sure Touch' cursor navigation pad\n\tThe industry's simplest &amp; quickest device code programming\n\tQuick programming instructions on back case\n\tMemory Lock retains programmed memory for 10 years even with Batteries removed\n\tInteractive, bi-lingual CD Tutorials for CSR, Tech &amp; Installer training &amp; reference\n\tBarcode label in battery compartment with easily identifiable manufacturer date code\n\nSpecifications \n\n  Size: 2.875\"(W) x 8.5\"(L) x 1.125\"(D) \n  Weight: 4.1 oz \n  Power Supply: 2 x AA Batteries"
    ],
    "title": "CLIKR-5 Time Warner Cable Remote Control UR5U-8780L",
    "brand": "URC",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41cC8477ShL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "GPS, Finders & Accessories",
      "GPS System Accessories"
    ],
    "description": [
      "Award-winning navigation and features of Rand McNally's RV GPS devices, plus an Android operating system"
    ],
    "title": "Rand McNally RV Tablet 80",
    "brand": "Rand McNally",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41hmgJ1GGZL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "GPS, Finders &amp; Accessories",
      "GPS System Accessories",
      "Antennas"
    ],
    "description": [
      "The Road Explorer  60 pairs award-winning navigation and advanced, commercial-grade features from the leader in truck and RV GPS, all easily visible on a large 6 screen. Included toll costs and advanced lane guidance."
    ],
    "title": "Rand McNally Road Explorer 60 GPS",
    "brand": "Rand McNally",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41FWetMBbML.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "GPS, Finders & Accessories",
      "Vehicle GPS",
      "Trucking GPS"
    ],
    "description": [
      "**** Shipped by 2-3 DAY UNITED STATES PRIORITY MAIL *** SAME OR NEXT DAY SHIPPING !! SAME OR NEXT DAY SHIPPING !! This 700 Intelliroute GPS has been Checked, Tested and deemed to be in Excellent working order when shipped. ACCESSORIES INCLUDED WITH Rand McNally 700 TND Itelliroute GPS INCLUDES: WINDOW MOUNT,CAR/TRUCK CHARGER, and USB Cable. Item may show some normal wear on case/screen; However, this does not affect the functionality of the GPS Unit. \" SATISFACTION GUARANTEED \" \" SATISFACTION GUARANTEED \" Upon Receipt of your GPS please check it immediately and make sure it is in proper working condition. The Insurance from the shipper is only good for seven (7) days, and it is important to make sure your GPS arrives just as it leaves us. If you encounter a problem with this GPS I have others that I will Replace it with. Comes with Amazon standard Return/Refund policy, Buyer pays return shipping on Returns or Refunds. SAME OR NEXT DAY SHIPPING !! SAME OR NEXT DAY SHIPPING !! **** Shipped by 2-3 DAY UNITED STATES PRIORITY MAIL ***",
      "Like its award-winning predecessor, the IntelliRoute TND 500, the Rand McNally IntelliRoute TND 700 GPS device gives truckers much more than just maps and navigation. It offers detailed information about truck stops, rest areas, weigh stations and other points of interest for truckers, as well as tools to help drivers estimate the profitability of a route. And with its seven-inch screen and high-definition display, the IntelliRoute TND 700 redefines readability and usability. Other exclusive features include an oversized stylus, larger buttons, a louder speaker, and tools like a calendar and notepad to help professional drivers complete their routes with greater ease and efficiency.",
      "<table cellpadding=\"10\" cellspacing=\"0\" border=\"0\" width=\"280\" align=\"right\"> <tr> <td> <table cellpadding=\"0\" cellspacing=\"0\" border=\"0\" width=\"280\" align=\"center\"> <tr> <td><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-call1.jpg\" border=\"0\" alt=\"callout box top\"></td> </tr> <tr> <td background=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-call2.jpg\"> <table cellpadding=\"5\" cellspacing=\"1\" border=\"0\" width=\"260\" align=\"left\"> <tr> <td colspan=\"2\"> <br><center><b>IntelliRoute TND 700<br>At a glance:</b></center> <ul> <li>35-percent more truck-routing information than other GPS devices</li> <li>Seven-inch, high-definition screen</li> <li>Large buttons and powerful speaker optimized for truck cab</li> <li>Spoken turn-by-turn directions</li> <li>Quick planner tool helps determine most profitable routes</li> </ul> </td> </tr> </table> </td> </tr> <tr> <td><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-call3.jpg\" border=\"0\" alt=\"callout box bottom\"></td> </tr> </table> </td> </tr> <tr> <td> <table cellpadding=\"0\" cellspacing=\"0\" border=\"0\" width=\"280\" align=\"center\"> <tr> <td><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-call1b.jpg\" border=\"0\" alt=\"callout box top\"></td> </tr> <tr> <td background=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-call2.jpg\"> <table cellpadding=\"5\" cellspacing=\"0\" border=\"0\" width=\"275\" align=\"left\"> <tr align=\"center\"> <td> <a href=\"http://www.amazon.com/dp/B0042FZ6YY\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-B002DPTQ8W-acc.jpg\" border=\"0\"><br> 3-in-1 Charger</a><br>Charge your GPS device via in-car adapter, A/C outlet, or mini-USB port.</a> </td> </tr> </table> </td> </tr> <tr> <td><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-call3.jpg\" border=\"0\" alt=\"callout box bottom\"></td> </tr> </table> </td> </tr> </table> <table cellpadding=\"10\" cellspacing=\"0\" border=\"0\" width=\"280\" align=\"left\"> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-2-l.jpg\" onClick=\"window.open(this.href,null,'width=620,height=572'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-2-s.jpg\" border=\"0\" alt=\"IntelliRoute TND 700\"></a> <center><br><font size=\"1\"><em><b>Seven-inch, high-definition screen optimized for truck cab. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-2-l.jpg\" onClick=\"window.open(this.href,null,'width=620,height=572'); return false;\">View larger</a>.</b></em></font></center> </td> </tr> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-5-l.jpg\" onClick=\"window.open(this.href,null,'width=620,height=506'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-5-s.jpg\" border=\"0\" alt=\"IntelliRoute TND 700\"></a> <center><br><font size=\"1\"><em><b>Features large buttons, powerful speaker, and a stylus. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-5-l.jpg\" onClick=\"window.open(this.href,null,'width=620,height=506'); return false;\">View larger</a>.</b></em></font></center> </td> </tr> </table> <b>Large, Seven-Inch Display and Powerful Speaker</b><br> The IntelliRoute TND 700 sets itself apart from other GPS devices with its large, seven-inch, high-definition screen, over-sized buttons, and stylus--all of which are designed specifically for a truck cab. And unlike GPS devices designed for passenger cars, this truck navigation unit has a speaker that is twice as powerful as typical car speakers, amplifying the sound above cab noise so spoken directions come through loud and clear.",
      "<b>35-Percent More Truck-Route Information</b><br> Even before your truck has started, you can determine the best route to take by entering your truck's length, width, weight, height, and HazMat information. The IntelliRoute TND 700 has 35-percent more truck routing information than other GPS units. Enter as many as 10 stops and use the device's preferences tools to pass up tolls and construction without missing weigh stations, rest areas, or repair services. Connect the included USB cable to a Windows-compatible computer with internet connection for free updates including road construction.",
      "The IntelliRoute TND 700 provides turn-by-turn directions with spoken street names. The patented Smart-Time feature calculates the local time as well as the time at your destination--handy when traveling across multiple time zones.",
      "Included in the IntelliRoute TND 700 is searchable truck-stop information from The Trucker's Friend National Truck Stop Directory. You can find the nearest truck stop or search more than 70 amenities like showers, restaurants, Wi-Fi, and more!",
      "<b>Customized Trucker Business Tools</b><br> Loaded with all of the innovative tools featured in the IntelliRoute TND 500, the IntelliRoute TND 700 introduces more tools vital for truckers. A new calendar feature helps you keep track of important appointments and dates. Also, you can keep all of your reminders and notes together in the same place with the handy notepad feature.",
      "Drivers can reduce time-consuming manual calculations with the IntelliRoute TND 700. Drivers can track miles driven in every U.S. state or Canadian province for organized bookkeeping and fuel-tax reporting. User-set timers and logs keep track of driving time and time on duty.",
      "The IntelliRoute TND 700 was designed to partner with America's #1 trucker's atlas. Drivers can cross-reference to the page and grid of the Rand McNally Motor Carriers' Road Atlas.",
      "The Quick Planner tool helps determine the profitability of routes. A commercial-grade address book organizes thousands of entries, and allows you to group them the way that works best for you.",
      "With so many helpful tools, off-duty truckers may find themselves switching the IntelliRoute TND 700 to car mode and bringing it along for family trips.",
      "The IntelliRoute TND 700 is backed by a one-year parts-and-labor warranty.",
      "<b>What's in the Box</b><br> IntelliRoute TND 700, windshield mount, truck charger with extended length cable, 120/240V home charger, quick start guide, and USB cable.",
      "<br clear=\"all\"> <table cellpadding=\"6\" cellspacing=\"1\" border=\"0\" width=\"700\" align=\"center\" bgcolor=\"#1A1A1A\"> <tr bgcolor=\"#FFFFFF\"> <td align=\"center\"> <img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-logo.jpg\" border=\"0\" alt=\"Rand McNally Logo\"><br> </td> <td align=\"center\"> <a href=\"http://www.amazon.com/dp/B002OB49TQ\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-thumb1.jpg\" border=\"0\" alt=\"IntelliRoute TD500\"></a> </td> <td align=\"center\"> <a href=\"http://www.amazon.com/dp/0528881469\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-IntelliRoute-thumb2.jpg\" border=\"0\" alt=\"IntelliRoute TD700\"></a> </td> </tr> <tr align=\"center\"> <td bgcolor=\"#ACACAC\"><b>Features</b></td> <td bgcolor=\"#F58220\"><b>IntelliRoute TND 500</b> <br><font size=\"1\">Truck navigation you can trust</font> </td> <td bgcolor=\"#80b33d\"><b>IntelliRoute TND 700</b> <br><font size=\"1\">Redefining truck navigation</font> </td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Screen size</td> <td align=\"center\">5\"</td> <td align=\"center\">7\"</td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Truck-specific routing</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Searchable truck stop services</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Standard map detail</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Multi-stop route optimization</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Car mode</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Access to updates and upgrades via TND Dock*</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Commercial-grade address book</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Timers & Logs</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Truck stop ratings</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Junction view 3-D</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Full U.S. & Canada Maps</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Qwerty keyboard</td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-orange.png\" alt=\"Check Mark\" border=\"0\"></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Enhanced map detail**</td> <td></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>High-definition screen</td> <td></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Oversized stylus</td> <td></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#FFFFFF\"> <td>Calendar</td> <td></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#EBEBEB\"> <td>Notepad</td> <td></td> <td align=\"center\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page2/c26-checkmark-green.png\" alt=\"Check Mark\" border=\"0\"></td> </tr> <tr bgcolor=\"#ACACAC\"> <td colspan=\"3\"><font size=\"1\">* Updates and upgrades via TND Dock require a Windows PC and internet connection.<br> ** Map detail enabled by larger, high-definition screen</font> </td> </tr> </table> <br clear=\"all\">"
    ],
    "title": "Rand McNally 528881469 7-inch Intelliroute TND 700 Truck GPS",
    "brand": "Rand McNally",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41zy99-KivL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "eBook Readers &amp; Accessories",
      "eBook Readers"
    ],
    "description": [
      "Unusual book"
    ],
    "title": "Elephant Run",
    "brand": "Visit Amazon's Roland Smith Page",
    "price": 9,
    "imageURLHighRes": []
  },
{
    "category": [
      "Electronics",
      "Computers &amp; Accessories",
      "Computer Accessories &amp; Peripherals",
      "Input Devices",
      "Numeric Keypads"
    ],
    "description": [
      "Microsoft MultiMedia Keyboard 1.0A KB-0168"
    ],
    "title": "Microsoft MultiMedia Keyboard 1.0A KB-0168",
    "brand": "Microsoft",
    "price": 80,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/61MkNN2cHEL.jpg"
    ]
  },
{
    "category": [
      "Electronics",
      "Computers &amp; Accessories",
      "Computer Accessories &amp; Peripherals",
      "Input Devices",
      "Numeric Keypads"
    ],
    "description": [
      "Loud N Clear Personal Sound Amplifier allows you to turn up the volume on what people around you are saying, listen at the level you want without disturbing others, hear a pin drop from across the room."
    ],
    "title": "Loud N Clear&trade; Personal Sound Amplifier",
    "brand": "idea village",
    "price": 11,
    "imageURLHighRes": []
  },
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "Fast and Convenient ChargingWhen using all functions of the USB C dongle, the 100W USB C PD charging port can fully charge your device which compatible with MacBook Pro 2016/2017/2018/2019, MacBook Air 2018/2019/2020, Surface GO, Google PixelBook and more.(Note: The USB-C port only supports charging and does not support data transmission)."
  ],
  "title": "UGREEN USB C Hub 5 in 1 Networking Hub with Gigabit Ethernet Port 4K HDMI USB C PD Charging and 2 USB 3.0 Ports Compatible with MacBook Pro, iPad Pro, XPS and More",
  "brand": "UGREEN",
  "price": 50,
  "imageURLHighRes": []
  },
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [],
  "title": "GDBT Gaming Extended Mouse Pad with Stitched Edges,Large Mousemat with Non-Slip Rubber Base,3mm Thick Waterproof Laptop Computer Keyboard pad for Gamer,rgb Desk Pad for Premium-Textured,800x400,Dazzle",
  "brand": "GDBT",
  "price": 18,
  "imageURLHighRes": []
  },
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "Ultra-quiet mouse with 90% reduced click sound and same click feel eliminates noise and distractions for you and others around you."
  ],
  "title": "Logitech M330 Silent Plus Wireless Mouse  Enjoy Same Click Feel with 90% Less Click Noise, 2 Year Battery Life, Ergonomic Right-hand Shape for Computers and Laptops, USB Unifying Receiver, Black",
  "brand": "Logitech",
  "price": 25,
  "imageURLHighRes": []
  },
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "Made with high quality 0.33mm thick premium tempered glass with rounded edges, Compatible with the Apple Pencil."
  ],
  "title": "JETech Screen Protector for iPad Air 4 10.9-Inch, iPad Pro 11-Inch, Face ID Compatible, Tempered Glass Film",
  "brand": "JETech",
  "price": 12,
  "imageURLHighRes": []
  },
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "4K 60Hz Supported: UGREEN HDMI male to male cable supports the latest HDMI standard, 4K video at 60 Hz UHD, 3D, 2160P, 1080P and backward compatible with earlier versions. It also provides you mirror and extend mode for connecting a larger diaplay."
  ],
  "title": "UGREEN HDMI Cable 4K Braided High Speed HDMI Cord 18Gbps with Ethernet Support 4K 60HZ Compatible for UHD TV, Monitor, Computer, Xbox 360, PS5 PS4, Blu-ray and More (3FT)",
  "brand": "UGREEN",
  "price": 10,
  "imageURLHighRes": []
  },
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "The thinnest, lightest Kindle Paperwhite yetwith a flush-front design and 300 ppi glare-free display that reads like real paper even in bright sunlight."
  ],
  "title": "Kindle Paperwhite  Now Waterproof with 2x the Storage - 8 GB (International Version)",
  "brand": "Kindle",
  "price": 150,
  "imageURLHighRes": []
  },
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "The thinnest, lightest Kindle Paperwhite yetwith a flush-front design and 300 ppi glare-free display that reads like real paper even in bright sunlight."
  ],
  "title": "Kindle Paperwhite  Now Waterproof with 2x the Storage - 8 GB (International Version)",
  "brand": "Kindle",
  "price": 150,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "The keyboard and mouse adopt advanced Bluetooth chip technology to provide stable and powerful cordless connection, its easy to connect and easy to use. The working range up to 10m. This keyboard features volume control, previous, next, and other media hot keys. The mouse supports Bluetooth and 2.4GHz USB connection (not included Adapter), the keyboard only supports Bluetooth connection."
  ],
  "title": "7 inch /10 Inch Wireless Bluetooth Keyboard Mouse Set",
  "brand": "Bbtops",
  "price": 50,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
  ],
  "description": [
    "Designed to keep you productive and entertained from anywhere, the HP 14-inch laptop combines long lasting battery life with a sleek and portable, micro-edge bezel design. The HP Fast Charge technology allows this laptop go from 0 to 50% charge in approximately 45 minutes"
  ],
  "title": "HP HD Micro-Edge Slim Laptop Platinum",
  "brand": "HP",
  "price": 499,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
  ],
  "description": [
    "Auto-focus feature in real time.Easy to use by USB plug it into your computers,flexible clip on PC or replacement in adjustable tripod for optimal viewing, quick recognition and auto setup,about 4.7 feet USB cord is long enough for normal using."
  ],
  "title": "Streaming WebCam with noise reducing Microphone",
  "brand": "2NLF",
  "price": 70,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "1080P HD Aluminium Web Cam for Desktop, Mac, Laptop, Computer, PC, Plug and Play, Web Computer USB 120 Wide Camera for Gaming, Video Conferencing, Zoom Skype Online Teaching"
  ],
  "title": "Webcam with Microphone",
  "brand": "JOYACCESS",
  "price": 50,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "Perfect For Home Offices: Connect to your computer with a USB-C cablewithout needing to install drivers. It is compatible with all popular online conferencing platforms and Social application. Whether you are in a meeting, online class or playing games, watching movies, listening to music, this is a good choice for you."
  ],
  "title": "Computer Speaker with Microphone, JOYACCESS USB Powered PC Speakers for Smart Home Office and Online Study",
  "brand": "JOYACCESS",
  "price": 31,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "3 in 1 Headphone Stand with Mouse Bungee and 2 Port USB 3.0 Hub - The Ultimate Gaming Accessory - Dynamic RGB Headphone Holder with USB Charger - White"
  ],
  "title": "Tilted Nation RGB Gaming Headset Stand",
  "brand": "Tilted Nation",
  "price": 72,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals"
  ],
  "description": [
    "5Wx2, Deep Bass in Small Body, Stereo 2.0 USB Powered 3.5mm Aux Multimedia Speakers, Built-in Bottom Bass Radiators, PC Laptop Desktop Speakers, White."
  ],
  "title": "Sanyun SW102 Computer Speakers",
  "brand": "Sanyun",
  "price": 40,
  "imageURLHighRes": []
},
{
  "category": [
    "Electronics",
    "Computers &amp; Accessories",
    "Computer Accessories &amp; Peripherals",
    "Input Devices",
    "Numeric Keypads"
  ],
  "description": [
    "Textured Micro-Weave Cloth Surface:large extended gaming mouse pad made by high quality pure natural rubber and smooth water-resistant microfiber woven material.Optimized across all mouse sensors for pixel-precise accuracy and total tracking responsiveness,fine stitched edge makes the edge very flat,edges wont roll up when placed,the weaves high thread count lets your mouse glide across the mat with ease for quick,fluid swipes."
  ],
  "title": "GDBT Extended Gaming Mouse pad",
  "brand": "GDBT",
  "price": 20,
  "imageURLHighRes": []
}
]
