[
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Hip &amp; Joint Care"
    ],
    "description": [
      "Dr. Rexy hemp oil has powerful anti-inflammatory properties, which have shown to help relieve joint pain and achieve more mobility, agility and energy. Full spectrum hemp oil provides a natural calming effect which may help relieve stress, separation anxiety, travel issues, constant barking, natural aggressive behavior and fear of storms and anxiety related conditions. Made strictly with organic derived ingredients to provide the highest quality in health for your pets."
    ],
    "title": "DR.REXY Hemp Oil for Dogs and Cats - 100% Organic Food Supplement - Full Spectrum Hemp Extract - Pain Relief for Dogs &amp; Cats, Calming, Stress &amp; Anxiety Support, Wellness, Hip &amp; Joint Health - 250mg",
    "brand": "DR.REXY",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51jtzNf9UZL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs"
    ],
    "description": [
      "Know exactly what your dog is eating with 101 Dog Treats. We provide you with the recipes and the cookie cutters and the rest is up to you."
    ],
    "title": "Pet Qwerks Treat Cookbook with Cutters",
    "brand": "Pet Qwerks",
    "price": 8,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41yroPoJJoL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Food",
      "Dry"
    ],
    "description": [
    ],
    "title": "The Best of 101 Dog Tricks",
    "brand": "",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51ToL5S1TaL.jpg"
    ]
  },
  {
    "category": [],
    "description": [
      "The venomous but beautiful scorpionfishes are extremely popular among home aquarists, with many species readily available in pet and aquarium stores. Written by one of the leading experts on this group of fish, this exclusive guide is the only trade book on the subject and covers topics essential to ensure a healthy and thriving tank, highlighting the top 25 species with profiles of their natural range, size, behavior, aquarium suitability, and specific care requirements."
    ],
    "title": "Lionfishes and Other Scorpionfishes: The Complete Guide to the Successful Care and Breeding of These Spectacular and Popular Marine Fish (Aquarium Success)",
    "brand": "Tfh/Nylabone",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51rmfZ4CmZL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Top Selection from AmazonPets"
    ],
    "description": [
      "Volume 1: 96 Words &amp; Phrases! This is the CD that has birds talking! It's easy to teach your bird to speak with Feathered Phonics! Simply choose the track you wish to teach and press \"repeat\" on your CD player. CD includes 96 tracks of words and phrases including Hello, Goodbye, I love you, Here Kitty Kitty and much more!Volume 1: 96 Words and Phrases"
    ],
    "title": "Pet Media Feathered Phonics The Easy Way To Teach Your Bird To Speak Volume 1: 96 Words and Phrases",
    "brand": "Pet Media",
    "price": 7,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/61tAtKN0blL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Grooming"
    ],
    "description": [
      "A great informational book on grooming techniques. Written by Melissa Verplank, this book outlines five key grooming methods and techniques in easy to understand terms. A fully illustrated guide to grooming."
    ],
    "title": "Theory of Five Book by Melissa Verplank",
    "brand": "Melissa Verplank",
    "price": 31,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/612-KJMr1IL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Top Selection from AmazonPets"
    ],
    "description": [
      "Ted Turner's two classic seminars now available on DVD. Watch both his The ABC's of Behavior Shaping and The Fundamentals of Training as well Proactive Behavior Management and Extinguishing Aggression - over 5 hours from one of the leading mentors of a whole generation of dog trainers! Ted entertainingly shares his extensive knowledge of behavioral science and learning theory with lots of real life examples from his 20+ years of exotic animal training including Sea World. These principles of learning are universal and salient for any training pursuit, including agility, competition obedience, pet dog manners and behavior modification, tracking and field work, freestyle, etc. This is a resource classic that every animal trainer will want to have in his library for reference and inspiration."
    ],
    "title": "ABC's of Behavior Shaping; Proactive Behavior Management Seminar DVD Set",
    "brand": "None",
    "price": 78,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51vwGj9qx4L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Fish & Aquatic Pets",
      "Aquarium Dcor"
    ],
    "description": [
      "...James Fatherree has brought together the most up-to-date literature and anecdotal information on the biology and care of tridacnid clams for the hobbyist available, along with his stunning photos. Using his distinctive, conversational and light-hearted writing style, James has written a book for every hobbyist, be they absolute beginners or seasoned veterans. --From the Foreword by J. Charles Delbeek, co-author of The Reef Aquarium: Volumes 1-3.",
      "James Fatherree has been an aquarium hobbyist since childhood, has been keeping marine aquariums for well over a decade, and has spent many days diving in Florida, Hawaii, the Bahamas, Japan, and Indonesia. He also managed a large retail aquarium store, owned and operated an aquarium design, installation, and maintenance business for several years, and spent a summer working as a diver/collector for an aquarium livestock wholesaler in Florida. James has also published over 125 articles in various aquarium magazines in the U.S. and Europe, and has written and illustrated five books on the topics of reef organisms and marine aquariums, too."
    ],
    "title": "Giant Clams in the Sea and the Aquarium",
    "brand": "James W. Fatherree",
    "price": 35,
    "imageURLHighRes": []
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Collars, Harnesses & Leashes",
      "ID Tags & Collar Accessories",
      "Collar Charms"
    ],
    "description": [
      "This book contains 8 patterns--all made with some sort of circular design! Don't be scared though. These circles are made with super simple methods. From the classic bull's eye pattern updated so it is even easier to make using charm packs and fat quarters to more contemporary designs like \"Helter Skelter. \" These will be the simplest curved designs you've ever made if you follow the author's two easy techniques for the circles: raw edge applique and fusible machine applique. If you really like another technique, you can always substitute your own technique in place of the author's techniques. All the quilts are made with 5\" charm squares. ( Of course, 12 charm squares can be cut from a fat quarter, so all the quilts are fat quarter friendly too! )"
    ],
    "title": "Simply Charming Circles",
    "brand": "Moose On The Porch Quilts",
    "price": 20,
    "imageURLHighRes": []
  },
  {
    "category": [],
    "description": [
      "Softcover book of 46 pages with 10 more layer cake friendly quilt patterns. Dessert recipes included with each pattern."
    ],
    "title": "Piece of Pie A La Mode",
    "brand": "Pie Plate Patterns",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31nF0gSP4FL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies"
    ],
    "description": [],
    "title": "Pill Wrap Paste - 56 servings",
    "brand": "Vetoquinol USA",
    "price": 19,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/518sWz8OVCL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs"
    ],
    "description": [
      "Sloppy kisses, bow-WOW tricks and enormous puppy paws. Capture those special moments in your Pathway Dog Journal. This handsome keepsake book is filled with places to note everything about your dog, from his ancestry and quirky habits to health information and pet sitter instructions. The soft, peach skin cover gives it an heirloom quality, while the gold-tone, six-ring binding makes it easy to add or change pages."
    ],
    "title": "Pathway Dog Journal, Capture Your Memories, Pet Health and More",
    "brand": "Pathway Creations",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41yJpRiRumL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Memorials"
    ],
    "description": [
      "Kitty capers, playful antics and quality cuddle time. Capture those special moments in your Pathway Cat Journal. This handsome keepsake book is filled with places to note everything about your cat, from her ancestry and quirky habits to health information and pet-sitter instructions. The soft, peach skin cover gives it an heirloom quality, while the gold-tone, six-ring binding makes it easy to add or change pages."
    ],
    "title": "Pathway Cat Journal, Capture Your Memories, Pet Health and More",
    "brand": "Pathway Creations",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/511SAprcfcL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Fish &amp; Aquatic Pets",
      "Aquarium Pumps &amp; Filters",
      "Air Pump Accessories"
    ],
    "description": [
      "Wooden Air Diffusers are manufactured from all-natural wood. Each diffuser is precisely hand cut against the grain of the wood to allow the maximum output of super fine bubbles to be released from the micro pores of the wood. Optimum for use in salt-water protein skimmers. Diffusers should be replaced every 3-4 weeks or when bubble size increases. Longevity may vary since this is a natural product"
    ],
    "title": "Lees Wooden Air Diffuser 2\" Limewood 2/pk",
    "brand": "Lees",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31125QPXZ7L.jpg"
    ]
  },
  {
    "category": [],
    "description": [
      "This combo pack provides you with all 3 Cat Sitter DVD's. Keep your cats entertained morning, noon and night with our hilarious Catsitter DVD Fun Pack DVDs. Going out to dinner? Leaving for work? Keep Fluffy distracted and curious with footage of birds, butterflies, chipmunks, fish and more, complete with sound. Go Cat Combo Pack Cat Sitter DVD Set Features: Cat Sitter DVD Volume 1 Cat Sitter DVD Volume 2 Platinum Edition and the latest Cat Sitter Volume 3 - Gone Fishing"
    ],
    "title": "Cat Sitter DVD Trilogy - Vol 1, Vol 2 and Vol 3",
    "brand": "Go Cat / Sunrise",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41yr4bswClL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Supplements &amp; Vitamins",
      "Herbal Supplements"
    ],
    "description": [
      "VetVittles tm Puppy Booster. (improved formula of the previous Puppy Health) Boosts strength, immunity and vitality, strengthens resistance to diseases; antioxidant, antimicrobial &amp; anti-inflammatory; stimulates appetite and aids digestion; antiseptic for colds and coughs; helps clear chest congestion; protects while vaccination and support weak youngsters; prevents hypoglycemia. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: alfalfa herb, ashwagandha root, astragalus root, dandelion root, fo-ti root, hibiscus flower, hops flower, hyssop herb, licorice root, marshmallow root, neem leaf, shavegrass. Instructions: For dogs only. Keep out of reach of children. Precaution: Contraindicated in severe kidney insufficiency and acute gallbladder inflammation. Dosage: Give 0.03 oz of gel (1 pump) 2-4 times a day per 5 lbs of body weight into mouth or give 3-times portion at once in case of hypoglycemia lethargy. Best before December 2016."
    ],
    "title": "Puppy Booster Herbal Supplement for Dogs",
    "brand": "VetVittles",
    "price": 12,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41c%2BX4DqYiL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Health Supplies",
      "Supplements &amp; Vitamins",
      "Herbal Supplements"
    ],
    "description": [
      "VetVittles tm Kitten Booster (improved formula of the previous Kitten Health) Boosts strength, immunity and vitality, strengthens resistance to diseases; antioxidant, antimicrobial &amp; anti-inflammatory; stimulates appetite and aids digestion; antiseptic for colds and coughs; helps clear chest congestion; protects while vaccination and support weak youngsters; prevents hypoglycemia. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: alfalfa herb, ashwagandha root, astragalus root, dandelion root, fo-ti root, hibiscus flower, hops flower, hyssop herb, licorice root, marshmallow root, neem leaf, shavegrass. Instructions: For cats only. Keep out of reach of children. Precaution: Contraindicated in severe kidney insufficiency and acute gallbladder inflammation. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 1 lb of body weight into mouth or give 2-times portion at once in case of hypoglycemia lethargy. Best before December 2016."
    ],
    "title": "Cat Vitamins Kitten Booster Pet Herbal Supplement",
    "brand": "VetVittles",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41v6YlOW9BL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Apparel &amp; Accessories",
      "Cold Weather Coats"
    ],
    "description": [
      "VetVittles tm Nice Coat Stimulates hair growth, prevents shedding, reduces itching. Chicken Flavor Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: ashwagandha root, bee pollen, damiana herb, gotu kola herb, kelp, marshmallow root, milk thistle seed, neem leaf, shavegrass, white oak bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Contraindicated in chronic renal dysfunction. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2015."
    ],
    "title": "Nice Coat Chicken Flavor Dog Herbal Supplement By Vetvittles.com",
    "brand": "VetVittles.com",
    "price": 18,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/410ikx11MJL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Feeding &amp; Watering Supplies"
    ],
    "description": [
      "VetVittles tm Allergy X Plus. (improved formula of the previous AlergyX) Reduces allergy reactions, lessens inflammation and irritation, supports the healing of skin wounds soothes aches and pains. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar + taurin and herbal remedies: catnip herb, chaparral herb, eleuthro root, fennel seed, fenugreek seed, gotu kola herb, hibiscus flower, hops flower, hyssop herb, licorice root, milk thistle seed, pau darco bark, shavegrass, valerian root, white oak bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Not to be used during pregnancy. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016. Border Collie Long Hair Collie Sheltie Caucasian Shepard Alabai (middle Asia Ovcharka) South Russian Sheepdog Kuvach Anatolian Sheepdog Chanaan dog Corgi (Cardigan Welsh; Pembroke Welsh) australian Sheepdog Schipperke puli Pumi Komondor Portuguese Great Dane Mastiff Mastinno Napoletano Presso Canario Dogo Argentino Corso Italiano Bloodhound american Staffordshire Terrier Newfoundland Landseer golden Retriever &amp; Labrador Briard Bouvier des Flandres Old English Sheepdog Black Russian Terrier Poodles: Standard, Medium, Small, Toy Saint Bernard Moscow Watchdog Leonberger Modern Poodle Great Pyrenees Scandinavian Lion Bernese Mountain Dog Spaniels English Bulldog Cocker Spaniel French Bulldog English Cocker Spaniel Pug Clumber Spaniel Boxer Springer Spaniels Boston Terrier Cavalier King Charles Spaniel Dogue de Bordeaux Brittany Runners"
    ],
    "title": "Dog Herbal Supplement, Pet Vitamins Allergy X Plus",
    "brand": "VetVittles",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31%2BgO1%2BtDkL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Health Supplies",
      "Supplements &amp; Vitamins",
      "Herbal Supplements"
    ],
    "description": [
      "VetVittles tm Power-Mune Plus (improved formula of the previous Power-Mune) Boosts strength, immunity and vitality, enforces repair of wounds, strengthens resistance to diseases, supports healing of infections and wounds, calms inflammations. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: ashwagandha root, astragalus root, bee pollen, cats claw bark, chaparral herb, echinacea purpurea tops, elder berry, eleuthro root, gotu cola herb, hyssop herb, licorice root, marshmallow root, neem leef, pau darco bark, white oak bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: May contraindicated in chronic renal dysfunction. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016."
    ],
    "title": "Power - Mune Chicken Flavor Dog Cat Herbal Supplement",
    "brand": "VetVittles",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/4153xOL%2BaQL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats",
      "Cookies, Biscuits &amp; Snacks",
      "Snacks"
    ],
    "description": [
      "VetVittles tm Liver Support Supports liver function, stimulates des-intoxication and restores liver functions, eliminates harmful metabolites. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: alfalfa herb, anise seed, blackberry leaf, cats claw bark, dandelion root, fennel seed, fenugreek seed, milk thistle seed, white willow bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Not recommended during pregnancy. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016."
    ],
    "title": "Liver Support Chicken Flavor Herbal Supplement for Dogs From Vetvittles.com",
    "brand": "VetVittles",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31iqAoPUAaL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Relaxants"
    ],
    "description": [
      "VetVittles tm NutriCalm (improved formula of the previous Natucalm) Herbal sedative and sleep aid, reduces stress while transportation, grooming, separation anxiety etc.; induces relief of stress symptoms, fortifies the body during stress or fatigue, relieves nervousness and insomnia, alleviates depressions, reduces aggression and promotes emotional well-being. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: agnus castus berry, catnip herb, poppy seed, st.johns wort, valerian root, white willow bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: May potentiate pharmaceutical MAO-inhibitors. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Better to use before December 2016."
    ],
    "title": "Vitamins for Dogs and Cats Herbal Supplement Nutri Calm",
    "brand": "VetVittles",
    "price": 18,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41VfcPi2t0L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Feeding &amp; Watering Supplies"
    ],
    "description": [
      "VetVittles tm Liver Support Supports liver function, stimulates des-intoxication and restores liver functions, eliminates harmful metabolites. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: alfalfa herb, anise seed, blackberry leaf, cats claw bark, dandelion root, fennel seed, fenugreek seed, milk thistle seed, white willow bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Not recommended during pregnancy. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016."
    ],
    "title": "Pet Vitamins Herbal Supplement Liver Support for Dogs and Cats",
    "brand": "VetVittles",
    "price": 18,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31iqAoPUAaL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Health Supplies",
      "Supplements &amp; Vitamins",
      "Herbal Supplements"
    ],
    "description": [
      "VetVittles tm Kitten Booster (improved formula of the previous Kitten Health) Boosts strength, immunity and vitality, strengthens resistance to diseases; antioxidant, antimicrobial &amp; anti-inflammatory; stimulates appetite and aids digestion; antiseptic for colds and coughs; helps clear chest congestion; protects while vaccination and support weak youngsters; prevents hypoglycemia. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: alfalfa herb, ashwagandha root, astragalus root, dandelion root, fo-ti root, hibiscus flower, hops flower, hyssop herb, licorice root, marshmallow root, neem leaf, shavegrass. Instructions: For cats only. Keep out of reach of children. Precaution: Contraindicated in severe kidney insufficiency and acute gallbladder inflammation. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 1 lb of body weight into mouth or give 2-times portion at once in case of hypoglycemia lethargy. Best before December 2016. Instructions: For dogs only. Keep out of reach of children. Precaution: Contraindicated in severe kidney insufficiency and acute gallbladder inflammation. Dosage: Give 0.03 oz of gel (1 pump) 2-4 times a day per 5 lbs of body weight into mouth or give 3-times portion at once in case of hypoglycemia lethargy. Best before December 2015. Abyssinian, American Bobtail, American Curl, American Shorthair, American Wirehair, Balinese, Bengal, Birman, Bombay, British Shorthair, Burmese, Chartreux, Cornish Rex, Cymric, Devon Rex, Egyptian Mau, Exotic Shorthair, Havana Brown, Himalayan, Japanese Bobtail, Javanese, Korat, Maine"
    ],
    "title": "Cat Vitamins Kitten Booster Herbal Supplement",
    "brand": "VetVittles",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41v6YlOW9BL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Health Supplies",
      "Supplements &amp; Vitamins",
      "Herbal Supplements"
    ],
    "description": [
      "VetVittles tm Nice Coat Stimulates hair growth, prevents shedding, reduces itching. Tuna Flavor Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: ashwagandha root, bee pollen, damiana herb, gotu kola herb, kelp, marshmallow root, milk thistle seed, neem leaf, shavegrass, white oak bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Contraindicated in chronic renal dysfunction. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2015."
    ],
    "title": "Nice Coat Tuna Flavor Pet Herbal Supplement",
    "brand": "VetVittles.com",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31v89rUniiL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Food",
      "Dry"
    ],
    "description": [
      ". Brand: Vet Vittles tm 2. Title: DOG BOOSTER, natural row food with herbal salad 3. Statement: Boosts strength, immunity and vitality, strengthens resistance to disease, stimulates appetite and aids digestion, antimicrobial activity. Natural adequate row food for canines. 4. Bar code: 5. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com 6. Net quantity statement: 0.5 lbs sausage 7. Listing of ingredients: Chicken (breast &amp; chitterlings/offal), cheese, eggs, rice carrot, lettuce apples, pumpkin, greens, fish oil plus herbal remedies: alfalfa herb, ashwagandha root, astragalus root, dandelion root, foti root, hibiscus flower, hops flower, hyssop herb, licorice root, marshmallow root, neem leaf, shavegrass. 8. Nutritional adequacy statement: Support 100% needs of the canine organism with the highly palatable proteins, fats, carbohydrates, fibers, vitamins and microelements. 9. Calorie statement: 1100 kcal/kg 10. Feeding directions: Feed ad lib, healthy medium size, age and exercise status dog should eat 0.5 lb for each 10 lbs of body weight. 11. Storage and usage: Cover and refrigerate unused portion. Best before July 2013 12. Guaranteed Analysis: -Crude protein minimum percentage - 7 -crude fat minimum percentage - 4 --crude fiber maximum percentage - 1.5 --- moisture max - 71% 13. Precaution: For dogs only. sausage"
    ],
    "title": "DOG Booster, Natural Row Food with Herbal Salad 2 Pound Size Sausage",
    "brand": "VetVittles",
    "price": 18,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41CtHcQluBL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Food",
      "Dry"
    ],
    "description": [
      ". Brand: Vet Vittles tm 2. Title: DOG BOOSTER, natural row food with herbal salad 3. Statement: Boosts strength, immunity and vitality, strengthens resistance to disease, stimulates appetite and aids digestion, antimicrobial activity. Natural adequate row food for canines. 4. Bar code: 5. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com 6. Net quantity statement: 0.5 lbs sausage 7. Listing of ingredients: Chicken (breast &amp; chitterlings/offal), cheese, eggs, rice carrot, lettuce apples, pumpkin, greens, fish oil plus herbal remedies: alfalfa herb, ashwagandha root, astragalus root, dandelion root, foti root, hibiscus flower, hops flower, hyssop herb, licorice root, marshmallow root, neem leaf, shavegrass. 8. Nutritional adequacy statement: Support 100% needs of the canine organism with the highly palatable proteins, fats, carbohydrates, fibers, vitamins and microelements. 9. Calorie statement: 1100 kcal/kg 10. Feeding directions: Feed ad lib, healthy medium size, age and exercise status dog should eat 0.5 lb for each 10 lbs of body weight. 11. Storage and usage: Cover and refrigerate unused portion. Best before July 2013 12. Guaranteed Analysis: -Crude protein minimum percentage - 7 -crude fat minimum percentage - 4 --crude fiber maximum percentage - 1.5 --- moisture max - 71% 13. Precaution: For dogs only."
    ],
    "title": "DOG Booster, Natural Row Food with Herbal Salad 2 Sausage",
    "brand": "VetVittles",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51ubC2d9t9L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats",
      "Cookies, Biscuits &amp; Snacks",
      "Snacks"
    ],
    "description": [
      "VetVittles tm EZ Flow Plus (improved formula of the previous EZ Flow) Flushes urinary tract infection, stimulates urination and kills bacteria in urinary tract and prevents bladder infections. Chicken Flavor Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: agnus castus berry, astragalus root, dill seed, juniper berry, parsley root, sarsaparilla root, uva ursi leaf. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Not for use exceeding 3-5 weeks in succession, contraindicated in inflammatory kidney disease under acid urine. Dosage: Give 0.03 oz of gel (1 pump) 2 times a day per 5 lb of body weight into mouth. Best before December 2018."
    ],
    "title": "Pet Vitamins for Dogs and Cats Ez Flow Plus Herbal Supplement",
    "brand": "VetVittles",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51RBi-sqxUL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Supplements &amp; Vitamins"
    ],
    "description": [
      "VetVittles tm Sport and Military Supports liver function, stimulates des-intoxication and restores liver functions, eliminates harmful metabolites. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: alfalfa herb, anise seed, blackberry leaf, cats claw bark, dandelion root, fennel seed, fenugreek seed, milk thistle seed, white willow bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Not recommended during pregnancy. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016."
    ],
    "title": "Dog Vitamins Pet Herbal Supplement Sport and Military",
    "brand": "VetVittles",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41ZkucqbwXL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies"
    ],
    "description": [
      "VetVittles tm Mate Calm Dog Cat Herbal Supplement (improved formula of the previous Power-Mune) Boosts strength, immunity and vitality, enforces repair of wounds, strengthens resistance to diseases, supports healing of infections and wounds, calms inflammations. Chicken Flavor Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: ashwagandha root, astragalus root, bee pollen, cats claw bark, chaparral herb, echinacea purpurea tops, elder berry, eleuthro root, gotu cola herb, hyssop herb, licorice root, marshmallow root, neem leef, pau darco bark, white oak bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: May contraindicated in chronic renal dysfunction. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016."
    ],
    "title": "Mate Calm Dog Cat Herbal Supplement",
    "brand": "VetVittles",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41rTCI%2BKRBL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs"
    ],
    "description": [
      "VetVittles tm Nutri Calm Dog Cat Herbal Supplement (improved formula of the previous Power-Mune) Boosts strength, immunity and vitality, enforces repair of wounds, strengthens resistance to diseases, supports healing of infections and wounds, calms inflammations. Chicken Flavor Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: ashwagandha root, astragalus root, bee pollen, cats claw bark, chaparral herb, echinacea purpurea tops, elder berry, eleuthro root, gotu cola herb, hyssop herb, licorice root, marshmallow root, neem leef, pau darco bark, white oak bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: May contraindicated in chronic renal dysfunction. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016."
    ],
    "title": "Dog Vitamins Pet Supplement Herbal Nutri Calm",
    "brand": "VetVittles",
    "price": 12,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41K470Obb9L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Health Supplies",
      "Hip &amp; Joint Care"
    ],
    "description": [
      "VetVittles tm Kitten Booster (improved formula of the previous Kitten Health) Boosts strength, immunity and vitality, strengthens resistance to diseases; antioxidant, antimicrobial &amp; anti-inflammatory; stimulates appetite and aids digestion; antiseptic for colds and coughs; helps clear chest congestion; protects while vaccination and support weak youngsters; prevents hypoglycemia. Chicken Flavor Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar and herbal remedies: alfalfa herb, ashwagandha root, astragalus root, dandelion root, fo-ti root, hibiscus flower, hops flower, hyssop herb, licorice root, marshmallow root, neem leaf, shavegrass. Instructions: For cats only. Keep out of reach of children. Precaution: Contraindicated in severe kidney insufficiency and acute gallbladder inflammation. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 1 lb of body weight into mouth or give 2-times portion at once in case of hypoglycemia lethargy. Best before December 2016."
    ],
    "title": "Cat Vitamins Kitten Booster Pet Herbal Supplement",
    "brand": "VetVittles",
    "price": 24,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41jNJWoDKJL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Cats",
      "Health Supplies",
      "Supplements & Vitamins"
    ],
    "description": [
      "VetVittles tm Allergy X Plus. (improved formula of the previous AlergyX) Reduces allergy reactions, lessens inflammation and irritation, supports the healing of skin wounds soothes aches and pains. Manufacturers name and address: Made in USA, source of US certified herbal remedies: San Francisco Herb &amp; Natural Food Co.; Vet Vittles, 223 W 38th Street, New York, NY 10018; tel. (888) 807 4588; www.vetvittles.com Net quantity statement: 2 Oz of highly palatable gel per bottle. Ingredients: Honey, agar-agar + taurin and herbal remedies: catnip herb, chaparral herb, eleuthro root, fennel seed, fenugreek seed, gotu kola herb, hibiscus flower, hops flower, hyssop herb, licorice root, milk thistle seed, pau darco bark, shavegrass, valerian root, white oak bark. Instructions: For dogs and cats only. Keep out of reach of children. Precaution: Not to be used during pregnancy. Dosage: Give 0.03 oz of gel (1 pump) 2-3 times a day per 3 lb of body weight into mouth. Best before December 2016. Border Collie Long Hair Collie Sheltie Caucasian Shepard Alabai (middle Asia Ovcharka) South Russian Sheepdog Kuvach Anatolian Sheepdog Chanaan dog Corgi (Cardigan Welsh; Pembroke Welsh) australian Sheepdog Schipperke puli Pumi Komondor Portuguese Great Dane Mastiff Mastinno Napoletano Presso Canario Dogo Argentino Corso Italiano Bloodhound american Staffordshire Terrier Newfoundland Landseer golden Retriever &amp; Labrador Briard Bouvier des Flandres Old English Sheepdog Black Russian Terrier Poodles: Standard, Medium, Small, Toy Saint Bernard Moscow Watchdog Leonberger Modern Poodle Great Pyrenees Scandinavian Lion Bernese Mountain Dog Spaniels English Bulldog Cocker Spaniel French Bulldog English Cocker Spaniel Pug Clumber Spaniel Boxer Springer Spaniels Boston Terrier Cavalier King Charles Spaniel Dogue de Bordeaux Brittany Runners"
    ],
    "title": "Pet Herbal Supplement Vitamins Allergy X Plus",
    "brand": "VetVittles",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/416-ueRv1WL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats",
      "Cookies, Biscuits &amp; Snacks",
      "Snacks"
    ],
    "description": [
      "Description Proper exercise, nutritious food, and healthy supplements are necessary things to ensure a fulfilling life for our four-legged companions - it goes without saying. However, some things are so obvious that we easily take them for granted: love and joy! Now more than ever, people are realizing the importance of mood in affecting health. And what better way to improve mood than through our stomachs? Our treats are made with useful herbal supplements and lovely, tasty \"candy\", compacted into a convenient size. Whether it is to show our love, reward them for good behavior, or just to add some more joy into their life, VetVittles has you covered with its unique line of herbal treats. We strive through a long process of experimentation and testing to reach the quality which will please any picky eater. These treats have been developed using the deep knowledge of the evolution of the domesticated animal (the complexity of the digestive system, sensory input, holistic methods of improving health, etc) and contemporary natural biochemistry in order to create the perfect treat. Each animal is different and has its own likes and dislikes. We understand that and have developed numerous types of treats. So rest assured, we won't leave you empty-handed! Benefits Well dried so they can be stored for a reasonably long time All are handmade and prepared with only raw wholefood ingredients No fat means no worries, making it a perfect treat for training or \"because I love you\" rewards Ingredients lean chicken breast alfalfa herb Ashwagandha root dandelion root foti roots hibiscus flower hops flower hyssop herb garlic powder marshmallow root neem leaf shavegrass Astragalus root Specifications Guaranteed Analysis: crude protein - 86% min Crude fat - 3% max Fiber - 1% max Moisture - 10% max Manufactured: Vet Vittles Co. Proudly made in the USA."
    ],
    "title": "Chicken Fillet Treats for Dogs",
    "brand": "Chicken Fillet Treats for dogs",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51%2BZ6TKrIdL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats"
    ],
    "description": [
      "Dry Shrimp with Herbs for Dogs and Cats"
    ],
    "title": "Dry Shrimp with Herbs for Dogs and Cats",
    "brand": "Unknown",
    "price": 25,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51Y9bfVHx-L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats",
      "Cookies, Biscuits &amp; Snacks",
      "Snacks"
    ],
    "description": [
      "Dry Beef with Herbs Proper exercise, nutritious food, and healthy supplements are necessary things to ensure a fulfilling life for our four-legged companions - it goes without saying. However, some things are so obvious that we easily take them for granted: love and joy! Now more than ever, people are realizing the importance of mood in affecting health. And what better way to improve mood than through our stomachs? Our treats are made with useful herbal supplements and lovely, tasty \"candy\", compacted into a convenient size. Whether it is to show our love, reward them for good behavior, or just to add some more joy into their life, VetVittles has you covered with its unique line of herbal treats. We strive through a long process of experimentation and testing to reach the quality which will please any picky eater. These treats have been developed using the deep knowledge of the evolution of the domesticated animal (the complexity of the digestive system, sensory input, holistic methods of improving health, etc) and contemporary natural biochemistry in order to create the perfect treat. Each animal is different and has its own likes and dislikes. We understand that and have developed numerous types of treats. So rest assured, we won't leave you empty-handed! **made on order** Benefits Well dried so they can be stored for a reasonably long time All are handmade and prepared with only raw wholefood ingredients No fat means no worries, making it a perfect treat for training or \"because I love you\" rewards Ingredients lean beef strips alfalfa herb Ashwagandha root dandelion root foti roots hibiscus flower hops flower hyssop herb garlic powder marshmallow root neem leaf shavegrass Astragalus root"
    ],
    "title": "Harvest Treats",
    "brand": "Dog beef with herbs treat ground",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51aOtD2hp2L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats",
      "Cookies, Biscuits &amp; Snacks",
      "Snacks"
    ],
    "description": [
      "Harvest Treats Proper exercise, nutritious food, and healthy supplements are necessary things to ensure a fulfilling life for our four-legged companions - it goes without saying. However, some things are so obvious that we easily take them for granted: love and joy! Now more than ever, people are realizing the importance of mood in affecting health. And what better way to improve mood than through our stomachs? Our treats are made with useful herbal supplements and lovely, tasty \"candy\", compacted into a convenient size. Whether it is to show our love, reward them for good behavior, or just to add some more joy into their life, VetVittles has you covered with its unique line of herbal treats. We strive through a long process of experimentation and testing to reach the quality which will please any picky eater. These treats have been developed using the deep knowledge of the evolution of the domesticated animal (the complexity of the digestive system, sensory input, holistic methods of improving health, etc) and contemporary natural biochemistry in order to create the perfect treat. Each animal is different and has its own likes and dislikes. We understand that and have developed numerous types of treats. So rest assured, we won't leave you empty-handed! Benefits Well dried so they can be stored for a reasonably long time All are handmade and prepared with only raw wholefood ingredients No fat means no worries, making it a perfect treat for training or \"because I love you\" rewards Ingredients apples pumpkin carrots alfalfa herb Ashwagandha root dandelion root foti roots hibiscus flower hops flower hyssop herb garlic powder marshmallow root neem leaf shavegrass Astragalus root Manufactured: Vet Vittles Co. Proudly made in the USA."
    ],
    "title": "Harvest Treats",
    "brand": "Dog vegitarian treat",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51Gn6HP1T5L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats",
      "Cookies, Biscuits & Snacks",
      "Snacks"
    ],
    "description": [
      "Dry Fish with Herbs Description Proper exercise, nutritious food, and healthy supplements are necessary things to ensure a fulfilling life for our four-legged companions - it goes without saying. However, some things are so obvious that we easily take them for granted: love and joy! Now more than ever, people are realizing the importance of mood in affecting health. And what better way to improve mood than through our stomachs? Our treats are made with useful herbal supplements and lovely, tasty \"candy\", compacted into a convenient size. Whether it is to show our love, reward them for good behavior, or just to add some more joy into their life, VetVittles has you covered with its unique line of herbal treats. We strive through a long process of experimentation and testing to reach the quality which will please any picky eater. These treats have been developed using the deep knowledge of the evolution of the domesticated animal (the complexity of the digestive system, sensory input, holistic methods of improving health, etc) and contemporary natural biochemistry in order to create the perfect treat. Each animal is different and has its own likes and dislikes. We understand that and have developed numerous types of treats. So rest assured, we won't leave you empty-handed! Benefits Well dried so they can be stored for a reasonably long time All are handmade and prepared with only raw wholefood ingredients No fat means no worries, making it a perfect treat for training or \"because I love you\" rewards Ingredients Catfish fillet alfalfa herb Ashwagandha root dandelion root foti roots hibiscus flower hops flower hyssop herb garlic powder marshmallow root neem leaf shavegrass Astragalus root Guaranteed Analysis: crude protein - 86% min Crude fat - 3% max Fiber - 1% max Moisture - 10% max Manufactured: Vet Vittles Co. Proudly made in the USA."
    ],
    "title": "Dry Fish for Dogs Treat",
    "brand": "Dry fish for dogs treat",
    "price": 15,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51QoOyGxtfL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Grooming",
      "Shampoos &amp; Conditioners",
      "Shampoos"
    ],
    "description": [
      "VetVittles shampoo is a superior cleansing shampoo containing degreasing agents that make it very effective on oily skin and coat. The high sudsing easy-to-rinse formula cleans thoroughly, yet leaves the coat lustrous and manageable. Vet Vittles Citrus Shampoo contains a special ingredient to keep the coat cleaner, longer, and emits a pleasant, long-lasting citrus fragrance."
    ],
    "title": "VetVittles Citrus Shampoo with Degreasing Agents for Dogs &amp; Cats 8 oz",
    "brand": "VetVittles",
    "price": 8,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31mWh8K5nxL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Hip &amp; Joint Care"
    ],
    "description": [],
    "title": "VetVittles Aging Paw Plus - Natural Anti-Aging Supplement with Organic Herbs for Senior Dogs and Cats - Improves Blood Circulation and Supports Joints, Gel Formula, Made in USA, 6.25 oz",
    "brand": "VetVittles",
    "price": 15,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41%2BEs-MLtjL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Digestive Remedies"
    ],
    "description": [],
    "title": "VetVittles EZ Flow Plus - Natural Urinary Tract Supplement with Organic Herbs for Dogs and Cats - Provides UTI Relief and Bladder Support, Gel Formula, Made in USA, 6.25 oz",
    "brand": "VetVittles",
    "price": 15,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41hozFn2EfL.jpg"
    ]
  },
  {
    "category": [],
    "description": [],
    "title": "VetVittles Power-mune Plus - Natural Immunity Booster Supplement with Organic Herbs for Dogs and Cats - Strengthens Immune System and Supports Healing, Gel Formula, Made in USA, 6.25 oz",
    "brand": "VetVittles",
    "price": 15,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41dE36FXTEL.jpg"
    ]
  },
  {
    "category": [],
    "description": [],
    "title": "VetVittles KITTEN BOOSTER Holistic Herbal Multi Vitamin and Supplement for Kittens and Junior Cats, 100% Natural, Product Made in USA, 6.25 oz",
    "brand": "VetVittles",
    "price": 15,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41SVRZX63GL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Supplements &amp; Vitamins",
      "Multivitamins"
    ],
    "description": [],
    "title": "VetVittles Puppy Booster - Natural Vitamin and Supplement with Organic Herbs for Puppies and Small Dogs - Supports Healthy Development and Prevents Hypoglycemia, Gel Formula, Made in USA, 6.25 oz",
    "brand": "VetVittles",
    "price": 15,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41Apf1%2BRzGL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies"
    ],
    "description": [
      "Our Dog Whisperer with Cesar Milan Complete First Season DVD includes bonus materials such as: doggie auditions, outtakes and never before seen segments. Each episode of the Dog Whisperer documents the remarkable transformations that take place under Cesar's guidance and teachings, helping dogs and their owners live happier lives together. 26 episodes, 4 disc DVD set. English, Closed Captioned, color/650 minutes."
    ],
    "brand": "Cesar Millan",
    "price": 40,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41nqJb-1T4L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Fish &amp; Aquatic Pets",
      "Aquarium Pumps &amp; Filters",
      "Filter Accessories"
    ],
    "description": [
      "Pre-Filter Sleeve for the SeaClear System II aquarium. Will fit the 16\" or the 20\" models."
    ],
    "brand": "SeaClear",
    "price": 20,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/210EDZAKWCL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Health Supplies",
      "Hip &amp; Joint Care"
    ],
    "description": [
      "Dr. Rexy hemp oil has powerful anti-inflammatory properties, which have shown to help relieve joint pain and achieve more mobility, agility and energy. Full spectrum hemp oil provides a natural calming effect which may help relieve stress, separation anxiety, travel issues, constant barking, natural aggressive behavior and fear of storms and anxiety related conditions. Made strictly with organic derived ingredients to provide the highest quality in health for your pets."
    ],
    "title": "DR.REXY Hemp Oil for Dogs and Cats - 100% Organic Food Supplement - Full Spectrum Hemp Extract - Pain Relief for Dogs &amp; Cats, Calming, Stress &amp; Anxiety Support, Wellness, Hip &amp; Joint Health - 250mg",
    "brand": "DR.REXY",
    "price": "$19.90",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51jtzNf9UZL.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Treats"
    ],
    "description": [
      "You won't want to miss this one from Paris Permenter and John Bigley.... We are sure you'll love this book and your pets will love you for caring enough to give them the very best.\" - PetsWeekly.com"
    ],
    "title": "The Healthy Hound Cookbook: Over 125 Easy Recipes for Healthy, Homemade Dog Food--Including Grain-Free, Paleo, and Raw Recipes!",
    "brand": "Visit Amazon's Paris Permenter Page",
    "price": 14,
    "imageURLHighRes": []
  },
  {
    "category": [
      "Pet Supplies",
      "Dogs",
      "Collars, Harnesses &amp; Leashes",
      "Collars",
      "Bark Collars"
    ],
    "description": [
      "This listing features a Disney Junior Deluxe Read-and-Play Gift Set Book Set Jake &amp; Never Land Pirates. New. Item Specifics: Shine your flashlight on the pop-ups to cast shadows! Search, paint, and match! Sing and play along with popular melodies! Press the buttons to bring the story to life! 6 sturdy board books starring Mickey and friends!"
    ],
    "title": "Disney Junior Deluxe Read-and-Play Gift Set - 12 Book Set Featuring Jake and the Never Land Pirates and Mickey Mouse - Includes a Cuddly Plush Mickey Mouse Doll",
    "brand": "Disney",
    "price": 30,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51f9PPzTC6L.jpg"
    ]
  },
  {
    "category": [
      "Pet Supplies",
      "Fish &amp; Aquatic Pets",
      "Aquarium Lights"
    ],
    "description": [
      "The 10 watt halogen bulb in the biOrb light unit should last for around 1200 hours. We recommend leaving the light on for 6-7 hours a day. The biOrb bulb must be replaced with the correct biOrf 10 watt 12 volt bulb. Larger bulbs may kill the transformer and could have an adverse effect on the light unit and biOrb."
    ],
    "title": "biOrb Light Bulb - 10 watt",
    "brand": "biOrb",
    "price": 34,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31ZFR3BA52L.jpg"
    ]
  },
  {
    "category": [
      "Outdoor Activities"
    ],
    "subcategory": [
      "Badminton"
    ],
    "description": [
      "Brand new and high quality  Enables fast volleys and ensures flight consistency  Good Flight and durability  Crafted using good-quality goose feathers with a durable foam head of this White Badminton.  Goose Shuttlecocks is for club match or club play  Package Include: 12 x Badminton Balls (in one tube)"
    ],
    "title": "White Badminton",
    "brand": "GBStore",
    "price": 13,
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31lQlMNtazL.jpg"
    ]
  }
]
