[{"category": ["Video Games", "PC", "Games"], "description": [], "title": "Reversi Sensory Challenger", "brand": "Fidelity Electronics", "price": "$400", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/31nTxlNh1OL.jpg"]},
{"category": ["Video Games", "Xbox 360", "Games"], "description": ["Brand new sealed!"], "title": "Medal of Honor: Warfighter - Includes Battlefield 4 Beta - Limited Edition", "brand": "EA Games", "price": "$400", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/513h6dPbwLL.jpg"]},
{"category": ["Video Games", "Retro Gaming & Microconsoles", "Super Nintendo", "Games"], "description": [], "title": "street fighter 2 II turbo super nintendo snes super nes video game", "brand": "Nintendo", "price": "$720", "imageURLHighRes": []},
{"category": ["Video Games", "Xbox 360", "Accessories", "Controllers", "Joysticks", "Original PCB used from Xbox 360 Control Pad (to ensure 100% compatibility)", "FULL SIZE MAS STICK", "Special Design for Xbox 360 (Street Fighter Button Layout)", "Uses USB port of your Xbox 360 (not wireless),Works with PC games as well", "Perfect 360 Optical Stick by HAPP (used in most U.S. Arcades)"],  "description": ["MAS's Pro Xbox 360 Stick (Perfect 360 Stick) SF Style White/Green Overlay"], "title": "Xbox 360 MAS STICK", "price": "$650", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51oaA-KAaiL.jpg"]},
{"category": ["Video Games", "PC", "Games", "Grades 2-12", "Spelling Program", "Teaches Spelling Rules", "Treats Sight Words", "Records Results"],  "description": ["Phonics Alive! 3, The Speller teaches students to plan how to spell new and unfamiliar words. Traditional Spelling Rules are explained and actively taught, followed by practice activities. Sight Words are taught and practice games ensure that learning is fun. To best suit individual needs, students are able to choose from a variety of sight words (general lists, community signs, science words, mathematics words, secondary words or compound words). A wide variety of additional words are provided with sound files enabling teachers to add custom word lists to the program.", "Students will advance their understanding of the grapho-phonic nature of our language and of the complicated alphabetic mapping system of English. The program consists of 15 modules. It is self paced and sequentional. The starting age of the program is 8 or grade 3.", "Phonics Alive! 3, The Speller continues the tradition of excellence in offering fun learning through a high quality teacher resource. The student is again offered a technology based, highly interactive environment through which they are actively taught. It is a student centered approach, anticipating errors and stimulating interest through visual puns, broad humour, animation and sound effects."], "title": "Phonics Alive! 3: The Speller", "brand": "by Advanced Software Pty. Ltd.", "price": "$800", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/512maj2wBaL.jpg"]},
{"category": ["Video Games", "PC", "Games", "Sim City 3000 CD-ROM"],  "description": ["CD-ROM"], "title": "Sim City 3000", "brand": "Scholastic", "price": "$450", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61GK8Wv2yyL.jpg"]},
{"category": ["Video Games", "PC", "Games", "Phonics Alive! 2 The Sound Blender is a new and innovative Australian made program teaching students the essential skills and phonological knowledge of sound blending. All forms of digraphs, diphthongs, silent letters and suffixes are explored and explained, including ch, sh, een, kn, ar, aw, au, ith, wr, et and many more. The Sound Blender introduces and consolidates advanced decoding skills to assist students to recognize and decode previously unknown words."], "description": [], "title": "Phonics Alive! 2 The Sound Blender", "brand": "Advanced Software Party", "price": "$210", "imageURLHighRes": []},
{"category": ["Video Games", "PC", "Games"],  "description": ["a scholastic clubs fairs cd rom game"], "title": "A to Zap", "brand": "Sunburst", "price": "$189", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61O9Q6vbe0L.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["video game"], "title": "Need for Speed Porsche Unleashed", "brand": "Electronic Arts", "price": "$49.98", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51loPlexBoL.jpg"]},
{"category": ["Video Games", "PC", "Games", "Like the real world, Freddi Fishs world changes every time you play.", "Discover fascinating places like King Crabs castle, a volcano or a sunken ship.", "Out of time? You can save the game and finish it later.", "Take breaks with Freddi Fish: play games like Feeding Time or uncover hundreds and hundreds of secret Click Points!"],  "description": ["Grandma Groupers kelp seeds are missing and without them all of the sea creatures will go hungry! Good thing Freddi Fish and her finny friend Luther are on the case, and, thanks to a couple of bumbling sharks, theyve got some great leads. But the oceans a big place--theres lots of ground to cover and many obstacles to overcome before the case is solved! Through underwater caves, deep canyons, colorful reefs and more, kids will be immersed for hours in this bottomless adventure of fun, friends, discovery and learning.\n\nPC\n33 MHz 486 with 8 MB RAM SVGA (640x480, 256 color) graphics\nWindows 95 or higher\nSound card\nDouble-speed CD-ROM drive \n\nMacintosh\nMinimum 25 MHz 68040 or Power PC with 8 MB of RAM, 640x480,256 color\nSystem 7.0 or higher\nDouble-speed CD-ROM drive"], "title": "Freddi Fish and the Case of The Missing Kelp Seeds", "brand": "Humongous Entertainment", "price": "$500", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/416QZg89p7L.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["This software is BRAND NEW. Packaging may differ slightly from the stock photo above. Please click on our logo above to see over 15,000 titles in stock."], "title": "Ice Cream Truck", "brand": "Sunburtst", "price": "$150", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51qxE-yv7EL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["OREGON TRAIL 5TH EDITION (JEWEL CASE). Create Your Journey.  Explore the West! Live the Adventure! Survive the Trail! Westward, Ho! Are you ready to travel the Oregon Trail It going to take insight and careful planning to choose the right traveling companions, gear, and supplies. Even then, there are countless unpredictable hazards, like swollen rivers, poisonous creatures, and deadly diseases.Decide your occupation, who you l take with you, and where you e headed! Learn From the Pioneers.  Talk with pioneers rish, African Americans, Native Americans, and other settlers. Share their dreams, fears, and adventures.  Blaze a Trail.  Ford raging rivers. Hunt, fish, and forage for food. Be a part of the taming of the wild West. From the banks of the great Mississippi to the sweeping Williamette Valley, you l carve your own trail through an historic adventure.  Discover Jeds Tales.  Through riveting mini-movies, you l befriend Captain Jed Freedman, an experienced fur trader who is trail-wise and a great story-teller! System Requirements for Windows.  Windows 98, 2000, Me, XP.  Pentium166 MHz or faster.  32 MB RAM.  120 MB free hard disk space.  640x480 monitor, 16-bit color.  Windows-compatible sound card.  speakers.  8X CD-ROM drive.  System Requirements for Macintosh.  Mac OS 8.6.2, OS X.  Power PC 180 MHz or faster.  32 MB RAM.  120 MB free hard disk space.  640x480 monitor, thousands of colors.  8X CD-ROM drive."], "title": "BRAND NEW Learning Company Oregon Trail 5th Edition Jewel Case Swollen Dreams Fears Adventures Rivers", "brand": "Learning Company", "price": "$200", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61iY7i7rXnL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Schoolhouse Rock: America Rock lets players experience American history and geography while trying to get their bill passed through both houses of Congress and on to The White House. To get on the road to Capitol Hill, players must gain one acceptance stamp from each of the games contained in the program. Beating the game gives the players the stamp they need but each game has a different requirement for winning. Players have their choice of five different bills or they can write their own. There are three levels of difficulty that cannot be switched while in the game. In addition to gaining acceptance stamps, winning the five games gives players tools they can use to get out of the various pitfalls on their way to getting their bill voted into law. To get help on the games, players can also view the videos that were originally shot for the Schoolhouse Rock program."], "title": "school house rock america rock", "brand": "Creative Wonders",  "price": "$150", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61zvGUfzU9L.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Product Description Your ship has crash-landed on the planet Tatooine near Jabba the Hutt's famous game plaza. Earn credits to buy new ship parts by outsmarting your opponents in games of skill and logic. Rebuild your ship and return home. Develop your knowledge of addition, subtraction, multiplication, equivalancies, and geometric relationships. Star Wars Math excites kids about math through the incentive of competition and the challenge of strategy. An overarching goal within a nonlinear game encourages replay, while multiple difficulty levels allow players to learn at their own pace. Lonely? Try choosing the two-player option to challenge friends. WINDOWS CD-ROM 100% Windows 95, 98, or 2000 DirectX compatible computer required* Pentium class 166MHz or faster computer required 32MB RAM minimum required 4X IDE or SCSI CD-ROM drive minimum required 100% DirectX compatible 2MB PCI or AGP graphics card required 100% DirectX compatible 16-bit sound card required 100% Windows 95/98/2000 compatible mouse and keyboard required Minimum 100MB of free hard disk space recommended QuickTime 4.1.2 required** *NOTE: Microsoft DirectX 7.0 is included on this CD-ROM and must be installed to play Star Wars Math. Your system may require the \"latest\" Windows 95/98/2000 drivers for your particular hardware. MACINTOSH CD-ROM Apple Macintosh and 100% compatibles required Mac OS version 7.6 or higher Minimum 160MHz PowerPC 603e, 120MHz PowerPC 604, or any G3 or faster processor required 32MB RAM minimum required 4X CD-ROM drive minimum required Mouse and keyboard required 640x480 display with thousands of colors Minimum 100MB of free hard disk space recommended QuickTime 4.1.2 required** **NOTE: QuickTime 4.1.2 is included on this CD-ROM and must be installed to play Star Wars Math."], "title": "Star Wars Math: Jabba's Game Galaxy", "brand": "Star Wars", "price": "$24", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51Gh39kqFiL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Supports Windows XP, rated E for everyone"], "title": "Soccer Mania", "brand": "LEGO",  "price": "$220", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61L0s3mccUL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["There is so much to do on LEGO Island: building, racing, flying, water jetting, skateboarding and just kickin' with your friends... unless you accidentally let the Brickster out of jail. Award Winning.", "The mischievous Brickster has broken out of the town jail and turned loose his army of Brickster Bots to take apart LEGO Island brick by little plastic brick. Players become Pepper, the skateboarding pizza delivery boy, to battle Brickster through 18 levels based on popular LEGO play themes, such as Adventurers, Castle, and LEGO City. Players ride a variety of conveyances around the island from a first-person perspective, including a space shuttle and a pterodactyl. Objectives within the levels include deep-sea diving for bricks, jousting with the Dark Knight, snake shooting, matching mummies in ancient Egypt, and target parachuting. Friendly LEGO figures are always close by and willing to offer pithy observations."], "title": "LEGO Island 2 - PC", "brand": "LEGO", "price": "$200", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61YBTBP3VXL.jpg"]},
{"category": ["Video Games", "PC", "Games", "3 games", "Need For Speed Porsche Unleashed", "Need for Speed High Stakes", "Need for Speed III Hot Pursuit"],  "description": ["3 Great games in one box set!"], "title": "Need for Speed Racing Pack", "brand": "Scholastic EA", "price": "$150", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51vAK8%2BUCgL.jpg"]},
{"category": ["Video Games", "Retro Gaming &amp; Microconsoles", "Sega Genesis", "Games"],  "description": ["Star Wars Arcade SEGA 32X"], "title": "Star Wars Arcade SEGA 32X", "brand": "Sega",  "price": "$200", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/31e2kbmK0eL.jpg"]},
{"category": ["Video Games", "PC", "Games", "showdown in ghost town", "phantom of the night", "jinx at the sphinx"],  "description": ["cartoon network"], "title": "Scooby-do Mystery Adventures", "brand": "Cartoon Network",  "price": "$110", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51msT%2B-bKaL.jpg"]},
{"category": ["Video Games", "PC", "Games", "3d Interactive Mystery Game", "Message in a Hunted Mansion", "Stay Tuned for Danger", "3 levels of difficultcy"],  "description": ["WOW! 3d NANCY DREW MYSTERY GAME 20+ hours of game play"], "title": "Nancy Drew 3D Interactive Mystery Game", "brand": "Scholastic",  "price": "$340", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51GxXLrv3nL.jpg"]},
{"category": ["Video Games", "PC", "Games", "Fly 14 Planes into combat", "Play 10 Missions including Guadalcanal, Midway, and Okinawa", "Training missions including Flying Tigers. Train in realistic offline missions", "Real-time re-enactment of the Japanese attack on Pearl Harbor. Historicaally accurate models", "Hidden Surprises!"],  "description": [], "title": "Pearl Harbor Zero Hour, Warbirds III Fighter Pilot Academy", "brand": "Scholastic",  "price": "$330", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51hYEAwNGiL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["This wicked cricket is a rugged individualist, outdoorsy type. He's cynical with springy reflexes. He's into avoiding trouble and can defend himself with electrified antennae. He's looking for adventure with the right person."], "title": "Zapper- One Wicked Cricket!", "brand": "Infogrames Scholastic",  "price": "$115", "imageURLHighRes": []},
{"category": ["Video Games", "PC", "Games", "More interactions, alliances and realistic artificial intelligence responses put players in the middle of negotiations, trade systems and diplomatic actions. Advanced trade system to manage resources, trade routes and spread of technology.", "Improved combat options provide finer levels of control for enhanced war-making capabilities.", "Technologies, Wonders Of The World and Great People expand the scope of the game.", "New elements of Culture, Nationality and the Arts help players plan a new peaceful pathway to victory.", "Active world generator creates more realistic maps and organic terrain features."],  "description": ["Civilization III, a highly addictive journey of discovery, now features an updated and enhanced multiplayer expansion pack called, Civilization III: Play the World, as well as all of the great new \"Civs,\" Scenarios, and Features from Civilization III: Conquests! Civilization III: Complete provides more ways to win, more ways to explore, more strategies to employ, and more exciting modes of play all in one this version! Civilization III: Complete gives Civ fans the opportunity to enjoy the best strategic gameplay, alone or against players from around the whole earth! Cibilization III is a must have for serious gamers!"], "title": "Sid Meier's Civilization III", "brand": "Infogrames, Firaxis Games",  "price": "$400", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41Wp36DrdSL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["WITH AUDIO ADVISE, VARIETY OF TOURNAMENTS, , WITH BEGINNING, INTERMEDIATE, AND ADVANCED,"], "title": "Chessmaster 9000", "brand": "Ubi Soft",  "price": "$350", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61hB6Jks6-L.jpg"]},
{"category": ["Video Games", "PC", "Games", "15 New Characters!", "All New Weapons And Action!", "Fantastic fun just like the historic coin-op game!", "PC: Windows 95/98/ME"],  "description": ["Thousands of years ago in a battle with the fallen Elder God known as Shinnok, I was responsible for the death of an entire civilization. To rid all realms of Shinnok's menace I waged a war that plunged the Earth into centuries of darkness and banished Shinnok into a place called the Netherealm. Now after Shao Kahn's defeat at the hands of Earth's warriors, Shinnok has managed to escape his confines in the Netherealm. The war is now being fought once again. \"Only this time It can be won by mortals.\" - The Words of Raiden Battle with one of 15 characters. With newly forged weapons that will slash and bludgeon beyond imagination. The most advanced combat sim you have ever seen. Are you ready to take on the challenge...1"], "title": "Mortal Kombat 4", "brand": "Midway Games", "price": "$455", "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51v1XyySUWL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Compete to be the world's greatest driver in the most intense race ever created- the Highway 35 circuit. Do you have what it takes to master treacherous jumps, death defying loops, and win the Hot Wheels World Race event?"], "title": "Hot Wheels World Race", "brand": "THQ", "feature": ["Hot Wheels World Race Computer Game", "Hot Wheels", "World Race", "Computer Game"], "rank": [">#108,012 in Video Games (See Top 100 in Video Games)", ">#14,782 in Video Games > PC Games > PC Games"], , "main_cat": "Video Games",  "price": "\n\t\t\t\t\t\t\t\t\t\t\t\t<span class=\"verticalAlign a-size-large\"", "asin": "0439773660", "imageURL": [], "imageURLHighRes": []},
{"category": ["Video Games", "PC", "Games"],  "description": ["Backyard Basketball and Backyard Hockey 2005 feature 3-on-3 action (plus goalies in Hockey), 3 ways to play (Quick Game, Single Match or a complete Season Play), various selections of courts and rinks, unlockables and dozens of power-ups."], "title": "Backyard Hockey 2005 (PC) / Backyard Basketball (PC/Mac) bundle", "also_buy": ["B00005ME4Y", "B0000TQRDK", "B00007B77W"], , "brand": "Humongous Entertainment", "feature": ["2 Games / 2 CD-ROMs in one Product", "Backyard Hockey 2005 (works on Windows 98/98SE/Me/2000/XP)", "Backyard Basketball (works on Windows 98/98SE/Me/2000 and Macintosh 7.5.5 or higher/OS X Classic only"], "rank": [">#32,026 in Video Games (See Top 100 in Video Games)", ">#2,245 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0439803705", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/41Yv2vlOenL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41Yv2vlOenL.jpg"]},
{"category": ["Video Games", "PC", "Games", , "Incredible Stunts! Fierce Power! Amazing Speed! 30 of the most popular hot wheel cars. Awesome multi-player action. Customize your car with different colors, wheels and decals."],  "description": [], "title": "Hot Wheels Interactive Stunt Track Challenge", "brand": "by\n    \n    Scholastic", "feature": ["Incredible Stunts! Fierce Power! Amazing Speed! 30 of the most popular hot wheel cars. Awesome multi-player action. Customize your car with different colors, wheels and decals."], "rank": [">#117,718 in Video Games (See Top 100 in Video Games)", ">#16,578 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0439813182", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/61sev5zVy0L._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/61sev5zVy0L.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["brain building computer game"], "title": "I Spy Mystery", "also_buy": ["B0009PCGJO", "B000F71066", "B001BFRPVU", "B000A40W54", "B000QX67N0", "B000BCEJ5E", "B00097CZAM", "B00005NN17", "B00004U1PN", "B000FETCF0", "B00005LBVS", "B001GAR6PU", "B01KN5AVVE", "B000096P64", "B007VIYQUO", "B00006IJHX", "B015UA1SXC", "B00009VRG5", "B00SNAJZO6", "B00TQ7CPL0", "B0081GO64G", "0545110084", "B006R12EA0", "B002BUUMK0", "B01L8QI34O", "B01LAXDG6K", "B0088I6JEW", "B002YW35HC", "B00BYD056G", "B00ZVL6X68", "B0000CDZUZ", "B00KRQLL82", "B0002J6HV0", "B00VH44ZTA", "B013OKIJQE", "B006R12DW4", "B010E7M3HG", "B005J3J5E0", "B000R99IFC", "B019UGNK56", "0439903491"], , "brand": "I spy", "feature": ["ages 6-10", "for language arts, thinking skills, problem solving", "13 mysteries that need your super-sleuth skills like: locked gate, pirates map, and midnight mouse"], "rank": [">#19,535 in Video Games (See Top 100 in Video Games)", ">#136 in Video Games > Mac Games > Mac Games", ">#767 in Sports & Outdoors > Sports & Fitness > Leisure Sports & Game Room > Arcade & Table Games", ">#1,043 in Video Games > PC Games > PC Games"], "also_view": ["B000A40W54", "B0009PCGJO", "B000F71066", "B00005LBVS", "B000QX67N0", "B0000CDZUZ", "B001BFRPVU", "B00005NN17", "B012WFMC5Q", "B000BCEJ5E", "B0130DF8PA", "B015UA1SXC", "B00BYD056G", "B00CIVVSIW", "B004H4ABMW", "B01G424H8I", "B00009VRG5", "B000EMRVB0", "B00002S6E5", "B075MYCBM7", "B00005LBVU", "0439042445", "0439381673", "B006R12EA0", "B00097CZAM", "B002BUUMK0", "B00SNAJZO6", "B002U0L1BU", "B072LFL5YR", "0590481355", "B000RY9CBW", "B004QDJAZI", "B0002667AO", "B000SQKC4A", "B001GAR6PU", "B00BYCZZH6", "B01L8QI6DW", "B00ZVL6X68", "0590481371", "0439903491", "B01MQWTO7E", "B019VI9QRE", "B006WVR9CI", "B00005LBW1", "B00KCUURO2", "0439524717"], "main_cat": "Video Games",  "price": "", "asin": "0439900581", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51QvibEqWHL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51SCpb47mgL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51xCARNZGYL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51K7cLClhqL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51H3djmFfTL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51QvibEqWHL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51SCpb47mgL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51xCARNZGYL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51K7cLClhqL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51H3djmFfTL.jpg"]},
{"category": ["Video Games", "PC", "Games", , "Titanic themed game"],  "description": ["On April 14, 1912, the great steamship RMS Titanic struck an iceberg and within hours it sank to the bottom of the Atlantic Ocean. As part of the Hidden Expedition Adventure League, it`s your job to explore the wreckage of this once-majestic ship and collect antique artifacts for the Titanic Museum. Through 14 diving missions you will scour 17 locations on the ship for cleverly-hidden clues that will lead you to the ultimate artifact: The Crown Jewels. Get ready to lose yourself in a historic adventure of epic proportions!"], "title": "Hidden Expedition: Titanic", "brand": "by\n    \n    Scholastic", "feature": ["Titanic themed game"], "rank": [">#138,110 in Video Games (See Top 100 in Video Games)", ">#19,920 in Video Games > PC Games > PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0439922593", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51sG59K7hRL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51sG59K7hRL.jpg"]},
{"category": ["Video Games", "PC", "Games", , "a"],  "description": ["Video Game Tycoon Gold Edition"], "title": "Video Game Tycoon Gold Edition", "brand": "by\n    \n    VIDEO GAME TYCOON", "feature": ["a"], "rank": [">#88,312 in Video Games (See Top 100 in Video Games)", ">#11,034 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0545036372", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/41x7rWYc8-L._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41xVS7KqJoL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41a3VBAK8UL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41x7rWYc8-L.jpg", "https://images-na.ssl-images-amazon.com/images/I/41xVS7KqJoL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41a3VBAK8UL.jpg"]},
{"category": ["Video Games", "PC", "Games", , "5 Games in one!", "Includes new planes, new missions, and the entire IL-2 Collection"],  "description": [], "title": "IL-2 Sturmovik 1946", "also_buy": ["B00CM7ZRJS", "B00009OY9U", "B00PAAPYME", "B00GOJSOT0"], , "brand": "by\n    \n    Ubisoft", "feature": ["5 Games in one!", "Includes new planes, new missions, and the entire IL-2 Collection"], "rank": [">#61,281 in Video Games (See Top 100 in Video Games)", ">#6,318 in Video Games &gt; PC Games &gt; PC Games"], "also_view": ["B00CM7ZRJS", "B000N4JENW", "B0027FFRHM", "B00005QB9O"], "main_cat": "Video Games",  "price": "", "asin": "0545109744", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/21d2re0PxML._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/21d2re0PxML.jpg"]},
{"category": ["Video Games", "PC", "Games", , "ESRB Rating: Everyone", "Genre: Pet Simulation"],  "description": ["Help keep multiple pets healthy in this Pet Veterinarian simulation."], "title": "Petz Vet", "brand": "by\n    \n    Ubisoft", "feature": ["ESRB Rating: Everyone", "Genre: Pet Simulation"], "rank": [">#113,120 in Video Games (See Top 100 in Video Games)", ">#1,761 in Video Games &gt; Mac Games &gt; Mac Games", ">#15,702 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0545112141", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51OAY9n3iPL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51OAY9n3iPL.jpg"]},
{"category": ["Video Games", "PC", "Games", ],  "description": ["In AGEOD's American Civil War - The Blue and the Gray, players are military and political leaders trying to lead the troops of their nations (armies and fleets) to victory, in the midst of some of the toughest operations during those five years of wild campaigning throughout a divided nation. Most of the individual years of campaign between 1861 and 1865 are playable via a separate scenario. Advanced scenarios will allow recreation of some yearly and/or theatre campaigns, and there will be of course the complete Grand Campaign covering the whole war."], "title": "Ageod's American Civil War 1861-1865 the Blue and the Gray", "brand": "by\n    \n    cdv software entertainment", "feature": [], "rank": [">#78,947 in Video Games (See Top 100 in Video Games)", ">#9,295 in Video Games &gt; PC Games &gt; PC Games"], "also_view": ["B00GJV45SM"], "main_cat": "Video Games",  "price": "", "asin": "0545115507", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/41Jc%2BCMutQL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51iBCLCleVL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/41Jc%2BCMutQL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51iBCLCleVL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Breathtaking action in full HD resolution brings you radically improved facial textures &amp; eye movement, true-to-life crowd reactions &amp; celebration sequences, &amp; much more.  New Signature Defensive Styles &amp; more Signature Shorts, dunks, &amp; free throws give you EVEN MORE distinctive player styles.  Now your teammates &amp; your opponents read, react, &amp; adjust in real time.  All-new NBA.com interface, Player Ambitions, Player Scouting, &amp; more options for the casual player make this the most robust Franchise mode ever."], "title": "NBA 2K9", "brand": "2K Games", "feature": ["2K HD", "Styles upon Styles", "Adaptive AI", "The Association 2.0"], "rank": [">#95,681 in Video Games (See Top 100 in Video Games)", ">#12,394 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0545149223", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51xNUKNsd6L._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51HtGCINIzL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51xNUKNsd6L.jpg", "https://images-na.ssl-images-amazon.com/images/I/51HtGCINIzL.jpg"]},
{"category": ["Video Games", "Xbox 360", "Games", ],  "description": ["The franchise that has defined a generation of gaming is set to raise the bar once again with the all-new Call of Duty: Ghosts. Published by Activision and developed by Infinity Ward, the studio that created the original Call of Duty and the critically-acclaimed Call of Duty: Modern Warfare series, Call of Duty: Ghosts ushers in the next generation of the franchise, delivering a riveting all-new gameplay experience built on an entirely new story, setting and cast, all powered by a new next-generation Call of Duty engine."], "title": "Call of duty ghost", "brand": "by\n    \n    Activision", "feature": [], "rank": [">#60,480 in Video Games (See Top 100 in Video Games)", ">#2,166 in Video Games &gt; Xbox 360 &gt; Games"], "also_view": ["B002I098JE", "B00GVFE1Q2", "B00GFRK8Z4", "B00YX0Z40Y", "B01NCE21EA", "B00EEMLJGO"], "main_cat": "Video Games",  "price": "\n\t\t\t\t\t\t\t\t\t\t\t\t<span class=\"verticalAlign a-size-large\"", "asin": "0545540860", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/21-wEAg4wZL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/21-wEAg4wZL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/21-wEAg4wZL.jpg", "https://images-na.ssl-images-amazon.com/images/I/21-wEAg4wZL.jpg"]},
{"category": ["Video Games", "PlayStation 4", "Consoles", , "500GB of storage", "Powerful processing and impressive graphics"],  "description": ["<br />"], "title": "Sony PlayStation 4 PS4 500GB Original Matte Black CUH-1215A System (Used)", "brand": "by\n    \n    Sony", "feature": ["500GB of storage", "Powerful processing and impressive graphics"], "rank": [">#106,978 in Video Games (See Top 100 in Video Games)", ">#407 in Video Games &gt; PlayStation 4 &gt; Consoles"], "also_view": ["B012HTV52S", "B01D3L7MA8", "B011L4D3BG", "B01M0RU6LY", "B071CV8CG2"], "main_cat": "Video Games",  "price": "", "asin": "0662476565", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/31SNwA6-JBL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41EbhJNG8DL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31eBUfa6ArL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31B92Rf5K6L._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41Q-sVN3R2L._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41eEzNUItQL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41sBtt3mwLL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41%2BzH6FeknL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41-ZQzF6cOL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/31SNwA6-JBL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41EbhJNG8DL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31eBUfa6ArL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31B92Rf5K6L.jpg", "https://images-na.ssl-images-amazon.com/images/I/41Q-sVN3R2L.jpg", "https://images-na.ssl-images-amazon.com/images/I/41eEzNUItQL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41sBtt3mwLL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41%2BzH6FeknL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41-ZQzF6cOL.jpg"]},
{"category": ["Video Games", "PC", "Games", , "Attacking Intelligence - Players have the ability to analyze space, work harder and smarter to break down the defense, and think two plays ahead. Plus, players make runs that pull defenders out of position and open passing channels for teammates.", "Complete Dribbling - Face your opponent and use precise dribble touches combined with true 360-degree mobility with the ball. Be more creative and dangerous in 1v1 opportunities.", "1st Touch Control - A new system transforms the way players control the ball, eliminating near-perfect touch for every player, and creating more opportunities for defenders to capitalize on errant balls and poor touches to win back possession.", "EA Sports Football Club - Join the club and experience soccer's social network. Earn rewards, level up, enjoy live challenges, and connect with friends. Everything within FIFA 13, and against friends, is measured in a meaningful way. Fans can earn rewards to unlock items from the new Football Club Catalog, and build their status as they climb 100 levels. Real-world storylines drive Football Club through regular challenges so that FIFA 13 will look, feel and play like the real-world season. Support your club and compete against rivals in every area of the game, lifting your club higher in the league tables or helping them avoid relegation. Plus, the new EA Sports Football Club App for the iPhone enables fans to access to their EA Sports Football Club identity and friends, manage their FIFA Ultimate Team, search the live auctions and bid to win new players.", "Multiplayer Support - Enjoy multiplayer action with friends and family both locally, and online."],  "description": ["FIFA 13 is the 2012 release in Electronic Arts' long-running professional soccer game franchise. Based on the current real-life players, teams and leagues associated with the FIFA organization (Federation International de Football), the game aims to present the most realistic international soccer experience available in a video game to-date. Features include, gameplay mechanics improvements on both offense and defense, an extensive roster of players, teams and leagues, multiplayer play options both locally and online, and social network functionality through the EA Sports Football Club.  \n\n\nFIFA 13 captures all the drama and unpredictability of real-world soccer, and is driven by five game-changing innovations which revolutionize artificial intelligence, dribbling, ball control and physical play. It is the largest and deepest feature set in the history of the franchise. These innovations create a true battle for possession across the entire pitch, deliver freedom and creativity in attack, and capture all the drama and unpredictability of the real-world game."], "title": "FIFA Soccer 2013 - PC-DVD Import - Free Action Game with Every Purchase", "brand": "by\n    \n    FIFA SOCCER 2014", "feature": ["Attacking Intelligence - Players have the ability to analyze space, work harder and smarter to break down the defense, and think two plays ahead. Plus, players make runs that pull defenders out of position and open passing channels for teammates.", "Complete Dribbling - Face your opponent and use precise dribble touches combined with true 360-degree mobility with the ball. Be more creative and dangerous in 1v1 opportunities.", "1st Touch Control - A new system transforms the way players control the ball, eliminating near-perfect touch for every player, and creating more opportunities for defenders to capitalize on errant balls and poor touches to win back possession.", "EA Sports Football Club - Join the club and experience soccer's social network. Earn rewards, level up, enjoy live challenges, and connect with friends. Everything within FIFA 13, and against friends, is measured in a meaningful way. Fans can earn rewards to unlock items from the new Football Club Catalog, and build their status as they climb 100 levels. Real-world storylines drive Football Club through regular challenges so that FIFA 13 will look, feel and play like the real-world season. Support your club and compete against rivals in every area of the game, lifting your club higher in the league tables or helping them avoid relegation. Plus, the new EA Sports Football Club App for the iPhone enables fans to access to their EA Sports Football Club identity and friends, manage their FIFA Ultimate Team, search the live auctions and bid to win new players.", "Multiplayer Support - Enjoy multiplayer action with friends and family both locally, and online."], "rank": [">#115,247 in Video Games (See Top 100 in Video Games)", ">#16,116 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0700026355", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/418ieIvmITL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31fO9vLT%2BzL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31bwOfIWdGL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41kH0ck%2BHvL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31Ujbf3R3%2BL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31Mi%2BcjI44L._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31Tg5PaB%2BWL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41%2BxQjGjSSL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31goxx%2BolJL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/418ieIvmITL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31fO9vLT%2BzL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31bwOfIWdGL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41kH0ck%2BHvL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31Ujbf3R3%2BL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31Mi%2BcjI44L.jpg", "https://images-na.ssl-images-amazon.com/images/I/31Tg5PaB%2BWL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41%2BxQjGjSSL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31goxx%2BolJL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["ANNO 2070BRAND NEW - IN STOCKDVD Rom Software for Windows 7 / Vista / XP"], "title": "Anno 2070", "brand": "Ubisoft", "feature": ["A new era: while adhering to the fundamentals that made the Anno franchise a success, the near-future setting will bring numerous new gameplay mechanics, architectural breakthroughs, and all new challenges. Additionally, players will be able to build massive cities, the scope of which has never been seen in prior Anno games.", "A dynamic world: the world of Anno 2070 will evolve differently depending on each players playing style and choices. Players decisions will have an impact on the environment, the architectural look of their world, and the needs of their populations, leading them to refine and better understand the impact of their personal approaches to managing the worlds resources.", "Factions: players will be able to select between two factions when building their empires. Players can choose between an industrial and efficient course by joining the Tycoons or a more sustainable and environmentally-friendly direction by siding with the Ecos.", "Multiplayer and Online features: Anno 2070 will include innovative online modes offering players brand new possibilities to get in touch with gamers all around the world.", "Single player campaign: a story-driven single player mode with a deep variety of challenges. Single player \"continuous mode\": the renowned endless game mode where the objective is to build the biggest civilization possible without time constraints."], "rank": [">#30,230 in Video Games (See Top 100 in Video Games)", ">#2,108 in Video Games &gt; PC Games &gt; PC Games"], "also_view": ["B013F0IP1C", "B00JDP1AWU", "B00XR3YC2E", "B001AWMCMQ", "B00EZI4RVQ", "B002SKDIKE", "B00ZV6U1XY", "B00HWMP0TU", "B07GHXQW3Z", "B00AZGC3VI", "B07J9L4HC2", "B07D3F8LX3", "B07JB58VK6", "B07GHXMMYF", "B06ZZCDZDQ", "B007FTE2VW", "B07JGVHHQ5", "B07J4VJX6L", "B000AB603U", "B07JW76BFS", "B074YN5CKM", "B00PV2S6EE", "B00001NTSO", "B07J63W42X", "B0014468XE", "B07HJSXWK3", "B0035FYXW8", "B01GXOWUDQ", "B07GHVWMBS", "B0000C0YW2", "B07GHXQTGZ", "B01HHBQBLG", "B01GXOX35A", "B01FEHJYUU", "B06XXY43WH", "B079G9FDHX", "B076S558ZZ", "B00009V3NQ", "B076RCTXGX", "B01IA9HLMM", "B07GHVK4KN", "B079J2N8Q8", "B00000G16I", "B077Z6LFQ1", "B076S4RH6K", "B076RT2ZVV", "B0762Q49NV", "B076X89CWV", "B01GAI64GO", "B06XXZBPHZ", "B06XY25VTC", "B01K5F8MJK", "B01GLYD7MG", "B07GJ3Z8W2", "B07417FZS6", "B07GG9L5X1", "B01KVZBNY0"], "main_cat": "Video Games",  "price": "$7.95", "asin": "0700026657", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51naywTctIL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51naywTctIL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Hitman: Absolution follows Agent 47, a cold-blooded assassin, who takes on his most dangerous contract to date. Betrayed by those he once trusted -- and now hunted by the police -- he suddenly finds himself at the center of a dark conspiracy and must embark on a personal journey through a corrupt and twisted world. Boasting a cinematic story, distinctive art direction and highly original game design, Hitman: Absolution combines much-loved classic gameplay with features never seen before in the Hitman franchise."], "title": "HITMAN ABSOLUTION (PC)", "brand": "Square Enix", "feature": ["PC-DVD Import", "Showcasing Glacier 2 technology - HITMAN: ABSOLUTION has been built from the ground up to deliver a cinematic story, distinctive art direction, and cutting-edge game and sound design", "Freedom of Choice - Stalk from the shadows or rush in guns blazing thanks to fully-evolved game mechanics and a sophisticated AI-System that responds realistically to every tactic you employ", "Experience a Living, Breathing World - Robust and memorable characters spring to life on the screen with an outstanding cast of Hollywood performers, ensuring every moment becomes a story in HITMAN: ABSOLUTION", "Disguises - A huge variety of disguises, you can impersonate your victims and blend into the world around you, affording you new actions, options, and the element of surprise. Instinct Mode - Predict enemy patrols, identify weapons and escape routes, and temporarily enhance your disguise--even engage in 'Point-Shooting,' making full use of your skills as an expert marksman to clear entire rooms with stylish efficiency"], "rank": [">#58,163 in Video Games (See Top 100 in Video Games)", ">#5,832 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0700026398", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/419K-CbjmYL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/419K-CbjmYL.jpg"]},
{"category": ["Video Games", "PC", "Games", , "Limited Edition Includes: 3 Exclusive Cars in The RUN Story Mode, NEW Chevrolet Camaro ZL1 (Z28), NEW Porsche 911 Carrera S, NEW Lamborghini Aventador, EXCLUSIVE Challenge Series, EXCLUSIVE events, EXCLUSIVE profile customization options and rewards/badges", "Unleash the power of three vehicles exclusive to this Limited Edition, including the Lamborghini Aventador, the Chevrolet Camaro ZL1 and the Porsche 911 Carrera S", "Open up the 700 HP untamed Lamborghini Aventador and frighten your rivals, bully back the cops in the Chevrolet Camaro ZL1 and experience the sheer power and pinpoint handling of the most highly anticipated car of 2011, the Porsche 911 Carrera S", "Put your driving skills and new elite cars to the test with this Limited Edition's five exclusive racing events, fresh content, new chances to battle your friends on Autolog and earn bonus rewards and achievements", "Engage in high-octane multiplayer racing and join races already in progress with matchmaking technology, create a party with friends and pick a playlist of your favorite challenges and vie for racing supremacy across every stage ofThe Run"],  "description": ["Bonus contents of the Limited Edition:\n\nLamborghini Aventador - Open up this 700hp untamed beast on the highway and you'll see the fear in your rival's eyes.\n\nChevrolet Camaro ZL1 - When your life is on the line the Camaro will be bullied by no one.\n\nPorsche 911 Carrera S - Finally, who wouldn't want to drive the most highly anticipated car of 2011? With its raw power and pin point handling, the Carrera S is exclusive to Need for Speed The Run.\n\nNow that you have your elite cars, the five exclusive Limited Edition racing events will put them to the test. The Limited Edition serves up all new opportunities to battle your friends on Autolog and the chance to master your driving skills while earning bonus rewards and achievements. \n\nIt's called The Run. An illicit, high-stakes race across the country. The only way to get your life back is to be the first from San Francisco to New York. No speed limits. No rules. No allies. All you have are your driving skills and sheer determination as you battle hundreds of the world's most notorious drivers on the country's most dangerous roads. In Need for Speed The Run, you'll weave through dense urban centers, rocket down icy mountain passes and navigate narrow canyons at breakneck speeds, all the while evading a relentless police force prepared  and willing  to use lethal force to take you down.\n\nWith no speed limits, rules or allies available, only Jack's determination and driving skills will keep him going in this heart-stopping race to get his life back. Thrills and excitement hide around every corner of this breakneck race across the country, but so do the police  and the men who want him dead. Evading these ruthless forces in one town won't be enough. You must have the Need for Speed."], "title": "Need for Speed: The Run - Limited Edition - PC-DVD - Free Action Game with Every Purchase", "brand": "by\n    \n    Need for Speed: The Run - Limited Edition", "feature": ["Limited Edition Includes: 3 Exclusive Cars in The RUN Story Mode, NEW Chevrolet Camaro ZL1 (Z28), NEW Porsche 911 Carrera S, NEW Lamborghini Aventador, EXCLUSIVE Challenge Series, EXCLUSIVE events, EXCLUSIVE profile customization options and rewards/badges", "Unleash the power of three vehicles exclusive to this Limited Edition, including the Lamborghini Aventador, the Chevrolet Camaro ZL1 and the Porsche 911 Carrera S", "Open up the 700 HP untamed Lamborghini Aventador and frighten your rivals, bully back the cops in the Chevrolet Camaro ZL1 and experience the sheer power and pinpoint handling of the most highly anticipated car of 2011, the Porsche 911 Carrera S", "Put your driving skills and new elite cars to the test with this Limited Edition's five exclusive racing events, fresh content, new chances to battle your friends on Autolog and earn bonus rewards and achievements", "Engage in high-octane multiplayer racing and join races already in progress with matchmaking technology, create a party with friends and pick a playlist of your favorite challenges and vie for racing supremacy across every stage ofThe Run"], "rank": [">#105,344 in Video Games (See Top 100 in Video Games)", ">#14,287 in Video Games &gt; PC Games &gt; PC Games"], "also_view": ["B002I0HFNU", "B00511POIG"], "main_cat": "Video Games",  "price": "", "asin": "0700026649", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/510temxWgkL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41edANCePUL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41A8ZdtjmKL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41S1wPJFuDL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41g4u427GBL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/419bA9Lff7L._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41w05rYNxBL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41u1xe9Vq2L._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/41vNhDhmQuL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/510temxWgkL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41edANCePUL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41A8ZdtjmKL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41S1wPJFuDL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41g4u427GBL.jpg", "https://images-na.ssl-images-amazon.com/images/I/419bA9Lff7L.jpg", "https://images-na.ssl-images-amazon.com/images/I/41w05rYNxBL.jpg", "https://images-na.ssl-images-amazon.com/images/I/41u1xe9Vq2L.jpg", "https://images-na.ssl-images-amazon.com/images/I/41vNhDhmQuL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Dirt 3 is a popular rally racing game for PlayStation 3 that combines the feel of fast-paced arcade style racing action across multiple surfaces and environments with realistic features found on real off-road circuits. The third release in the acclaimed off-road racing franchise, Dirt 3 features a range of racing and driving disciplines at spectacular locations, more than 100 routes, the finest selection of licensed action-sports racing cars, multistage rallies set at classic locations, exhilarating snow racing action and mesmerizing Gymkhana race events."], "title": "Dirt 3", "brand": "Dirt 3", "feature": ["DiRT 3 delivers mud, sweat and gears the world over: from the intense weather-beaten rally stages of Europe, Africa and the US", "The game boasts more cars, more locations, more routes and more events than any other game in the series", "Rally returns with more than double the amount of the content.", "Gamers can test their car control to the very limi and drift, spin-dry and jump their way to stardom in all new Gymkhana events.", "For the first time in the Dirt series, players will enjoy the unique and exhilarating spectacle of racing on snow."], "rank": [">#50,093 in Video Games (See Top 100 in Video Games)", ">#4,600 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0700099867", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51B6ICPxbeL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51B6ICPxbeL.jpg"]},
{"category": ["Video Games", "PC", "Games", ],  "description": ["This software is BRAND NEW. Packaging may differ slightly from the stock photo above. Please click on our logo above to see over 15,000 titles in stock."], "title": "You Don't Know Jack: Movies", "brand": "by\n    \n    Jelleyvision", "feature": ["CD Rom Game - You Dont' Know Jack: Movies", "Watch Movie Clips And Guess The Title Of The Movie."], "rank": [">#29,576 in Video Games (See Top 100 in Video Games)", ">#230 in Video Games &gt; Mac Games &gt; Mac Games", ">#2,024 in Video Games &gt; PC Games &gt; PC Games"], , "main_cat": "Video Games",  "price": "\n\t\t\t\t\t\t\t\t\t\t\t\t<span class=\"verticalAlign a-size-large\"", "asin": "0758534531", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/418VCRJHJYL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/418VCRJHJYL.jpg"]},
{"category": ["Video Games", "PC", "Games"],  "description": ["Barbie Story Maker for the PC(CD-ROM)\nWindows 3.1, 95, &amp; 98", "", ""], "title": "Barbie Storymaker Cd Rom", "brand": "", "feature": [], "rank": "17,209,518 in Books (", , "main_cat": "Books",  "price": "$1.90", "asin": "0763030945", "imageURL": [], "imageURLHighRes": []},
{"category": ["Video Games", "PC", "Games"],  "description": ["video game"], "title": "The Complete Ultima VII", "brand": "Electronic Arts", "feature": ["Includes The Black Gate, Forge of Virtue, Serpent Isle, and The Silver Seed", "Full-screen view - everything in Britannia is larger and more richly detailed", "Totally mouse-driven interface - you can talk to characters without typing a single word", "A feast of sound and music - a dynamic cinematic soundtrack and digitized speech and sound effects"], "rank": [">#81,500 in Video Games (See Top 100 in Video Games)", ">#9,787 in Video Games &gt; PC Games &gt; PC Games"], "also_view": ["B000028U20"], "main_cat": "Video Games",  "price": "", "asin": "0784506086", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51IZll92h7L._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/512Wvt8pHYL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51IZll92h7L.jpg", "https://images-na.ssl-images-amazon.com/images/I/512Wvt8pHYL.jpg"]},
{"category": ["Video Games", "PC", "Games", ],  "description": ["- Seller will transfer this level 90 Horde Death Knight to the Buyers pre-existing WoW account.\n\n- Seller will provide a Server Transfer and Name Change upon initial purchase if buyer requests.\n\n- Check out the following link for a complete profile on this character:\n\nhttp://us.battle.net/wow/en/character/deathwing/Plya/simple"], "title": "Level 90 WoW Character", "brand": "by\n    \n    Horde - Level 90 Deathknight", "feature": [], "rank": [">#215,231 in Video Games (See Top 100 in Video Games)", ">#3,964 in Video Games &gt; Mac Games &gt; Mac Games", ">#28,256 in Video Games &gt; PC Games &gt; PC Games"], "also_view": ["B01E9XN3RK", "B0777RS5SC"], "main_cat": "Video Games",  "price": "", "asin": "0784930724", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51mJyytlJVL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51V25vXrJFL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51%2BowzKhvaL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51N7KVkZEtL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51nVYSsrAuL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51mJyytlJVL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51V25vXrJFL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51%2BowzKhvaL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51N7KVkZEtL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51nVYSsrAuL.jpg"]},
{"category": ["Video Games", "PC", "Games", , "World of Warcraft Account", "4 level 90's", "Many level 85+'s and many more high levels", "Most Professions Maxed out", "Account has been active since 2007."],  "description": ["Selling WOW Account + Diablo 3 + HearthstoneBeta\n\nI've had the account since 2007 and leveled up a lot of characters/professions.\nThere is more than what is listed here but these are the key points.\n\n 90 Death Knight ilvl 476\n 90 Warrior ilvl 474\n 90 Monk ilvl 462\n 90 Mage ilvl 441\n 88 Shaman\n 86 Rogue with Fear and Vengeance\n 85 Paladin, Priest, Shaman, Druid\n 80 Warrior, Death Knight\n\nProfessions:\n\nLeather Working: 600\nSkinning: 600\nCooking: 600\nFirst Aid: 600\nMining: 600\nTailoring: 600\nAlchemy: 600\nHerbalism: 600\nEnchanting: 600\nJewel Crafting: 600\nInscription: 600\n\nOther:\n5815 Achievement Points\n13 Feats of Strength\n170 Pets\n10 Rare/Epic Mounts\n20,000+ Gold total\nHeirloom Gear\n8 Titles\n\nFeel free to email me or message me for more information or payment details. I can send the information over Skype or phone if that's preferred."], "title": "World of Warcraft Account + Diablo 3 + Hearthstone Beta", "brand": "by\n    \n    Blizzard Entertainment", "feature": ["World of Warcraft Account", "4 level 90's", "Many level 85+'s and many more high levels", "Most Professions Maxed out", "Account has been active since 2007."], "rank": [">#188,689 in Video Games (See Top 100 in Video Games)", ">#25,841 in Video Games &gt; PC Games &gt; PC Games"], "also_view": ["160887804X", "B0030GUGC8", "B078T8VHK4", "B07C66X2XX", "B00494EQWG", "B074D262R5", "B01E9XN3Q6", "B000IZAN7C", "B01GGGCB08", "B076C84DGZ", "B075XHKL4Z", "B008AWBRD4", "B015L8GIU6", "B002O05RRA", "168383142X", "B01A0RMMIU", "B004DCPS7G", "1616558474", "B013FAB9TC", "B01ABIOZ5G", "B0777RS5SC", "B01LOSC62Q", "B06W2M55VS", "B01MSQKALO", "B07CH2RMQK", "B000P9IKS0", "B0083F31K0", "B01BVKLPPG", "B004CZF97I", "1616558458", "B002MNNFY6", "B00L86C2GA", "B005L38QHA"], "main_cat": "Video Games",  "price": "", "asin": "0784930805", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/516KCadNm-L._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/517jRpWswYL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51IPoez37CL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/513S%2BB3s9%2BL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51OAfSfmCjL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/513NNzJlPEL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51ge1CdcKWL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51Qu9QRByUL._AC_SX150_SY75_CR,0,0,150,75_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51VTYsR5kZL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/516KCadNm-L.jpg", "https://images-na.ssl-images-amazon.com/images/I/517jRpWswYL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51IPoez37CL.jpg", "https://images-na.ssl-images-amazon.com/images/I/513S%2BB3s9%2BL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51OAfSfmCjL.jpg", "https://images-na.ssl-images-amazon.com/images/I/513NNzJlPEL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51ge1CdcKWL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51Qu9QRByUL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51VTYsR5kZL.jpg"]},
{"category": [],  "description": ["It's 6 Legend Of Zelda strategy guides, offered in a numbered, Limited Edition set with a certificate of authenticity: Wind Waker HD, Skyward Sword, Ocrena of Time, Spirit Tracks, Twilight Princess and Phantom Hourglass. Combined with the custom treasure chest book holder and gold 2-sided bookmark, this combo is truly unique. Makes the perfect, and ultimate, gift for the Legends of Zelda fan!"], "title": "Legend of Zelda Box Set Prima Official Game Guide", "also_buy": ["1911015214", "1911015222", "1506703356", "1101898437", "074401669X", "1506710115", "150670638X", "0744019044", "1506707408", "1616550414", "1911015486", "B01N33OBYK", "1506710107", "B01N10NIBP", "0804162727", "3869930829", "B01N6QPWBV", "0744017033", "B01N33LIXR", "1421589613", "1421542420", "B06ZZ6FKGF", "B01LDWMGNC", "B071Y79VNL", "1421589605", "B01N4NTNO2", "1421589591", "B01N4D1161", "B06XRSXJNG", "B075MZT53Z", "B01MZ9QJ0Y", "197470226X", "B01N224U9S", "1421589621", "B07GX4GWC2", "142158963X", "B07B3YJG8H", "0744017114", "0744018706", "B01MS90ZVL", "B01LDWMIAI", "B07FK62VMR", "B072KJ357G", "B07BC326XK", "B07FK8Q7RR", "B01N9RAP7M", "0744018870", "B071GPJPH4", "B007J3ISIM", "B07538J5ZG", "B071GPJQ92", "B06ZZQWMF2", "B01LDWMHLI", "B01HK5DJAU", "B01MY7SFWM", "B071CNSKWB", "B01HK5BT0W", "B072N3T6MV", "B01N9R7HEU", "B073SMTXLZ", "B07HC4ZD3B", "B01HK5II7O", "B01KUMSJHS", "B00O92ONBM", "B001TOQ8UW", "B01I4FGW0E", "B01LDUYTYS", "B000FRV2UK", "B01N21YHC5", "B01MYDJR14", "B00YK2Q5HQ", "B078Y3HVK8", "B071K9NFC8", "1421593475", "B06XHYDSG2", "1930206569", "B07DPMGNG4", "1421598264", "1421596563", "0744018145", "B00PG6ZAZ8", "B075FCXXWK", "B00Y074JRY", "0744018749", "B00GANWVJE", "1506708978", "B01I4FGVZU", "B073ZWJWQL", "B01GKHJPAC", "B01LC9A5Y8", "B01MT8SWKC", "B00PB9LZQI", "1930206100", "B07B4ZXBDY", "0744018323", "1506706622", "074401767X", "B06Y2FNRQP", "1524770078"], , "brand": "DIAMOND SELECT TOYS", "feature": ["Set includes 6x Legend Of Zelda strategy guides", "Officially licensed release, includes Eija Aonuma autographed Certificate Of Authenticity", "All feature hard cover design, 7.5\" 2 sided gold bookmark included", "Limited edition, Includes Custom treasure chest book holder", "Brand new"], "rank": [">#16,405 in Video Games (See Top 100 in Video Games)"], "also_view": ["1911015486", "1506703356", "1616550414", "1506707408", "1101898437", "1911015214", "0744017025", "1421542420", "1911015230", "1421589591", "1506710115", "0804162212", "1506710107", "150670638X", "1421589613", "1930206461", "074401669X", "B00H2YD2WU", "0744019044", "B007R75N0Q", "0804161356", "9526529219", "1911015494", "1775133508", "1421575418", "1566868084", "0761509208", "0307465934", "0744018870", "1421589605", "0744017114", "0744019540", "197470226X", "B076D6DSTH", "B07BYST97M", "B077SS8LCY", "142158963X", "1421593475", "1506708978", "0761557857", "B076R399XR", "0307892026", "3869930896", "B01N4D1161", "B01GPUOHO8", "1101898402", "B002I0GEHI", "0307891534", "3869930829", "0761541187", "B07DVJHNLH", "B00H2XH8SK", "B07B4ZXBDY", "1421596563", "B00S8IGG4U", "B075MND5D2", "B01FO7K4YA", "1101898046"], "main_cat": "Video Games",  "price": "$299.00", "asin": "0804161380", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51NEif44coL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/51WyBTud%2BPL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/510pgL4VAYL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/31r%2B1OBkXSL._SX38_SY50_CR,0,0,38,50_.jpg", "https://images-na.ssl-images-amazon.com/images/I/317UnBCDZzL._SX38_SY50_CR,0,0,38,50_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51NEif44coL.jpg", "https://images-na.ssl-images-amazon.com/images/I/51WyBTud%2BPL.jpg", "https://images-na.ssl-images-amazon.com/images/I/510pgL4VAYL.jpg", "https://images-na.ssl-images-amazon.com/images/I/31r%2B1OBkXSL.jpg", "https://images-na.ssl-images-amazon.com/images/I/317UnBCDZzL.jpg"]},
{"category": ["Video Games", "PC"],  "description": ["The player is Max, an American journalist in Paris. There seems to be a story at hand, about a big drug dealer who is covered by some influential person in politics. To get the dealer talking, the player offers him a photography in exchange for some information. But when the player gets there, the druglord is dead and everyones on their back - mistaking them for the killer.\n\nThe game itself is a movie adventure on four CD-ROMs, dividing gameplay in Clue- and Action-turns. The player can control the game completely via mouse."], "title": "Urban Runner                         C/W95/Us", "brand": "", "feature": ["ESRB: Mature", "Genre: Adventure, Puzzle-Solving"], "rank": [">#121,166 in Video Games (See Top 100 in Video Games)", ">#31,079 in Video Games > PC Games"], , "main_cat": "Video Games",  "price": "", "asin": "0871773732", "imageURL": [], "imageURLHighRes": []},
{"category": ["Video Games", "PC", "Games", , "MS DOS game. Gouraud shaded subs and ships in a fantastic 3D environment with rolling waves, whitecaps, fog, and weather effects", "Special effects including explosions, burning ships and dramatic sinkings", "Evolving technology and tactics used by each side, such as new weapons, detection systems and counter measures", "Highly sophisticated artificial intelligence provides realistic enemy behavior, such as creeping attacks and plaster attacks", "Single missions, training and Campaign modes of play with adjustable realism settings for players of every skill"],  "description": ["This is for MS DOS! Authentic sound effects, including digitized crew speech, creaking hulls, deapth charge explosions and the twisting metal of sinking ships take you into the most desperate battle of W.W.11. An arsenal of torpedoes including pattern running and acoustic homing makes this experience of submersible war machines prowling the stormy seas unforgetable. It takes you to the icy water of the North Atlantic in a battle where the hunter becomes the hunted. Encluded is the manual, complete with historical overview, U boat capabilities and tactics, convoy tactics and an exquisite color map. This software version comes on 3.5 floppy disc, not on CD-ROM"], "title": "Aces of the Deep", "brand": "by\n    \n    Sierra", "feature": ["MS DOS game. Gouraud shaded subs and ships in a fantastic 3D environment with rolling waves, whitecaps, fog, and weather effects", "Special effects including explosions, burning ships and dramatic sinkings", "Evolving technology and tactics used by each side, such as new weapons, detection systems and counter measures", "Highly sophisticated artificial intelligence provides realistic enemy behavior, such as creeping attacks and plaster attacks", "Single missions, training and Campaign modes of play with adjustable realism settings for players of every skill"], "rank": [">#49,938 in Video Games (See Top 100 in Video Games)", ">#4,608 in Video Games > PC Games > PC Games"], "also_view": ["0871774828"], "main_cat": "Video Games",  "price": "", "asin": "0871770261", "imageURL": ["https://images-na.ssl-images-amazon.com/images/I/51k0HDoy%2BpL._AC_SX150_SY75_CR,0,0,150,75_.jpg"], "imageURLHighRes": ["https://images-na.ssl-images-amazon.com/images/I/51k0HDoy%2BpL.jpg"]}
]
